
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>11. 内存管理 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lotuc; MrMathematica">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap12.html" />
    
    
    <link rel="prev" href="chap10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                     1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                     2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                     3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                     4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                     5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                     6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                     7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                     8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                     9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="chap15.html">
            
                <a href="chap15.html">
            
                    
                    15. 静态地检查程序中的不变量：类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="chap16.html">
            
                <a href="chap16.html">
            
                    
                    16. 动态地检查程序中的不变量：契约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chap17.html">
            
                <a href="chap17.html">
            
                    
                    17. 其他调用语义
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >11. 内存管理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="11-&#x5185;&#x5B58;&#x7BA1;&#x7406;">11 &#x5185;&#x5B58;&#x7BA1;&#x7406;</h1>
<h2 id="111-&#x5783;&#x573E;">11.1 &#x5783;&#x573E;</h2>
<p><strong>&#x5783;&#x573E;</strong>&#xFF08;garbage&#xFF09;&#x6307;&#x7684;&#x662F;&#x5DF2;&#x5206;&#x914D;&#x4F46;&#x662F;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5185;&#x5B58;&#x3002;&#x5178;&#x578B;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#x3002;&#x4E00;&#x79CD;&#x662F;&#x5206;&#x914D;&#x7ED9;&#x73AF;&#x5883;&#xFF1B;&#x8FD9;&#x79CD;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#x8981;&#x548C;&#x9759;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x652F;&#x6301;&#x63A8;&#x5165;&#xFF08;push&#xFF09;&#x548C;&#x5F39;&#x51FA;&#xFF08;pop&#xFF09;&#x64CD;&#x4F5C;&#x3002;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x65F6;&#xFF0C;&#x4E3A;&#x5176;&#x73AF;&#x5883;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#x4E5F;&#x88AB;&#x8FD4;&#x56DE;&#xFF0C;&#x4F9B;&#x540E;&#x7EED;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#xFF0C;&#x770B;&#x4F3C;&#x6CA1;&#x6709;&#x6210;&#x672C;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#xFF0C;&#x5728;&#x8D2E;&#x5B58;&#x4E2D;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x5FC5;&#x987B;&#x4F34;&#x968F;&#x67D0;&#x4E2A;&#x503C;&#x7684;&#x4E00;&#x751F;&#xFF0C;&#x53EF;&#x80FD;&#x8981;&#x8D85;&#x8FC7;&#x5176;&#x521B;&#x5EFA;&#x4F4D;&#x7F6E;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x2014;&#x2014;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4E00;&#x76F4;&#x5B58;&#x6D3B;&#x4E0B;&#x53BB;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#x6765;&#x56DE;&#x6536;&#x5728;&#x8D2E;&#x5B58;&#x4E2D;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x5783;&#x573E;&#x3002;</p>
<blockquote>
<p>&#x5E76;&#x975E;&#x6CA1;&#x6709;&#x6210;&#x672C;&#x3002;&#x786C;&#x4EF6;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x201C;&#x5F39;&#x51FA;&#x201D;&#x6307;&#x4EE4;&#x3002;&#x8FD9;<strong>&#x4E0D;&#x89C1;&#x5F97;</strong>&#x5C31;&#x4E00;&#x5B9A;&#x6BD4;&#x5176;&#x4ED6;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7B56;&#x7565;&#x66F4;&#x9AD8;&#x6548;&#x3002;</p>
</blockquote>
<p>&#x7A7A;&#x95F4;&#x56DE;&#x6536;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x5927;&#x4F53;&#x53EF;&#x4EE5;&#x5206;&#x5230;&#x4E24;&#x4E2A;&#x9635;&#x8425;&#x4E2D;&#xFF1A;&#x4EBA;&#x5DE5;&#x548C;&#x81EA;&#x52A8;&#x3002;&#x4EBA;&#x5DE5;&#x7684;&#x65B9;&#x5F0F;&#x4F9D;&#x8D56;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x80FD;&#x591F;&#x4E86;&#x89E3;&#x5185;&#x5B58;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x6B63;&#x786E;&#x7684;&#x91CA;&#x653E;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5185;&#x5B58;&#x3002;&#x4E00;&#x822C;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EBA;&#x5E76;&#x4E0D;&#x64C5;&#x957F;&#x505A;&#x8FD9;&#x79CD;&#x4E8B;&#xFF08;&#x867D;&#x7136;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EBA;&#x7C7B;&#x62E5;&#x6709;&#x673A;&#x5668;&#x6240;&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x7684;&#x77E5;&#x8BC6;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x51E0;&#x5341;&#x5E74;&#x6765;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x8D8A;&#x6765;&#x8D8A;&#x666E;&#x53CA;&#x3002;</p>
<h2 id="112-&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF1F;">11.2 &#x4EC0;&#x4E48;&#x6837;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x662F;&#x201C;&#x6B63;&#x786E;&#x7684;&#x201D;&#xFF1F;</h2>
<p>&#x5783;&#x573E;&#x56DE;&#x6536;&#x65E2;&#x4E0D;&#x5E94;&#x8BE5;&#x592A;&#x65E9;&#x5730;&#x6536;&#x56DE;&#x7A7A;&#x95F4;&#xFF08;<strong>&#x53EF;&#x9760;&#x6027;</strong>&#xFF0C;soundness&#xFF09;&#x4E5F;&#x4E0D;&#x80FD;&#x592A;&#x665A;&#xFF08;<strong>&#x5B8C;&#x5907;&#x6027;</strong>&#xFF0C;completeness&#xFF09;&#x3002;&#x867D;&#x7136;&#x4E24;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x89C6;&#x4E3A;&#x7F3A;&#x9677;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x5F71;&#x54CD;&#x5E76;&#x4E0D;&#x662F;&#x5BF9;&#x79F0;&#x7684;&#xFF1A;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x8FC7;&#x65E9;&#x6536;&#x56DE;&#x7CDF;&#x7CD5;&#x5F97;&#x591A;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x8FC7;&#x65E9;&#x56DE;&#x6536;&#x4E86;&#x67D0;&#x4E2A;&#x8D2E;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x8BA1;&#x7B97;&#x5C06;&#x7EE7;&#x7EED;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5C06;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5199;&#x5165;&#x8BE5;&#x5730;&#x5740;&#xFF0C;&#x4ECE;&#x800C;&#x8BBF;&#x95EE;&#x5230;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x6570;&#x636E;&#x3002;&#x5F80;&#x597D;&#x4E86;&#x8BF4;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#x540E;&#x679C;&#x66F4;&#x4E25;&#x91CD;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x8FC7;&#x8FDF;&#x6536;&#x56DE;&#x4F1A;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x635F;&#x5931;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x7EC8;&#x6B62;&#xFF0C;&#x5C3D;&#x7BA1;&#x6B64;&#x65F6;&#x5B58;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;&#x8FD9;&#x79CD;&#x6027;&#x80FD;&#x635F;&#x5931;&#x4EE5;&#x53CA;&#x7A0B;&#x5E8F;&#x8FC7;&#x65E9;&#x7EC8;&#x6B62;&#x5F88;&#x4EE4;&#x4EBA;&#x8BA8;&#x538C;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x5173;&#x952E;&#x4EFB;&#x52A1;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x91CD;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x81F3;&#x5C11;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x8FDB;&#x884C;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x8FD0;&#x7B97;&#x3002;</p>
<p>&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x62E5;&#x6709;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E09;&#x9879;&#xFF1A;&#x81EA;&#x52A8;&#x5316;&#xFF08;automation&#xFF09;&#xFF0C;&#x53EF;&#x9760;&#x6027;&#x548C;&#x5B8C;&#x5907;&#x6027;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x7684;&#x662F;&#x4E0D;&#x53EF;&#x517C;&#x5F97;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x9009;&#x62E9;&#x4E24;&#x9879;&#x3002;&#x7406;&#x60F3;&#x7684;&#x4EBA;&#x7C7B;&#x80FD;&#x591F;&#x505A;&#x5230;&#x53EF;&#x9760;&#x6027;&#x548C;&#x5B8C;&#x5907;&#x6027;&#xFF0C;&#x4F46;&#x5B9E;&#x8DF5;&#x4E2D;&#x5B9E;&#x73B0;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x90FD;&#x5F88;&#x5C11;&#x89C1;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x53EF;&#x9760;&#x6027;&#x548C;&#x5B8C;&#x5907;&#x6027;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x4F46;&#x53EF;&#x8BA1;&#x7B97;&#x6027;&#x8BBA;&#x8BC1;&#x8868;&#x660E;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x8FBE;&#x6210;&#x8FD9;&#x4E24;&#x8005;&#x3002;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x6280;&#x672F;&#x4E00;&#x822C;&#x9009;&#x62E9;&#x5B9E;&#x73B0;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x51FA;&#x4E8E;&#x4EE5;&#x4E0B;&#x539F;&#x56E0;&#xFF1A;&#xFF08;a&#xFF09;&#x5B83;&#x9020;&#x6210;&#x7684;&#x635F;&#x5BB3;&#x6700;&#x5C0F;&#xFF1B;&#xFF08;b&#xFF09;&#x5B83;&#x76F8;&#x5BF9;&#x66F4;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF1B;&#xFF08;c&#xFF09;&#x5728;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x4EBA;&#x5DE5;&#x5E2E;&#x52A9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x8FD1;&#x5B8C;&#x5907;&#x6027;&#x3002;</p>
<blockquote>
<p><strong>&#x4F60;</strong>&#x5F53;&#x7136;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x540C;&#x884C;&#x5462;&#xFF1F;&#x987A;&#x4FBF;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x7ECF;&#x6D4E;&#x5B66;&#x7406;&#x8BBA;&#x5728;&#x7B49;&#x4F60;&#x9A8C;&#x8BC1;&#x5462;&#x3002;</p>
</blockquote>
<h2 id="113-&#x4EBA;&#x5DE5;&#x56DE;&#x6536;">11.3 &#x4EBA;&#x5DE5;&#x56DE;&#x6536;</h2>
<p>&#x4EBA;&#x5DE5;&#x7684;&#x6700;&#x5F7B;&#x5E95;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x5C06;&#x6240;&#x6709;&#x5185;&#x5B58;&#x56DE;&#x6536;&#x4EA4;&#x7531;&#x4EBA;&#x64CD;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;C&#x8BED;&#x8A00;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x4E2A;&#x57FA;&#x672C;&#x6307;&#x4EE4;&#xFF1A;<code>malloc</code>&#x7528;&#x4E8E;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;<code>free</code>&#x7528;&#x4E8E;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x3002;<code>malloc</code>&#x7684;&#x8F93;&#x5165;&#x662F;&#xFF08;&#x5185;&#x5B58;&#x7684;&#xFF09;&#x5927;&#x5C0F;&#xFF0C;&#x8FD4;&#x56DE;&#x662F;&#x5BF9;&#x8D2E;&#x5B58;&#x7684;&#x5F15;&#x7528;&#xFF1B;<code>free</code>&#x7684;&#x8F93;&#x5165;&#x662F;&#x8FD9;&#x79CD;&#x5F15;&#x7528;&#xFF0C;&#x91CA;&#x653E;&#x5176;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<blockquote>
<pre><code>        &#x201C;&#x5728;&#x5F53;&#x4EE3;&#x6B27;&#x7F8E;&#x8BED;&#x8A00;&#xFF0C;&quot;Moloch&quot;&#x6469;&#x6D1B;&#x8FD9;&#x4E2A;&#x8BCD;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x5F15;&#x7533;&#x4E49;&#xFF0C;&#x6307;&#x4EE3;&#x9700;&#x8981;&#x6781;&#x5927;&#x727A;&#x7272;&#x7684;&#x4EBA;&#x7269;&#x6216;&#x8005;&#x4E8B;&#x4E1A;&#x3002;&#x201D;&#x2014;&#x2014;[&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#xFF0C;&#x6469;&#x6D1B;&#x8BCD;&#x6761;](http://en.wikipedia.org/wiki/Moloch)
        &#x201C;&#x6211;&#x4E0D;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x542C;&#x8D77;&#x6765;&#x50CF;malloc&#x662F;&#x5DE7;&#x5408;&#x3002;&#x201D;&#x2014;&#x2014;Ian Barland
</code></pre></blockquote>
<h3 id="1131-&#x5B8C;&#x5168;&#x4EBA;&#x5DE5;&#x56DE;&#x6536;&#x7684;&#x4EE3;&#x4EF7;">11.3.1 &#x5B8C;&#x5168;&#x4EBA;&#x5DE5;&#x56DE;&#x6536;&#x7684;&#x4EE3;&#x4EF7;</h3>
<p>&#x5148;&#x6765;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5047;&#x8BBE;<code>malloc</code>&#x6709;&#x4E2A;&#x6307;&#x5411;&#x8D2E;&#x5B58;&#x7684;&#x5173;&#x8054;&#x5BC4;&#x5B58;&#x5668;&#xFF08;&#x6BD4;&#x5982;<code>new-loc</code>&#xFF09;&#xFF0C;&#x6BCF;&#x6B21;&#x5206;&#x914D;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x83B7;&#x53D6;&#x4E0B;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x2014;&#x2014;&#x53EF;&#x60DC;&#x53EA;&#x662F;&#x770B;&#x4E0A;&#x53BB;&#x7B80;&#x5355;&#x800C;&#x5DF2;&#x3002;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x7528;<code>free</code>&#x91CA;&#x653E;&#x5185;&#x5B58;&#x65F6;&#x3002;&#x5982;&#x679C;&#x8C03;&#x7528;<code>free</code>&#x9488;&#x5BF9;&#x7684;&#x662F;&#x6700;&#x540E;&#x4E00;&#x6B21;<code>malloc</code>&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x90A3;&#x4E48;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF1B;&#x4F46;&#x662F;&#x8D2E;&#x5B58;&#x4E2D;&#x6570;&#x636E;&#x4E00;&#x822C;&#x4E0D;&#x9075;&#x5806;&#x6808;&#x7684;&#x89C4;&#x5F8B;&#x3002;&#x5982;&#x679C;&#x91CA;&#x653E;&#x7684;&#x4E0D;&#x662F;&#x6700;&#x65B0;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x5C06;&#x4F1A;&#x5728;&#x8D2E;&#x5B58;&#x4E2D;&#x7559;&#x4E0B;&#x7A7A;&#x6D1E;&#x3002;&#x7A7A;&#x6D1E;&#x4F1A;&#x5BFC;&#x81F4;<strong>&#x788E;&#x7247;&#x5316;</strong>&#xFF08;fragmentation&#xFF09;&#xFF0C;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5373;&#x4F7F;&#x8D2E;&#x5B58;&#x4E2D;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x5206;&#x914D;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x2014;&#x2014;&#x8BB8;&#x591A;&#x5206;&#x5272;&#x7684;&#x788E;&#x7247;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x8DB3;&#x591F;&#x5927;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x6240;&#x6709;&#x7A7A;&#x4F59;&#x7A7A;&#x95F4;&#x76F8;&#x90BB;&#x6765;&#x89E3;&#x51B3;&#x788E;&#x7247;&#x5316;&#x7684;&#x95EE;&#x9898;&#x3002;&#x600E;&#x4E48;&#x8FBE;&#x6210;&#x8FD9;&#x4E00;&#x70B9;&#xFF1F;&#x4ED4;&#x7EC6;&#x8003;&#x8651;&#x6240;&#x6709;&#x7684;&#x540E;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x624B;&#x5DE5;&#x8FDB;&#x884C;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x624B;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x65B9;&#x6848;&#x4E2D;&#xFF0C;&#x788E;&#x7247;&#x5316;&#x4ECD;&#x7136;&#x662F;&#x4E2A;&#x4E0D;&#x53EF;&#x514B;&#x670D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x8FD9;&#x4E2A;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6848;&#x91CC;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4E1C;&#x897F;&#x503C;&#x5F97;&#x8003;&#x8651;&#x3002;&#x91CA;&#x653E;&#x67D0;&#x4E2A;&#x503C;&#x4E4B;&#x540E;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x7528;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x8FD9;&#x5757;&#x5185;&#x5B58;&#x53EF;&#x88AB;&#x5206;&#x914D;&#x3002;&#x5B83;&#x662F;&#x901A;&#x8FC7;&#x7EF4;&#x62A4;<strong>&#x7A7A;&#x95F2;&#x8868;</strong>&#x2014;&#x2014;&#x7A7A;&#x95F2;&#x7A7A;&#x95F4;&#x7684;&#x94FE;&#x8868;&#x2014;&#x2014;&#x6765;&#x8FBE;&#x6210;&#x8FD9;&#x70B9;&#x7684;&#x3002;&#x7A0D;&#x4F5C;&#x601D;&#x8003;&#x5C31;&#x4F1A;&#x60F3;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x7A7A;&#x95F2;&#x8868;&#x5B58;&#x5728;&#x54EA;&#xFF0C;<strong>&#x5B83;&#x7684;</strong>&#x5185;&#x5B58;&#x53C8;&#x7531;&#x8C01;&#x6765;&#x7BA1;&#x7406;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x7A7A;&#x95F2;&#x8868;&#x5B58;&#x653E;&#x5728;&#x7A7A;&#x95F2;&#x7684;&#x5185;&#x5B58;&#x5355;&#x5143;&#x683C;&#x4E2D;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5185;&#x5B58;&#x5206;&#x914D;&#x65F6;&#x5B58;&#x5728;&#x6700;&#x5C0F;&#x5206;&#x914D;&#x5355;&#x5143;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x6BCF;&#x6B21;<code>malloc</code>&#x73B0;&#x5728;&#x5FC5;&#x987B;&#x904D;&#x5386;&#x7A7A;&#x95F2;&#x8868;&#x4EE5;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8BF4;&#x201C;&#x5408;&#x9002;&#x201D;&#x662F;&#x56E0;&#x4E3A;&#x5206;&#x914D;&#x8005;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x590D;&#x6742;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x9047;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#x5C31;&#x5206;&#x914D;&#x5462;&#x8FD8;&#x662F;&#x7EE7;&#x7EED;&#x627E;&#x627E;&#xFF1F;&#x800C;&#x4E14;&#x201C;&#x5339;&#x914D;&#x201D;&#x53C8;&#x662F;&#x600E;&#x4E48;&#x5B9A;&#x4E49;&#x7684;&#x5462;&#xFF1F;&#x5E94;&#x8BE5;&#x9009;&#x53D6;&#x90A3;&#x4E9B;&#x5927;&#x5C0F;&#x521A;&#x597D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD8;&#x662F;&#x5C06;&#x5927;&#x4E9B;&#x7684;&#x7A7A;&#x95F4;&#x62C6;&#x5206;&#x6210;&#x5C0F;&#x5757;&#xFF08;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x521B;&#x5EFA;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x5C0F;&#x7A7A;&#x95F4;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF09;&#xFF1F;&#x8FD8;&#x6709;&#x5176;&#x5B83;&#x8BF8;&#x591A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x5E0C;&#x671B;&#x5185;&#x5B58;&#x5206;&#x914D;&#x9AD8;&#x6548;&#x3002;&#x3010;&#x6CE8;&#x91CA;1&#x3011;&#x56E0;&#x6B64;&#xFF0C;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5206;&#x914D;&#x7CFB;&#x7EDF;&#x503E;&#x5411;&#x4E8E;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x7EC4;&#x56FA;&#x5B9A;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x901A;&#x5E38;&#x662F;2&#x7684;&#x5E42;&#x3002;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x662F;&#x53EA;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x8868;&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x6BCF;&#x4E2A;&#x5C3A;&#x5BF8;&#xFF08;&#x90FD;&#x662F;2&#x7684;&#x5E42;&#xFF09;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x7A7A;&#x95F2;&#x8868;&#x3002;&#x7136;&#x540E;&#x518D;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x8FD9;&#x4E9B;&#x8868;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x4F4D;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x51CF;&#x5C0F;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x7684;&#x4EE3;&#x4EF7;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x6D6A;&#x8D39;&#x4E00;&#x4E9B;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x9700;&#x8981;&#x90A3;&#x4E9B;&#x4E0D;&#x662F;2&#x7684;&#x5E42;&#x5C3A;&#x5BF8;&#x7684;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x6700;&#x7EC8;&#x5206;&#x914D;&#x7ED9;&#x5176;&#x7684;&#x5185;&#x5B58;&#x5C3E;&#x90E8;&#x5C06;&#x4F1A;&#x6709;&#x7A7A;&#x4F59;&#x3002;&#xFF08;&#x8FD9;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#x7ECF;&#x5178;&#x7684;&#x53D6;&#x820D;(trade-off)&#xFF1A;&#x7A7A;&#x95F4;&#x6362;&#x65F6;&#x95F4;&#xFF09;&#x3002;<code>free</code>&#x9700;&#x8981;&#x5C06;&#x91CA;&#x653E;&#x7684;&#x5185;&#x5B58;&#x653E;&#x5230;&#x5408;&#x9002;&#x7684;&#x94FE;&#x8868;&#x4E2D;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x9700;&#x8981;&#x5C06;&#x8F83;&#x5927;&#x5757;&#x7684;&#x5185;&#x5B58;&#x5206;&#x5272;&#x6210;&#x5C0F;&#x5757;&#x4EE5;&#x4E3A;&#x5C06;&#x6765;&#x7684;&#x5206;&#x914D;&#x505A;&#x51C6;&#x5907;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x90FD;&#x4E0D;&#x50CF;&#x770B;&#x4E0A;&#x53BB;&#x7684;&#x90A3;&#x6837;&#x9AD8;&#x6548;&#x3002;&#x3010;&#x6CE8;&#x91CA;2&#x3011;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E0D;&#x591F;&#x9AD8;&#x6548;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4F1A;&#x5C1D;&#x8BD5;&#x5404;&#x79CD;&#x5947;&#x6280;&#x8D62;&#x5DE7;&#x6765;&#x91CD;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x4F1A;&#x964D;&#x4F4E;&#x4EE3;&#x7801;&#x7684;&#x6E05;&#x6670;&#x6027;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x7279;&#x522B;&#x5730;&#xFF0C;<code>free</code>&#x5E76;&#x4E0D;&#x514D;&#x8D39;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x53CC;&#x5173;&#xFF09;&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x57FA;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5199;&#x51FA;&#x53EF;&#x9760;&#xFF08;&#x5FFD;&#x7565;&#x5B8C;&#x5907;&#xFF09;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x3002;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x505A;&#x4E0D;&#x5230;&#x3002;</p>
<h3 id="1132-&#x5F15;&#x7528;&#x8BA1;&#x6570;">11.3.2 &#x5F15;&#x7528;&#x8BA1;&#x6570;</h3>
<p>&#x7531;&#x4E8E;&#x5B8C;&#x5168;&#x624B;&#x5DE5;&#x5185;&#x5B58;&#x56DE;&#x6536;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x5E26;&#x6765;&#x6781;&#x5927;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x4E00;&#x4E9B;&#x534A;&#x81EA;&#x52A8;&#x5316;&#x6280;&#x672F;&#x88AB;&#x5E7F;&#x4E3A;&#x4F7F;&#x7528;&#xFF0C;&#x6700;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x4FBF;&#x662F;<strong>&#x5F15;&#x7528;&#x8BA1;&#x6570;</strong>&#xFF08;reference counting&#xFF09;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x5173;&#x8054;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#xFF0C;&#x8BB0;&#x5F55;&#x5BF9;&#x5176;&#x5F15;&#x7528;&#x7684;&#x4E2A;&#x6570;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x8D1F;&#x8D23;&#x8D1F;&#x8D23;&#x9012;&#x589E;&#x548C;&#x9012;&#x51CF;&#x8FD9;&#x4E9B;&#x8BA1;&#x6570;&#x3002;&#x5F53;&#x8BA1;&#x6570;&#x964D;&#x4E3A;0&#x65F6;&#xFF0C;&#x8BE5;&#x503C;&#x7684;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x7684;&#x56DE;&#x6536;&#x4F9B;&#x672A;&#x6765;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x4E0A;&#x9762;&#x7B80;&#x5355;&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#x9690;&#x85CF;&#x4E86;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x5047;&#x8BBE;&#xFF1A;</p>
<ol>
<li>&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x8BB0;&#x5F55;&#x6BCF;&#x4E00;&#x6B21;&#x5F15;&#x7528;&#x3002;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#xFF0C;&#x522B;&#x540D;&#x4E5F;&#x662F;&#x5F15;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x5199;&#x51FA;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;<pre><code class="lang-Racket"> (let ([x &lt;some value&gt;])
   (let ([y x])
     ..))
</code></pre>
&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x8BB0;&#x4F4F;<code>y</code>&#x662F;&#x5BF9;<code>x</code>&#x5F15;&#x7528;&#x7684;&#x90A3;&#x4E2A;&#x503C;&#x7684;&#x7B2C;&#x4E8C;&#x6B21;&#x5F15;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x589E;&#x52A0;&#x8BE5;&#x503C;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x503C;&#x53EA;&#x6709;&#x6709;&#x9650;&#x4E2A;&#x5F15;&#x7528;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x4E2D;&#x5B58;&#x5728;&#x73AF;&#x8DEF;&#xFF0C;&#x8FD9;&#x6761;&#x5047;&#x8BBE;&#x4E0D;&#x6210;&#x7ACB;&#x3002;</li>
</ol>
<p>&#x7531;&#x4E8E;&#x9700;&#x8981;&#x624B;&#x52A8;&#x9012;&#x589E;&#x548C;&#x9012;&#x51CF;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x7F3A;&#x4E4F;&#x53EF;&#x9760;&#x6027;&#x4E0E;&#x5B8C;&#x5907;&#x6027;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4E0A;&#x8FF0;&#x7B2C;&#x4E8C;&#x4E2A;&#x5047;&#x8BBE;&#x81EA;&#x7136;&#x5BFC;&#x81F4;&#x5B8C;&#x5907;&#x6027;&#x7684;&#x4E27;&#x5931;&#xFF0C;&#x800C;&#x7B2C;&#x4E00;&#x4E2A;&#x5047;&#x8BBE;&#x5219;&#x6307;&#x51FA;&#x4E86;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6253;&#x7834;&#x53EF;&#x9760;&#x6027;&#x3002;</p>
<p>&#x624B;&#x5DE5;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x7684;&#x5F0A;&#x7AEF;&#x8FD8;&#x53EF;&#x4EE5;&#x66F4;&#x4E3A;&#x6DF1;&#x5C42;&#x9690;&#x6666;&#x3002;&#x7531;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x8D1F;&#x8D23;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF08;&#x6216;&#x8005;&#xFF0C;&#x7B49;&#x6548;&#x7684;&#xFF0C;&#x7BA1;&#x7406;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF09;&#xFF0C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7B56;&#x7565;&#x5FC5;&#x987B;&#x6210;&#x4E3A;&#x6BCF;&#x4E2A;&#x5E93;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x5373;&#xFF0C;&#x201C;&#x5E93;&#x4E2D;&#x5206;&#x914D;&#x7684;&#x503C;&#x8C01;&#x6765;&#x91CA;&#x653E;&#xFF1F;&#x5E93;&#x4F1A;&#x5426;&#x91CA;&#x653E;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x7684;&#x503C;&#xFF1F;&#x201D;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x7528;&#x6587;&#x6863;&#x51C6;&#x786E;&#x8BB0;&#x5F55;&#x3001;&#x5E76;&#x9075;&#x5B88;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x4FE1;&#x606F;&#x6781;&#x5176;&#x56F0;&#x96BE;&#xFF0C;&#x66F4;&#x7CDF;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x4F1A;&#x5BFC;&#x81F4;&#x6587;&#x6863;&#x4E2D;&#x5145;&#x65A5;&#x5173;&#x4E8E;&#x5E95;&#x5C42;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4E0E;&#x5E93;&#x8981;&#x5C01;&#x88C5;&#x7684;&#x884C;&#x4E3A;&#x6BEB;&#x65E0;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x5C06;&#x8BA1;&#x6570;&#x503C;&#x7684;&#x589E;&#x51CF;<strong>&#x81EA;&#x52A8;&#x5316;</strong>&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#x5728;&#x5B9E;&#x73B0;&#x4E2D;&#x6DFB;&#x52A0;&#x5FAA;&#x73AF;&#x68C0;&#x6D4B;&#xFF08;cycle-detection&#xFF09;&#x3002;&#x5F15;&#x5165;&#x8FD9;&#x4E24;&#x8005;&#x5C06;&#x89E3;&#x51B3;&#x4E0A;&#x8FF0;&#x7684;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4F1A;&#x589E;&#x52A0;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x8BA1;&#x6570;&#x5668;&#x9700;&#x8981;&#x8DB3;&#x591F;&#x5927;&#x4EE5;&#x9632;&#x6B62;&#x6EA2;&#x51FA;&#xFF0C;&#x53C8;&#x8981;&#x8DB3;&#x591F;&#x5C0F;&#x4EE5;&#x907F;&#x514D;&#x8FC7;&#x591A;&#x7684;&#x5185;&#x5B58;&#x5360;&#x7528;&#x3002;</li>
<li>&#x5BF9;&#x8FD9;&#x4E9B;&#x8BA1;&#x6570;&#x5668;&#x503C;&#x7684;&#x589E;&#x51CF;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x76F8;&#x5F53;&#x53EF;&#x89C2;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x964D;&#x81F3;0&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x6240;&#x5F15;&#x7528;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x7684;&#x8BA1;&#x6570;&#x503C;&#x90FD;&#x9700;&#x8981;&#x51CF;&#x4E00;&#xFF0C;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x9012;&#x5F52;&#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E00;&#x6B21;&#x91CA;&#x653E;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x4F1A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#xFF0C;&#x9664;&#x975E;&#x4F7F;&#x7528;&#x806A;&#x660E;&#x7684;&#x201C;&#x60F0;&#x6027;&#xFF08;lazy&#xFF09;&#x201D;&#x6280;&#x5DE7;&#xFF08;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x53C8;&#x4F1A;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x5360;&#x7528;&#x589E;&#x52A0;&#xFF09;&#x3002;</li>
<li>&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x8BA1;&#x6570;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x904D;&#x5386;&#x5DF2;&#x7ECF;&#x662F;&#x5783;&#x573E;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x8FDD;&#x53CD;&#x76F4;&#x89C9;&#xFF1A;&#x904D;&#x5386;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x4E2D;&#x8FD9;&#x4F1A;&#x4EA7;&#x751F;&#x540E;&#x679C;&#xFF1A;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x4E0D;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x5BF9;&#x8C61;&#x6709;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5F88;&#x4E45;&#x6CA1;&#x6709;&#x88AB;&#x8BBF;&#x95EE;&#x8FC7;&#x4E86;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x88AB;&#x6362;&#x9875;&#x6362;&#x51FA;&#x5185;&#x5B58;&#x4E86;&#x3002;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x4EEC;&#x6362;&#x9875;&#x56DE;&#x5185;&#x5B58;&#xFF0C;&#x4EC5;&#x4E3A;&#x4E86;&#x544A;&#x8BC9;&#x5B83;&#x4EEC;&#x5B83;&#x4EEC;&#x4E0D;&#x518D;&#x88AB;&#x9700;&#x8981;&#x4E86;&#x3002;</li>
</ul>
<p>&#x51FA;&#x4E8E;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x5E94;&#x8C28;&#x614E;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;&#x4F60;&#x4E0D;&#x5E94;&#x63A5;&#x53D7;&#x5B83;&#x4F5C;&#x4E3A;&#x9ED8;&#x8BA4;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x8BE5;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x62D2;&#x7EDD;&#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x66F4;&#x597D;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6280;&#x672F;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x5982;&#x679C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6EA2;&#x51FA;&#x4E86;&#xFF0C;&#x54EA;&#x4E9B;&#x6B63;&#x786E;&#x6027;&#x5C5E;&#x6027;&#x88AB;&#x7834;&#x574F;&#xFF0C;&#x662F;&#x600E;&#x4E48;&#x88AB;&#x7834;&#x574F;&#x7684;&#xFF1F;&#x6743;&#x8861;&#x5229;&#x5F0A;&#x3002;</p>
</blockquote>
<h2 id="114-&#x81EA;&#x52A8;&#x56DE;&#x6536;&#xFF0C;&#x6216;&#x5783;&#x573E;&#x6536;&#x96C6;">11.4 &#x81EA;&#x52A8;&#x56DE;&#x6536;&#xFF0C;&#x6216;&#x5783;&#x573E;&#x6536;&#x96C6;</h2>
<blockquote>
<p>&#x6709;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x662F;&#x201C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x201D;&#x6280;&#x672F;&#x7684;&#x4E00;&#x79CD;&#x3002;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x7528;&#x540E;&#x4E00;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x6307;&#x5B8C;&#x5168;&#x81EA;&#x52A8;&#x7684;&#x6280;&#x672F;&#x3002;&#x4F46;&#x662F;&#x6D4F;&#x89C8;&#x7F51;&#x9875;&#x65F6;&#x8BF7;&#x6CE8;&#x610F;&#x53EF;&#x80FD;&#x7684;&#x6DF7;&#x6DC6;&#x3002;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x7B80;&#x8981;&#x5730;&#x8003;&#x5BDF;&#x4E00;&#x4E0B;&#x8BA9;&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x5316;&#x56DE;&#x6536;&#x5783;&#x573E;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x7F29;&#x5199;GC&#xFF08;<strong>Garbage Collection</strong>&#xFF09;&#x540C;&#x65F6;&#x6307;&#x4EE3;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x7B97;&#x6CD5;&#x4E0E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x533A;&#x5206;&#x5177;&#x4F53;&#x6307;&#x4EE3;&#x54EA;&#x4E2A;&#x3002;</p>
<h3 id="1141-&#x6982;&#x89C8;">11.4.1 &#x6982;&#x89C8;</h3>
<p>&#x6240;&#x6709;GC&#x7B97;&#x6CD5;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x901A;&#x8FC7;&#x503C;&#x95F4;&#x5F15;&#x7528;&#x5173;&#x7CFB;&#x904D;&#x5386;&#x5185;&#x5B58;&#x3002;&#x904D;&#x5386;&#x4ECE;<strong>&#x6839;&#x96C6;</strong>&#xFF08;root set&#xFF09;&#x5F00;&#x59CB;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x662F;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x5F15;&#x7528;&#x8D2E;&#x5B58;&#x4E2D;&#x503C;&#x7684;&#x6240;&#x6709;&#x5730;&#x65B9;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x6839;&#x96C6;&#x7531;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x7ED1;&#x5B9A;&#x53D8;&#x91CF;&#x4EE5;&#x53CA;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7EC4;&#x6210;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x5230;&#x7C7B;&#x4F3C;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x8FD9;&#x79CD;&#x6613;&#x901D;&#x503C;&#x3002;&#x4ECE;&#x6839;&#x96C6;&#x5F00;&#x59CB;&#xFF0C;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x7B97;&#x6CD5;&#x2014;&#x2014;&#x901A;&#x5E38;&#x662F;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x7684;&#x53D8;&#x4F53;&#x2014;&#x2014;&#x6765;&#x904D;&#x5386;&#x6240;&#x6709;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x503C;&#xFF0C;&#x4EE5;&#x8BC6;&#x522B;&#x6240;&#x6709;<strong>&#x5B58;&#x6D3B;&#x7684;</strong>&#x503C;&#xFF08;&#x5373;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F;&#x64CD;&#x4F5C;&#x7684;&#x5E8F;&#x5217;&#x53EF;&#x7528;&#x5230;&#x7684;&#x503C;&#xFF09;&#x3002;&#x6309;&#x5B9A;&#x4E49;&#x6240;&#x6709;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5C31;&#x662F;&#x5783;&#x573E;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x56DE;&#x6536;&#x8FD9;&#x4E9B;&#x7A7A;&#x95F4;&#x3002;</p>
<blockquote>
<p>&#x901A;&#x5E38;&#x9009;&#x7528;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x641C;&#x7D22;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x9002;&#x7528;&#x4E8E;&#x57FA;&#x4E8E;&#x5806;&#x6808;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#xFF08;&#x4E5F;&#x5E94;&#x8BE5;&#xFF09;&#x60F3;&#x77E5;&#x9053;GC&#x81EA;&#x5DF1;&#x7684;&#x6808;&#x5B58;&#x50A8;&#x5728;&#x54EA;&#x91CC;&#xFF01;</p>
</blockquote>
<h3 id="1142-&#x4E8B;&#x5B9E;&#x548C;&#x53EF;&#x8BC1;&#x6027;">11.4.2 &#x4E8B;&#x5B9E;&#x548C;&#x53EF;&#x8BC1;&#x6027;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4E0A;&#x9762;&#x6211;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;<strong>&#x7B97;&#x6CD5;</strong>&#x3002;&#x8FD9;&#x662F;<strong>&#x5B9E;&#x73B0;&#x7684;&#x7EC6;&#x8282;</strong>&#xFF0C;&#x800C;&#x4E0D;&#x662F;<strong>&#x89C4;&#x8303;</strong>&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF01;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x89C4;&#x8303;&#x662F;<strong>&#x4E8B;&#x5B9E;</strong>&#xFF08;truth&#xFF09;&#x7684;&#x8868;&#x8FF0;&#xFF1A;&#x6211;&#x4EEC;&#x8981;&#x51C6;&#x786E;&#x5730;&#x56DE;&#x6536;&#x6240;&#x6709;&#x662F;&#x5783;&#x573E;&#x7684;&#x503C;&#xFF0C;&#x4E0D;&#x591A;&#x4E5F;&#x4E0D;&#x5C11;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x6CA1;&#x6CD5;&#x5F97;&#x51FA;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x9000;&#x800C;&#x6C42;&#x5176;&#x6B21;&#xFF0C;&#x5BFB;&#x6C42;<strong>&#x53EF;&#x8BC1;&#x6027;</strong>&#xFF08;provability&#xFF09;&#x3002;&#x4E0A;&#x8FF0;&#x7684;&#x7B97;&#x6CD5;&#x63CF;&#x8FF0;&#x63D0;&#x4F9B;&#x4E86;&#x5B58;&#x6D3B;&#x6027;&#x7684;&#x6709;&#x6548;&#x201C;&#x8BC1;&#x660E;&#x201D;&#xFF0C;&#x5176;&#x8865;&#x96C6;&#x5C31;&#x662F;&#x5783;&#x573E;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x53D8;&#x79CD;&#xFF0C;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x6216;&#x66F4;&#x5C11;&#x7684;&#x5783;&#x573E;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x8BC1;&#x660E;&#x201C;&#x5783;&#x573E;&#x6027;&#x201D;&#x7684;&#x4E0D;&#x540C;&#x5F3A;&#x5EA6;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x8BF4;&#x7684;&#x6700;&#x540E;&#x4E00;&#x70B9;&#x6307;&#x51FA;&#x4E86;&#x4E25;&#x683C;&#x89C4;&#x8303;&#x672F;&#x8BED;&#x63CF;&#x8FF0;&#x4E2D;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x5BF9;&#x4E8E;&#x8981;&#x56DE;&#x6536;&#x591A;&#x5C11;&#x5783;&#x573E;&#x5B83;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x8BF4;&#x660E;&#x3002;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6709;&#x76CA;&#x7684;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5B8C;&#x5907;&#x7684;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x4E5F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x4F60;&#x80FD;&#x60F3;&#x5230;&#x600E;&#x4E48;&#x505A;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x8981;&#x505A;&#x5230;&#x53EF;&#x9760;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x786E;&#x4FDD;&#x4E0D;&#x4F1A;&#x9519;&#x8BEF;&#x7684;&#x79FB;&#x9664;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x5B58;&#x6D3B;&#x7684;&#x6570;&#x636E;&#x3002;&#x4E00;&#x79CD;&#x786E;&#x4FDD;&#x65E0;&#x7591;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x662F;<strong>&#x5B8C;&#x5168;&#x4E0D;&#x56DE;&#x6536;&#x5783;&#x573E;</strong>&#x3002;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#xFF0C;&#x5B8C;&#x5907;&#x7684;GC&#x56DE;&#x6536;<strong>&#x6240;&#x6709;&#x4E1C;&#x897F;</strong>&#x3002;&#x663E;&#x7136;&#x8FD9;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x65E0;&#x7528;&#x7684;&#xFF08;&#x540E;&#x8005;&#x663E;&#x7136;&#x6781;&#x5176;&#x5371;&#x9669;&#xFF09;&#x3002;&#x8FD9;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x7A0B;&#x5B9E;&#x8DF5;&#x6307;&#x660E;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x9700;&#x8981;GC&#x662F;&#x53EF;&#x9760;&#x7684;&#xFF0C;&#x4E5F;&#x5E0C;&#x671B;&#x5B83;&#x8DB3;&#x591F;&#x5B8C;&#x5907;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x8DB3;&#x591F;&#x9AD8;&#x6548;&#x3002;</p>
<h3 id="1143-&#x6838;&#x5FC3;&#x5047;&#x8BBE;">11.4.3 &#x6838;&#x5FC3;&#x5047;&#x8BBE;</h3>
<p>&#x80FD;&#x591F;&#x53EF;&#x9760;&#x5730;&#x6267;&#x884C;GC&#x4F9D;&#x8D56;&#x4E8E;&#x4E24;&#x6761;&#x5173;&#x952E;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x4E00;&#x6761;&#x6709;&#x5173;&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x53E6;&#x4E00;&#x6761;&#x6709;&#x5173;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x4E49;&#x3002;</p>
<ol>
<li><p>&#x5BF9;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x503C;&#xFF0C;GC&#x9700;&#x8981;&#x77E5;&#x9053;&#x8BE5;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x5B83;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x8868;&#x793A;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x904D;&#x5386;&#x5230;<code>cons</code>&#x5355;&#x5143;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#xFF1A;</p>
<ol>
<li>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<code>cons</code>&#x5355;&#x5143;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;</li>
<li>&#x5B83;&#x7684;<code>first</code>&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x4F8B;&#x5982;&#x4F4D;&#x4E8E;4&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x7684;&#x5730;&#x65B9;&#xFF0C;</li>
<li>&#x5B83;&#x7684;<code>rest</code>&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x4F8B;&#x5982;&#x4F4D;&#x4E8E;8&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x504F;&#x79FB;&#x91CF;&#x7684;&#x5730;&#x65B9;&#x3002;</li>
</ol>
<p>&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x5FC5;&#x987B;&#x9012;&#x5F52;&#x5730;&#x4FDD;&#x6301;&#xFF0C;&#x4F7F;&#x5F97;&#x904D;&#x5386;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x6B63;&#x786E;&#x6620;&#x5C04;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x503C;&#x3002;</p>
</li>
<li><p>&#x7A0B;&#x5E8F;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;<strong>&#x751F;&#x6210;</strong>&#x5F15;&#x7528;&#xFF1A;</p>
<ol>
<li>&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x4E0D;&#x80FD;&#x53D1;&#x751F;&#x5728;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x7684;&#x6839;&#x96C6;&#x4E4B;&#x5916;&#x3002;</li>
<li>&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x53EA;&#x80FD;&#x6307;&#x5411;&#x5BF9;&#x8C61;&#x4E2D;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x70B9;&#x3002;</li>
</ol>
<p>&#x8FDD;&#x53CD;&#x7B2C;&#x4E8C;&#x6761;&#x65F6;&#xFF0C;GC&#x5C06;&#x5B8C;&#x5168;&#x4E71;&#x5957;&#xFF0C;&#x9519;&#x8BEF;&#x7684;&#x89E3;&#x91CA;&#x6570;&#x636E;&#x3002;&#x7B2C;&#x4E00;&#x6761;&#x770B;&#x4E0A;&#x53BB;&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x88AB;&#x8FDD;&#x53CD;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x9519;&#x8BEF;&#x5730;&#x7406;&#x89E3;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x4E49;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x6761;&#x7684;&#x540E;&#x679C;&#x6709;&#x70B9;&#x5FAE;&#x5999;&#xFF0C;&#x4E0B;&#x9762;&#x5C06;&#x4F1A;&#x8BA8;&#x8BBA;&#x3002;</p>
</li>
</ol>
<h2 id="115-&#x4FDD;&#x5B88;&#x5783;&#x573E;&#x56DE;&#x6536;">11.5 &#x4FDD;&#x5B88;&#x5783;&#x573E;&#x56DE;&#x6536;</h2>
<p>&#x4E0A;&#x6587;&#x8BF4;&#x8FC7;&#xFF0C;&#x4E00;&#x822C;&#x6839;&#x96C6;&#x5305;&#x542B;&#x73AF;&#x5883;&#x3001;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x4E00;&#x4E9B;&#x6613;&#x901D;&#x503C;&#x3002;&#x5F15;&#x7528;&#x8FD8;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5728;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF1F;</p>
<p>&#x5728;&#x5927;&#x90E8;&#x5206;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#xFF08;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x4F60;&#x4EEC;&#xFF0C;C&#x548C;C++&#xFF09;&#x5141;&#x8BB8;&#x5C06;&#x5F15;&#x7528;&#x8F6C;&#x6362;&#x6210;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x5C06;&#x4EFB;&#x610F;&#x6570;&#x8F6C;&#x6362;&#x6210;&#x5F15;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;<strong>&#x4EFB;&#x4F55;</strong>&#x6570;&#x503C;&#xFF08;&#x7531;&#x4E8E;C&#x548C;C++&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x51E0;&#x4E4E;&#x4EFB;&#x4F55;&#x503C;&#xFF09;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x89C6;&#x4E3A;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#x4F7F;&#x5F97;&#x5B83;&#x95EE;&#x9898;&#x91CD;&#x91CD;&#x3002;&#x9996;&#x5148;&#xFF0C;GC&#x4E0D;&#x80FD;&#x53EA;&#x5C06;&#x5176;&#x6CE8;&#x610F;&#x529B;&#x96C6;&#x4E2D;&#x5230;&#x4E00;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x6839;&#x96C6;&#xFF1B;&#x73B0;&#x5728;&#x6574;&#x4E2A;&#x8D2E;&#x5B58;&#x90FD;&#x662F;&#x6F5C;&#x5728;&#x7684;&#x6839;&#x96C6;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5982;&#x679C;GC&#x8BD5;&#x56FE;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x4FEE;&#x6539;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x2014;&#x2014;&#x4F8B;&#x5982;&#x5728;&#x904D;&#x5386;&#x65F6;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x201C;&#x8BBF;&#x95EE;&#x201D;&#x4F4D;&#x2014;&#x2014;&#x8FD9;&#x65F6;&#x5B83;&#x53EF;&#x80FD;&#x4FEE;&#x6539;&#x4E86;&#x4E00;&#x4E2A;<strong>&#x975E;&#x5F15;&#x7528;</strong>&#x503C;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x5B9E;&#x9645;&#x4E0A;&#x6539;&#x53D8;&#x4E86;&#x7A0B;&#x5E8F;&#x4E2D;&#x67D0;&#x4E2A;&#xFF08;&#x770B;&#x4F3C;&#x65E0;&#x5173;&#x7684;&#xFF09;&#x6570;&#x578B;&#x5E38;&#x91CF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x50CF;C&#x548C;C++&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x7279;&#x5F81;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x4F7F;&#x5F97;&#x5408;&#x7406;&#x800C;&#x6709;&#x6548;&#x7684;GC&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x3002;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x5411;&#x2014;&#x2014;&#x79F0;&#x4E3A;<strong>&#x4FDD;&#x5B88;</strong>GC&#x2014;&#x2014;&#x6210;&#x529F;&#x7684;&#x4E3A;&#x6B64;&#x7C7B;&#x8BED;&#x8A00;&#x521B;&#x9020;&#x4E86;&#x8DB3;&#x591F;&#x9AD8;&#x6548;&#x7684;GC&#x7CFB;&#x7EDF;&#x3002;&#x4FDD;&#x5B88;&#xFF08;conservative&#xFF09;GC&#x80CC;&#x540E;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x7406;&#x8BBA;&#x4E0A;&#x6BCF;&#x4E2A;&#x8D2E;&#x5B58;&#x5730;&#x5740;&#x90FD;&#x53EF;&#x80FD;&#x5C5E;&#x4E8E;&#x6839;&#x96C6;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x4EEC;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x4E0D;&#x662F;&#x3002;&#x5B83;&#x4F1A;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x806A;&#x660E;&#x7684;&#x89C2;&#x5BDF;&#x6765;&#x63A8;&#x65AD;&#x51FA;&#x54EA;&#x4E9B;&#x4F4D;&#x7F6E;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x5F15;&#x7528;&#xFF08;&#x8FD9;&#x70B9;&#x548C;&#x4F20;&#x7EDF;GC&#x76F8;&#x53CD;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x4EEC;&#x5B89;&#x5168;&#x5730;<strong>&#x5FFD;&#x7565;</strong>&#x6389;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x5B57;&#x8282;&#x5BF9;&#x9F50;&#x7684;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x5947;&#x6570;&#x503C;&#x4E0D;&#x53EF;&#x80FD;&#x4E3A;&#x5F15;&#x7528;&#x3002;&#x901A;&#x8FC7;&#x5FFD;&#x7565;&#x5927;&#x90E8;&#x5206;&#x8D2E;&#x5B58;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#x4F5C;&#x51FA;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x5047;&#x5B9A;&#xFF08;&#x4F8B;&#x5982;&#x7A0B;&#x5E8F;&#x4E0D;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x67D0;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5F15;&#x7528;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5C0F;&#x5FC3;&#x64CD;&#x4F5C;&#x4E0D;&#x53BB;&#x4FEE;&#x6539;&#x8D2E;&#x5B58;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x6539;&#x53D8;&#x503C;&#x4E2D;&#x7684;&#x6BD4;&#x7279;&#xFF0C;&#x4E0D;&#x79FB;&#x52A8;&#x6570;&#x636E;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x8FD8;&#x7B97;&#x6709;&#x6548;&#x7684;GC&#x7B56;&#x7565;&#x3002;</p>
<blockquote>
<p>&#x523B;&#x9E44;&#x7C7B;&#x9E5C;&#x3002;</p>
</blockquote>
<p>&#x4FDD;&#x5B88;GC&#x5728;&#x90A3;&#x4E9B;&#x4F7F;&#x7528;&#x6216;&#x8005;&#x4F9D;&#x8D56;C&#x548C;C++&#x5B9E;&#x73B0;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65E9;&#x671F;&#x7684;Racket&#x5C31;&#x5B8C;&#x5168;&#x4F9D;&#x9760;&#x5B83;&#x3002;&#x8FD9;&#x662F;&#x57FA;&#x4E8E;&#x4EE5;&#x4E0B;&#x539F;&#x56E0;&#xFF1A;</p>
<ol>
<li>&#x5B83;&#x662F;&#x79CD;&#x4FBF;&#x6377;&#x7684;&#x81EA;&#x4E3E;&#x6280;&#x672F;&#xFF0C;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x8005;&#x80FD;&#x5F97;&#x4EE5;&#x5C06;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x5176;&#x5B83;&#x66F4;&#x5BCC;&#x9769;&#x65B0;&#x6027;&#x7684;&#x7279;&#x6027;&#x4E0A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BED;&#x8A00;&#x80FD;&#x63A7;&#x5236;&#x6240;&#x6709;&#x7684;&#x5F15;&#x7528;&#xFF08;&#x6BD4;&#x5982;Racket&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4FBF;&#x4E8E;&#x63D0;&#x9AD8;GC&#x6548;&#x7387;&#x7684;&#x5185;&#x5B58;&#x8868;&#x793A;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7528;1&#x586B;&#x5145;&#x6240;&#x6709;(&#x771F;&#x6B63;&#x7684;)&#x6570;&#x7684;&#x6700;&#x4F4E;&#x6709;&#x6548;&#x4F4D;&#xFF09;&#x3002;</li>
<li>&#x5B83;&#x4F7F;&#x5F97;&#x8BE5;&#x8BED;&#x8A00;&#x548C;C&#x4EE5;&#x53CA;C++&#x5B9E;&#x73B0;&#x7684;&#x5E93;&#x4EA4;&#x4E92;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#xFF08;&#x5F53;&#x7136;&#x524D;&#x63D0;&#x662F;&#x8FD9;&#x4E9B;&#x5E93;&#x4E5F;&#x7B26;&#x5408;&#x8BE5;&#x6280;&#x672F;&#x7684;&#x8981;&#x6C42;&#xFF09;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x540D;&#x8BCD;&#x3002;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;<strong>&#x6240;&#x6709;</strong>&#x5B9E;&#x7528;&#x7684;GC&#x6280;&#x672F;&#x90FD;&#x662F;&#x201C;&#x4FDD;&#x5B88;&#x7684;&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4EEC;&#x7528;&#xFF08;&#x6F5C;&#x5728;&#x7684;&#xFF09;&#x53EF;&#x8BBF;&#x95EE;&#x6027;&#x4EE3;&#x66FF;&#x771F;&#x5B9E;&#x4E2D;&#x7684;&#x662F;&#x5426;&#x8BBF;&#x95EE;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x201C;&#x4FDD;&#x5B88;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E13;&#x95E8;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x6307;&#x5728;<strong>&#x4E0D;&#x5408;&#x4F5C;</strong>&#xFF08;&#x4F46;&#x4E0D;&#x662F;<strong>&#x6545;&#x610F;&#x5BF9;&#x6297;</strong>&#xFF09;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x4E2D;&#x5DE5;&#x4F5C;&#x7684;GC&#x6280;&#x672F;&#x3002;</p>
<h2 id="116-&#x7CBE;&#x786E;&#x5783;&#x573E;&#x56DE;&#x6536;">11.6 &#x7CBE;&#x786E;&#x5783;&#x573E;&#x56DE;&#x6536;</h2>
<p>&#x5728;&#x4F20;&#x7EDF;&#x7684;GC&#x672F;&#x8BED;&#x4E2D;&#xFF0C;&#x201C;&#x4FDD;&#x5B88;&#x201D;&#x7684;&#x53CD;&#x4E49;&#x8BCD;&#x662F;<strong>&#x7CBE;&#x786E;</strong>&#xFF08;precise&#xFF09;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x8BEF;&#x79F0;&#xFF0C;&#x56E0;&#x4E3A;GC&#x4E0D;&#x53EF;&#x662F;&#x7CBE;&#x786E;&#x7684;&#xFF0C;&#x5373;&#x540C;&#x65F6;&#x505A;&#x5230;&#x53EF;&#x9760;&#x548C;&#x5B8C;&#x5907;&#x3002;&#x8FD9;&#x91CC;&#x7CBE;&#x786E;&#x66F4;&#x591A;&#x662F;&#x5BF9;&#x8BC6;&#x522B;&#x5F15;&#x7528;&#x80FD;&#x529B;&#x7684;&#x8868;&#x8FF0;&#xFF1A;&#x5F53;&#x9762;&#x5BF9;&#x503C;&#x65F6;&#xFF0C;&#x7CBE;&#x786E;GC&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x548C;&#x4E0D;&#x662F;&#x5F15;&#x7528;&#xFF0C;&#x4EE5;&#x53CA;&#x5F15;&#x7528;&#x7684;&#x4F4D;&#x7F6E;&#x5728;&#x54EA;&#x3002;&#x76F8;&#x5BF9;&#x4FDD;&#x5B88;GC&#xFF0C;&#x8FD9;&#x7701;&#x53BB;&#x4E86;&#x731C;&#x6D4B;&#x54EA;&#x4E9B;&#x503C;&#x4E0D;&#x662F;&#x5F15;&#x7528;&#xFF08;&#x5E76;&#x4EE5;&#x6B64;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x6D88;&#x9664;&#x6F5C;&#x5728;&#x5F15;&#x7528;&#xFF09;&#x8FD9;&#x9879;&#x7E41;&#x91CD;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x5F53;&#x4EE3;&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x7CBE;&#x786E;GC&#xFF0C;&#x800C;&#x7CBE;&#x786E;GC&#x9886;&#x57DF;&#x4E2D;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x7684;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#x3002;&#x6211;&#x63A8;&#x8350;<a href="ftp://ftp.cs.utexas.edu/pub/garbage/gcsurvey.ps" target="_blank">Paul Wilson &#x7684;&#x8C03;&#x67E5;&#x62A5;&#x544A;</a>&#xFF08;&#x867D;&#x7136;&#x8FD9;&#x4EFD;&#x6750;&#x6599;&#x6709;&#x70B9;&#x663E;&#x8001;&#xFF0C;&#x4F46;&#x5728;&#x8FD9;&#x4E2A;&#x5FEB;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x9886;&#x57DF;&#x4E2D;&#x4ECD;&#x662F;&#x5F88;&#x597D;&#x7684;&#x8D44;&#x6E90;&#xFF09;&#x548C;<a href="https://www.cs.kent.ac.uk/people/staff/rej/gc.html" target="_blank">Richard Jones</a> &#x7684;&#x4E66;&#x548C;&#x8D44;&#x6599;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E16;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x6982;&#x8FF0;&#xFF0C;&#x53EF;&#x4EE5;&#x8BFB;&#x4E00;&#x4E0B;<a href="http://www.cs.princeton.edu/~appel/papers/143.ps" target="_blank">&#x7B80;&#x5355;&#x7684;&#x4E16;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x548C;&#x5FEB;&#x901F;&#x5206;&#x914D;</a>&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap10.html" class="navigation navigation-prev " aria-label="Previous page: 10. 对象">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap12.html" class="navigation navigation-next " aria-label="Next page: 12. 表示层抉择">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"11. 内存管理","level":"1.12","depth":1,"next":{"title":"12. 表示层抉择","level":"1.13","depth":1,"path":"chap12.md","ref":"chap12.md","articles":[]},"previous":{"title":"10. 对象","level":"1.11","depth":1,"path":"chap10.md","ref":"chap10.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-76420995-1"},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc; MrMathematica","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap11.md","mtime":"2018-09-28T07:36:04.697Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-28T07:36:08.800Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

