
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1. 引言 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="lotuc">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                    1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                    2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                    3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                    4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                    5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                    6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                    7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                    8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                    9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >1. 引言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="1-&#x5F15;&#x8A00;">1 &#x5F15;&#x8A00;</h1>
<h2 id="11-&#x6211;&#x4EEC;&#x7684;&#x54F2;&#x5B66;">1.1 &#x6211;&#x4EEC;&#x7684;&#x54F2;&#x5B66;</h2>
<p>&#x8BF7;&#x53C2;&#x89C1;<a href="http://www.youtube.com/watch?v=3N__tvmZrzc" target="_blank">Youtube&#x89C6;&#x9891;</a>&#x3002;</p>
<h2 id="12-&#x672C;&#x4E66;&#x7684;&#x7ED3;&#x6784;">1.2 &#x672C;&#x4E66;&#x7684;&#x7ED3;&#x6784;</h2>
<p>&#x4E0E;&#x67D0;&#x4E9B;&#x6559;&#x79D1;&#x4E66;&#x4E0D;&#x540C;&#xFF0C;&#x672C;&#x4E66;&#x5E76;&#x6CA1;&#x6709;&#x91C7;&#x53D6;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x7684;&#x53D9;&#x8FF0;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x91C7;&#x7528;&#x4E86;&#x5BF9;&#x8BDD;&#x53D1;&#x5C55;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x56DE;&#x5934;&#x63CF;&#x8FF0;&#x8BB2;&#x8FC7;&#x7684;&#x8BDD;&#x9898;&#x3002;&#x5982;&#x540C;&#x73B0;&#x5B9E;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6765;&#x6784;&#x9020;&#x7A0B;&#x5E8F;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4E5F;&#x4F1A;&#x5305;&#x62EC;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x5199;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x5E2E;&#x52A9;&#x4F60;&#x5B66;&#x4E60;&#x7684;&#x6700;&#x597D;&#x65B9;&#x5F0F;&#x3002;&#x9519;&#x8BEF;&#x4F1A;&#x8FEB;&#x4F7F;&#x4F60;&#x6CA1;&#x6CD5;&#x88AB;&#x52A8;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x800C;&#x662F;&#x5FC5;&#x987B;&#x94BB;&#x7814;&#xFF1A;&#x4F60;&#x6C38;&#x8FDC;&#x4E5F;&#x6CA1;&#x6CD5;&#x786E;&#x4FE1;&#x8BFB;&#x5230;&#x7684;&#x6750;&#x6599;&#x5C31;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#x3002;&#x77ED;&#x671F;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F7F;&#x4EBA;&#x632B;&#x6298;&#xFF0C;&#x800C;&#x4E14;&#x8BFB;&#x8005;&#x4E5F;&#x6CA1;&#x6CD5;&#x5C06;&#x672C;&#x4E66;&#x5F53;&#x505A;&#x53C2;&#x8003;&#x4E66;&#x6765;&#x4F7F;&#x7528;&#xFF08;&#x4F60;&#x6CA1;&#x6CD5;&#x6253;&#x5F00;&#x4E66;&#xFF0C;&#x7FFB;&#x5230;&#x968F;&#x4FBF;&#x4E00;&#x9875;&#xFF0C;&#x5C31;&#x8BA4;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x632B;&#x8D25;&#x611F;&#x662F;&#x5B66;&#x4E60;&#x7684;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x6211;&#x4E0D;&#x89C9;&#x5F97;&#x6709;&#x597D;&#x65B9;&#x6CD5;&#x7ED5;&#x5F00;&#x5B83;&#x3002;</p>
<p>&#x5728;&#x4E66;&#x4E2D;&#x4F60;&#x4F1A;&#x9047;&#x5230;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x7EC3;&#x4E60;&#x3002;&#x8BF7;&#x505A;&#x9898;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x548C;&#x4F20;&#x7EDF;&#x6559;&#x6750;&#x4E2D;&#x7684;&#x7EC3;&#x4E60;&#x9898;&#x4E00;&#x6837;&#xFF0C;&#x9700;&#x8981;&#x4F60;&#x72EC;&#x7ACB;&#x5B8C;&#x6210;&#x3002;&#x5982;&#x679C;&#x4F60;&#x786E;&#x5B9E;&#x5728;&#x67D0;&#x4E2A;&#x8BFE;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x672C;&#x6559;&#x6750;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x8FD9;&#x5C31;&#x662F;&#x8BFE;&#x540E;&#x4F5C;&#x4E1A;&#x3002;&#x4F46;&#x662F;&#x672C;&#x4E66;&#x4E5F;&#x5305;&#x542B;&#x8FD9;&#x79CD;&#xFF1A;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x601D;&#x8003;&#x9898;&#xFF0C;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x5F53;&#x4F60;&#x770B;&#x5230;&#x601D;&#x8003;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;<strong>&#x8BF7;&#x505C;&#x4E0B;&#x6765;</strong>&#x3002;&#x9605;&#x8BFB;&#x3001;&#x601D;&#x8003;&#xFF0C;&#x5F62;&#x6210;&#x7B54;&#x6848;&#x4E4B;&#x540E;&#x518D;&#x7EE7;&#x7EED;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x601D;&#x8003;&#x9898;&#x672C;&#x8D28;&#x4E0A;&#x5C31;&#x662F;&#x7EC3;&#x4E60;&#x9898;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x533A;&#x522B;&#x662F;&#x540E;&#x6587;&#x4F1A;&#x7ED9;&#x51FA;&#x5176;&#x7B54;&#x6848;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x81EA;&#x884C;&#x5F97;&#x5230;&#x7B54;&#x6848;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x52A0;&#x601D;&#x8003;&#x7684;&#x7EE7;&#x7EED;&#x9605;&#x8BFB;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x4F1A;&#x8BFB;&#x5230;&#x7B54;&#x6848;&#xFF08;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x7B54;&#x6848;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x83B7;&#x5F97;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x7B54;&#x6848;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x65E2;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x4F60;&#x7684;&#x77E5;&#x8BC6;&#x6C34;&#x5E73;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x953B;&#x70BC;&#x4F60;&#x7684;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#x3002;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x601D;&#x8003;&#x9898;&#x662F;&#x9F13;&#x52B1;&#x4F60;&#x79EF;&#x6781;&#x5B66;&#x4E60;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<h2 id="13-&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;">1.3 &#x672C;&#x4E66;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;</h2>
<p>&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x7684;&#x4E3B;&#x8981;&#x8BED;&#x8A00;&#x662F;<a href="http://www.racket-lang.org/" target="_blank">Racket</a>&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8DDF;&#x5F88;&#x591A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#xFF0C;Racket&#x652F;&#x6301;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5FC5;&#x987B;&#x663E;&#x5F0F;&#x7684;&#x544A;&#x8BC9;Racket&#x4F60;&#x5728;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#x3002;&#x5728;Unix&#x7CFB;&#x7EDF;&#x7684;shell&#x811A;&#x672C;&#x4E2D;&#x4F60;&#x9700;&#x8981;&#x5728;&#x811A;&#x672C;&#x5F00;&#x5934;&#x6DFB;&#x52A0;&#x5982;&#x4E0B;&#x4E00;&#x884C;&#x6765;&#x6307;&#x660E;&#x8BED;&#x8A00;&#xFF1A;</p>
<pre><code class="lang-sh"><span class="hljs-meta">#!/bin/sh
</span></code></pre>
<p>&#x5728;&#x811A;&#x672C;&#x7684;&#x5934;&#x90E8;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x7C7B;&#x4F3C;&#x7684;&#x6307;&#x5B9A;&#xFF1A;</p>
<pre><code class="lang-HTML"><span class="hljs-meta">&lt;!DOCTYPE HTML PUBLIC &quot;-//W3C//DTD HTML 4.01//EN&quot; ...&gt;</span>
</code></pre>
<p>&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;Racket&#x9700;&#x8981;&#x4F60;&#x58F0;&#x660E;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x8A00;&#x3002;Racket&#x8BED;&#x8A00;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x548C;Racket&#x4E00;&#x6837;&#x7684;&#x62EC;&#x53F7;&#x8BED;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x4E49;&#xFF1B;&#x6216;&#x8BED;&#x4E49;&#x76F8;&#x540C;&#x8BED;&#x6CD5;&#x4E0D;&#x540C;&#xFF1B;&#x6216;&#x8005;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x6CD5;&#x548C;&#x8BED;&#x4E49;&#x3002;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;Racket &#x7A0B;&#x5E8F;&#x4EE5;<code>#lang &lt;&#x8BED;&#x8A00;&#x540D;&#x5B57;&gt;</code> &#x5F00;&#x5934;&#x3002;&#x9ED8;&#x8BA4;&#x7684;&#x8BED;&#x8A00;&#x4E3A;Racket&#xFF08;&#x540D;&#x5B57;&#x4E3A;racket&#xFF09;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x8FD9;&#x672C;&#x4E66;&#x4E2D;&#x6211;&#x4EEC;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x4F7F;&#x7528;&#x8BED;&#x8A00;&#xFF1A;</p>
<pre><code class="lang-text">plai-typed
</code></pre>
<blockquote>
<p>&#x5728;DrRacket&#x7248;&#x672C;5.3&#x4E2D;&#xFF0C;&#x6253;&#x5F00;&#x201C;&#x8BED;&#x8A00;/Language&#x201D;&#x83DC;&#x5355;&#xFF0C;&#x201C;&#x9009;&#x62E9;&#x8BED;&#x8A00;/Choose Language&#x201D;&#x83DC;&#x5355;&#x9879;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x201C;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x8BED;&#x8A00;/Use the language declared in the source&#x201D;&#x3002;</p>
</blockquote>
<p>&#x4F7F;&#x7528;&#x8BE5;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x9664;&#x975E;&#x7279;&#x522B;&#x6307;&#x660E;&#xFF0C;&#x8BF7;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x6DFB;&#x52A0;&#xFF08;&#x672C;&#x4E66;&#x540E;&#x9762;&#x4F8B;&#x5B50;&#x4EE3;&#x7801;&#x4E2D;&#x8BF7;&#x5047;&#x5B9A;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E86;&#x8BE5;&#x884C;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-racket">#lang plai-typed
</code></pre>
<p><em>Typed PLAI</em>&#x8BED;&#x8A00;&#x548C;&#x4F20;&#x7EDF;Racket&#x6700;&#x4E3B;&#x8981;&#x7684;&#x4E0D;&#x540C;&#x662F;&#x5B83;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x3002;&#x5B83;&#x8FD8;&#x7ED9;&#x4F60;&#x63D0;&#x4F9B;&#x4E86;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x7684;&#x4E1C;&#x897F;&#xFF08;construct&#xFF09;&#xFF1A;<code>define-type</code>&#x3001;<code>type-case</code>&#x548C;<code>test</code>&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x4E0B;&#x9762;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x5B9E;&#x4F8B;&#x3002;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;</p>
<blockquote>
<p>&#x5B83;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x6709;&#x7528;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x6BD4;&#x5982;&#x63A7;&#x5236;&#x6D4B;&#x8BD5;&#x8F93;&#x51FA;&#x7684;&#x547D;&#x4EE4;&#x7B49;&#x3002;&#x8BF7;&#x53C2;&#x8003;&#x8BE5;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x6863;&#x4E86;&#x89E3;&#x3002;&#x5728;DrRacket&#x7248;&#x672C;5.3&#x4E2D;&#xFF0C;&#x6253;&#x5F00;&#x201C;&#x5E2E;&#x52A9;/Help&#x201D;&#x83DC;&#x5355;&#xFF0C;&#x9009;&#x62E9;&#x201C;&#x5E2E;&#x52A9;&#x53F0;/Help Desk&#x201D;&#x83DC;&#x5355;&#x9879;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5E2E;&#x52A9;&#x53F0;&#x7684;&#x641C;&#x7D22;&#x680F;&#x4E2D;&#x8F93;&#x5165;&#x201C;plai-typed&#x201D;&#x3002;</p>
</blockquote>
<pre><code class="lang-Racket">(define-type MisspelledAnimal
  [caml (humps : number)]
  [yacc (height : number)])
</code></pre>
<p>&#x5B83;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x7C7B;&#x4F3C;&#x4E8E;&#x5728;Java&#x4E2D;&#xFF1A;&#x521B;&#x5EFA;&#x62BD;&#x8C61;&#x7C7B;<code>MisspelledAnimal</code>&#xFF0C;&#x5B83;&#x6709;&#x4E24;&#x4E2A;&#x5B9E;&#x4F53;&#x5B50;&#x7C7B;&#xFF1A;<code>caml</code>&#x548C;<code>yacc</code>&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x6784;&#x9020;&#x53C2;&#x6570;&#x5206;&#x522B;&#x4E3A;<code>humps</code>&#x548C;<code>height</code>&#x3002;</p>
<p>&#x8BE5;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x65B9;&#x5F0F;&#x521B;&#x5EFA;&#x5B9E;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-racket">(caml 2)
(yacc 1.9)
</code></pre>
<p>&#x5982;&#x540C;&#x5176;&#x540D;&#x5B57;&#x6697;&#x793A;&#x7684;&#xFF0C;<code>define-type</code>&#x4F1A;&#x521B;&#x5EFA;&#x7ED9;&#x5B9A;&#x540D;&#x5B57;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x628A;&#x8BE5;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x7ED1;&#x5B9A;&#x5230;&#x53D8;&#x91CF;&#x65F6;&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230;&#x5176;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-racket">(define ma1 : MisspelledAnimal (caml 2))
(define ma2 : MisspelledAnimal (yacc 1.9))
</code></pre>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x91CC;&#x4F60;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x7684;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;Typed PLAI&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x5305;&#x62EC;&#x8FD9;&#x91CC;&#xFF09;&#x90FD;&#x80FD;&#x591F;&#x63A8;&#x65AD;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x56E0;&#x6B64;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#xFF1A;</p>
<pre><code class="lang-racket">(define ma1 (caml 2))
(define ma2 (yacc 1.9))
</code></pre>
<p>&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x5BF9;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x663E;&#x5F0F;&#x7684;&#x58F0;&#x660E;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x5C0A;&#x5D07;&#x89C4;&#x5219;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5F53;&#x6211;&#x4EEC;&#x65E5;&#x540E;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x65F6;&#x6709;&#x52A9;&#x4E8E;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x7C7B;&#x578B;&#x7684;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x9012;&#x5F52;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x672C;&#x4E66;&#x4F1A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;2.4&#x8282;&#x4E2D;&#xFF09;&#x3002;</p>
<p>&#x8BE5;&#x8BED;&#x8A00;&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F53;&#xFF1A;</p>
<pre><code class="lang-racket">(define (good? [ma : MisspelledAnimal]) : boolean
  (type-case MisspelledAnimal ma
    [caml (humps) (&gt;= humps 2)]
    [yacc (height) (&gt; height 2.1)]))
</code></pre>
<p>&#x5728;&#x8868;&#x8FBE;&#x5F0F;<code>(&gt;= humps 2)</code>&#x4E2D;&#xFF0C;<code>humps</code>&#x88AB;&#x7ED1;&#x5B9A;&#x4E3A;<code>caml</code>&#x5B9E;&#x4F8B;&#x7684;&#x6784;&#x9020;&#x65F6;&#x6240;&#x7528;&#x5230;&#x7684;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x7F16;&#x5199;&#x6D4B;&#x8BD5;&#x6848;&#x4F8B;&#xFF0C;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E94;&#x8BE5;&#x5728;&#x5F00;&#x59CB;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x4E4B;&#x524D;&#x5199;&#x3002;&#x5F53;&#x7136;&#x5728;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x4E4B;&#x540E;&#x4E5F;&#x9700;&#x8981;&#x5199;&#xFF0C;&#x4EE5;&#x9632;&#x4EE3;&#x7801;&#x88AB;&#x610F;&#x5916;&#x4FEE;&#x6539;&#x3002;</p>
<pre><code class="lang-racket">(test (good? ma1) #t)
(test (good? ma2) #f)
</code></pre>
<p>&#x5F53;&#x4F60;&#x8FD0;&#x884C;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x8BED;&#x8A00;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x4E24;&#x4E2A;&#x6D4B;&#x8BD5;&#x90FD;&#x901A;&#x8FC7;&#x4E86;&#x3002;&#x8981;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x8BF7;&#x53C2;&#x9605;&#x6587;&#x6863;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x70B9;&#x53EF;&#x80FD;&#x6BD4;&#x8F83;&#x8D39;&#x89E3;&#x3002;&#x5728;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E2D;&#xFF0C;&#x5339;&#x914D;&#x6570;&#x636E;&#x5B57;&#x6BB5;&#x65F6;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x548C;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x65F6;&#x76F8;&#x540C;&#x7684;&#x540D;&#x5B57;&#xFF0C;<code>humps</code>&#xFF08;&#x548C; <code>height</code>&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x662F;&#x57FA;&#x4E8E;&#x4F4D;&#x7F6E;&#x7684;&#x800C;&#x4E0D;&#x662F;&#x540D;&#x5B57;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x540D;&#x5B57;&#xFF1A;</p>
<pre><code class="lang-racket">(define (good? [ma : MisspelledAnimal]) : boolean
  (type-case MisspelledAnimal ma
             [caml (h) (&gt;= h 2)]
             [yacc (h) (&gt; h 2.1)]))
</code></pre>
<p>&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;h&#x4EC5;&#x5728;&#x5176;&#x88AB;&#x5F15;&#x5165;&#x7684;&#x5339;&#x914D;&#x5206;&#x652F;&#x4E2D;&#x53EF;&#x89C1;&#xFF0C;&#x6240;&#x4EE5;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x91CD;&#x540D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x547D;&#x540D;&#x662F;&#x8BF7;&#x5C0A;&#x5D07;&#x4F20;&#x7EDF;&#x548C;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x957F;&#x800C;&#x63CF;&#x8FF0;&#x6027;&#x7684;&#x540D;&#x5B57;&#xFF1B;&#x800C;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x5B50;&#x53E5;&#x65F6;&#x8BF7;&#x4F7F;&#x7528;&#x7B80;&#x77ED;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x65E5;&#x540E;&#x8FD9;&#x4E9B;&#x540D;&#x5B57;&#x4F1A;&#x4E0D;&#x65AD;&#x88AB;&#x7528;&#x5230;&#x3002;</p>
<p>&#x6211;&#x89C9;&#x5F97;&#x5F88;&#x5C11;&#x6709;&#x9700;&#x8981;&#x4F60;&#x4F1A;&#x7528;&#x5230;&#x7C7B;&#x578B;&#x5224;&#x65AD;&#x51FD;&#x6570;&#xFF08;&#x5982;caml?&#xFF09;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x3002;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x65F6;&#x8FD8;&#x4F1A;&#x751F;&#x6210;&#x5B57;&#x6BB5;&#x63D0;&#x53D6;&#x51FD;&#x6570;&#xFF0C;&#x4F8B;&#x5982;<code>caml-humps</code>&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5B57;&#x6BB5;&#x63D0;&#x53D6;&#x51FD;&#x6570;&#x4F1A;&#x6BD4;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x66F4;&#x7B80;&#x5355;&#x3002;&#x5F53;&#x7136;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x8FD8;&#x662F;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x66F4;&#x597D;&#x7528;&#xFF0C;&#x5C31;&#x5982;&#x521A;&#x624D;&#x7684;<code>good?</code>&#x6240;&#x793A;&#x3002;&#x4E0D;&#x8FC7;&#x4E3A;&#x4E86;&#x5B8C;&#x6574;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-racket">(define (good? [ma : MisspelledAnimal]) : boolean
  (cond
    [(caml? ma) (&gt;= caml-humps ma) 2]
    [(yacc? ma) (&gt; (yacc-height ma) 2.1)]))
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x5982;&#x679C;&#x7ED9;&#x51FD;&#x6570;&#x4F20;&#x5165;&#x4E86;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#x6BD4;&#x5982;&#x4F20;&#x7ED9;caml&#x6784;&#x9020;&#x5668;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF1F;&#x6216;&#x8005;&#x4F20;&#x7ED9;&#x524D;&#x8FF0;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x7684;<code>good?</code>&#x51FD;&#x6570;&#x4E00;&#x4E2A;&#x6570;&#xFF1F;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 封面">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap2.html" class="navigation navigation-next " aria-label="Next page: 2. 本书有关语法解析的一切">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1. 引言","level":"1.2","depth":1,"next":{"title":"2. 本书有关语法解析的一切","level":"1.3","depth":1,"path":"chap2.md","ref":"chap2.md","articles":[]},"previous":{"title":"封面","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap1.md","mtime":"2017-11-27T05:14:35.618Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-11-27T11:51:52.513Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

