
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title> 7. 任意位置的函数 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lotuc; MrMathematica">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap8.html" />
    
    
    <link rel="prev" href="chap6.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                     1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                     2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                     3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                     4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                     5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                     6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                     7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                     8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                     9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="chap15.html">
            
                <a href="chap15.html">
            
                    
                    15. 静态地检查程序中的不变量：类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="chap16.html">
            
                <a href="chap16.html">
            
                    
                    16. 动态地检查程序中的不变量：契约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chap17.html">
            
                <a href="chap17.html">
            
                    
                    17. 其他调用语义
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." > 7. 任意位置的函数</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="7-&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#x7684;&#x51FD;&#x6570;">7 &#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#x7684;&#x51FD;&#x6570;</h1>
<p>Scheme&#x8BED;&#x8A00;&#x62A5;&#x544A;&#x4FEE;&#x8BA2;&#x7248;&#x62A5;&#x544A;&#x7684;&#x6982;&#x8FF0;&#xFF08;<a href="http://www.r6rs.org/final/html/r6rs/r6rs-Z-H-3.html#node_chap_Temp_3" target="_blank">r6rs &#x6982;&#x8FF0;</a>&#xFF0C;<a href="http://www.math.pku.edu.cn/teachers/qiuzy/progtech/scheme/r5rscn.pdf" target="_blank">r5rs&#xFF08;&#x4E2D;&#x6587;&#xFF09;</a>&#xFF09;&#x4E2D;&#x6307;&#x51FA;&#x5982;&#x4E0B;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF1A;</p>
<blockquote>
<p>&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x7279;&#x6027;&#x7684;&#x7B80;&#x5355;&#x5806;&#x780C;&#xFF0C;&#x800C;&#x5E94;&#x6D88;&#x9664;&#x8BED;&#x8A00;&#x7684;&#x5F31;&#x70B9;&#x548C;&#x7F3A;&#x9677;&#xFF0C;&#x4F7F;&#x5F97;&#x5269;&#x4E0B;&#x7684;&#x7279;&#x6027;&#x663E;&#x5F97;&#x5FC5;&#x8981;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x4E2A;&#x65E0;&#x987B;&#x4E89;&#x8FA9;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x3002;&#xFF08;&#x5F53;&#x7136;&#x6709;&#x4E9B;&#x7F3A;&#x9677;&#x662F;&#x8FEB;&#x4E0D;&#x5F97;&#x5DF2;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6B64;&#x539F;&#x5219;&#x8FEB;&#x4F7F;&#x6211;&#x4EEC;&#x53BB;&#x8BA4;&#x771F;&#x601D;&#x8003;&#x5F15;&#x5165;&#x8FD9;&#x4E9B;&#x7F3A;&#x9677;&#x7684;&#x5FC5;&#x8981;&#x6027;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x4F5C;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#x3002;&#xFF09;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x8BD5;&#x7740;&#x9075;&#x4ECE;&#x8BE5;&#x539F;&#x5219;&#x6765;&#x5F15;&#x5165;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5728;<a href="chap5.html">&#x7B2C;&#x4E94;&#x7AE0;</a>&#x4E2D;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x51FD;&#x6570;&#x65F6;&#x5E76;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x6307;&#x660E;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x6240;&#x5728;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x6211;&#x4EEC;&#x662F;&#x6309;&#x7167;&#x7406;&#x60F3;&#x5316;&#x7684;DrRacket&#x6A21;&#x578B;&#x5F15;&#x5165;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x5C06;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x4F7F;&#x7528;&#x5206;&#x79BB;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x4F7F;&#x7528;Scheme&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x6765;&#x91CD;&#x65B0;&#x601D;&#x8003;&#x4E00;&#x4E0B;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x7684;<strong>&#x5FC5;&#x8981;&#x6027;</strong>&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x4E0D;&#x53EF;&#x4EE5;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x8868;&#x8FBE;&#x5F0F;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5B9E;&#x73B0;&#x7684;&#x7B97;&#x672F;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x4E2A;&#x5C34;&#x5C2C;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x8868;&#x793A;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x503C;&#xFF1F;&#x201D;&#xFF0C;&#x5728;&#x73B0;&#x6709;&#x8BBE;&#x8BA1;&#x4E2D;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5BF9;&#x4E8E;&#x771F;&#x6B63;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5F53;&#x7136;&#x4E0D;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x6CA1;&#x5FC5;&#x8981;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x4F5C;&#x51FA;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#xFF1B;&#x8DF3;&#x51FA;&#x8FD9;&#x4E2A;&#x6846;&#x6846;&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x5F88;&#x597D;&#x7684;&#x56DE;&#x7B54;&#xFF1A;&#x201C;&#x51FD;&#x6570;&#x503C;&#x201D;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x8BD5;&#x8BD5;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#x3002;</p>
<p>&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x503C;&#xFF0C;&#x80FD;&#x7528;&#x5B83;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x663E;&#x7136;&#xFF0C;&#x51FD;&#x6570;&#x548C;&#x6570;&#x662F;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x5BF9;&#x51FD;&#x6570;&#x505A;&#x52A0;&#x6CD5;&#x8FD0;&#x7B97;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x4EF6;&#x5B83;&#x663E;&#x7136;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#xFF1A;&#x4F20;&#x5165;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x5B83;&#xFF01;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5141;&#x8BB8;&#x51FD;&#x6570;&#x503C;&#x51FA;&#x73B0;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x90A3;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x5176;&#x884C;&#x4E3A;&#xFF0C;&#x663E;&#x7136;&#x662F;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x5E94;&#x8BE5;&#x5141;&#x8BB8;&#x5982;&#x4E0B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4F5C;&#x4E3A;&#x5408;&#x6CD5;&#x7A0B;&#x5E8F;&#xFF08;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x4EE5;&#x65B9;&#x4FBF;&#x9605;&#x8BFB;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">(+ 2 ([define (f x) (* x 3)] 4))
</code></pre>
<p>&#x8BA1;&#x7B97;&#x5B83;&#x5F97;&#x5230;<code>(+ 2 (* 4 3))</code>&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<code>14</code>&#x3002;&#xFF08;&#x6CE8;&#x610F;&#x5230;&#x6CA1;&#xFF1F;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E86;&#x66FF;&#x6362;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x3002;&#xFF09;</p>
<h2 id="71-&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x503C;">7.1 &#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x503C;</h2>
<p>&#x9996;&#x5148;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4E2D;&#x6DFB;&#x52A0;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;expr-type&gt; ::=  ;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;

    (define-type ExprC
      [numC (n : number)]
      [idC (s : symbol)]
      &lt;app-type&gt;  ;&#x8C03;&#x7528;&#x7C7B;&#x578B;
      [plusC (l : ExprC) (r : ExprC)]
      [multC (l : ExprC) (r : ExprC)]
      &lt;fun-type&gt;)  ;&#x51FD;&#x6570;&#x7C7B;&#x578B;
</code></pre>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x628A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x590D;&#x5236;&#x5230;&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4EE5;&#x540E;&#x9700;&#x8981;&#x7684;&#x8BDD;&#x8FD8;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x590D;&#x7528;&#x5DF2;&#x6709;&#x7684;&#x6D4B;&#x8BD5;&#x6848;&#x4F8B;&#x3002;</p>
<pre><code class="lang-Racket">&lt;fun-type-take-1&gt; ::=  ;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;

    [fdC (name : symbol) (arg : symbol) (body : ExprC)]
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#x786E;&#x5B9A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x3002;&#x51FD;&#x6570;&#x7684;&#x4F4D;&#x7F6E;&#x5E94;&#x8BE5;&#x653E;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x4E4B;&#x524D;&#x90A3;&#x6837;&#x53EA;&#x80FD;&#x662F;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x51FD;&#x6570;&#x7684;&#x540D;&#x5B57;&#x3002;&#x7531;&#x4E8E;&#x73B0;&#x5728;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x548C;&#x5176;&#x5B83;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x6DF7;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x91CC;&#x8BA9;&#x51FD;&#x6570;&#x7684;&#x4F4D;&#x7F6E;&#x53EF;&#x4EE5;&#x653E;&#x4EFB;&#x610F;&#x8868;&#x8FBE;&#x5F0F;&#x5427;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x53EA;&#x5E0C;&#x671B;&#x5B83;&#x4E3A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;app-type&gt; ::=  ;&#x8C03;&#x7528;&#x7C7B;&#x578B;

    [appC (fun : ExprC) (arg : ExprC)]
</code></pre>
<blockquote>
<p>&#x53E6;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x628A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x548C;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x533A;&#x5206;&#x5F00;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x6587;&#x5B66;&#x4E60;&#x7C7B;&#x578B;&#x65F6;&#x4F1A;&#x8003;&#x8651;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x3002;</p>
</blockquote>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x540D;&#x5B57;&#x67E5;&#x627E;&#x51FD;&#x6570;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x518D;&#x4F20;&#x5165;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x94FE;&#x8868;&#x3002;&#x5F53;&#x7136;&#x4E4B;&#x540E;&#x6709;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x5C06;&#x9884;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x94FE;&#x8868;&#x52A0;&#x56DE;&#x6765;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EA;&#x63A2;&#x7A76;<strong>&#x5373;&#x65F6;&#x51FD;&#x6570;</strong>&#x2014;&#x2014;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5904;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x4FEE;&#x6539;&#x89E3;&#x91CA;&#x5668;<code>interp</code>&#x3002;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5B50;&#x53E5;&#x6765;&#x5904;&#x7406;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF0C;&#x8BE5;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x5927;&#x81F4;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-Racket">  [fdC (n a b) expr]
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x8BE5;&#x8BED;&#x53E5;&#x4F1A;&#x5BFC;&#x81F4;&#x4EC0;&#x4E48;&#xFF1F;</p>
</blockquote>
<p>&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x7206;&#x70B8;&#x6027;&#x7684;&#x6539;&#x53D8;&#xFF1A;&#x89E3;&#x91CA;&#x5668;&#x4E0D;&#x518D;&#x603B;&#x662F;&#x8FD4;&#x56DE;&#x6570;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;&#x51FA;&#x73B0;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x5728;&#x4E4B;&#x524D;&#x89E3;&#x91CA;&#x5668;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E5F;&#x4E0D;&#x65F6;&#x7684;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x5176;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x5E76;&#x6CA1;&#x4E13;&#x95E8;&#x7ED9;&#x5176;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x73B0;&#x5728;&#x662F;&#x65F6;&#x5019;&#x9700;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;answer-type-take-1&gt; ::=  ;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;

    (define-type Value
      [numV (n : number)]
      [funV (name : symbol) (arg : symbol) (body : ExprC)])
</code></pre>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x540E;&#x7F00;<code>V</code>&#x8868;&#x793A;&#x503C;&#xFF08;value&#xFF09;&#xFF0C;&#x5373;&#x6C42;&#x503C;&#x7684;&#x7ED3;&#x679C;&#x3002;<code>funV</code>&#x90E8;&#x5206;&#x6B63;&#x5BF9;&#x5E94;<code>fdC</code>&#xFF1B;<code>fdC</code>&#x4E3A;&#x8F93;&#x5165;&#xFF0C;<code>funV</code>&#x4E3A;&#x8F93;&#x51FA;&#x3002;&#x901A;&#x8FC7;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x8005;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x4FEE;&#x6B63;&#x5B83;&#x4EEC;&#x4E24;&#x4E2A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x8BE5;&#x8F93;&#x51FA;&#x7C7B;&#x578B;&#x91CD;&#x5199;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x4ECE;&#x7C7B;&#x578B;&#x5F00;&#x59CB;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;interp-hof&gt; ::=  ;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x9AD8;&#x9636;&#x51FD;&#x6570;

    (define (interp [expr : ExprC] [env : Env]) : Value
      (type-case ExprC expr
        &lt;interp-body-hof&gt;))  ;&#x89E3;&#x91CA;&#x5668;&#x4E3B;&#x4F53;&#xFF0C;&#x9AD8;&#x9636;&#x51FD;&#x6570;
</code></pre>
<p>&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x540C;&#x6837;&#x4FEE;&#x6539;<code>Binding</code>&#x548C;&#x8F85;&#x52A9;&#x51FD;&#x6570;<code>lookup</code>&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x4FEE;&#x6539;<code>Binding</code>&#x548C;&#x8F85;&#x52A9;&#x51FD;&#x6570;<code>lookup</code>&#x3002;</p>
</blockquote>
<pre><code class="lang-Racket">&lt;interp-body-hof&gt; ::=  ;&#x89E3;&#x91CA;&#x5668;&#x4E3B;&#x4F53;&#xFF0C;&#x9AD8;&#x9636;&#x51FD;&#x6570;

    [numC (n) (numV n)]
    [idC (n) (lookup n env)]
    &lt;app-case&gt;  ;&#x8C03;&#x7528;&#x5B50;&#x53E5;
    &lt;plus/mult-case&gt;  ;&#x52A0;&#x6CD5;/&#x4E58;&#x6CD5;&#x5B50;&#x53E5;
    &lt;fun-case&gt;  ;&#x51FD;&#x6570;&#x5B50;&#x53E5;
</code></pre>
<p>&#x5BF9;&#x4E8E;&#x6570;&#xFF0C;&#x663E;&#x7136;&#x8981;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x5668;&#x5BF9;&#x5176;&#x5305;&#x88F9;&#x4E00;&#x4E0B;&#x3002;&#x5BF9;&#x4E8E;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x4E00;&#x5207;&#x4E0D;&#x53D8;&#x3002;&#x5BF9;&#x4E8E;&#x52A0;&#x6CD5;&#xFF0F;&#x4E58;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x4FEE;&#x6539;&#x4F7F;&#x5176;&#x80FD;&#x6B63;&#x786E;&#x7684;&#x8FD4;&#x56DE;<code>Value</code>&#x7C7B;&#x578B;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;plus/mult-case&gt; ::=  ;&#x52A0;&#x6CD5;/&#x4E58;&#x6CD5;&#x5B50;&#x53E5;

    [plusC (l r) (num+ (interp l env) (interp r env))]
    [multC (l r) (num* (interp l env) (interp r env))]
</code></pre>
<p>&#x8F85;&#x52A9;&#x51FD;&#x6570;<code>num+</code>&#x548C;<code>num*</code>&#x6211;&#x4EEC;&#x4EE5;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4E3A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (num+ [l : Value] [r : Value]) : Value
  (cond
    [(and (numV? l) (numV? r))
     (numV (+ (numV-n l) (numV-n r)))]
    [else
     (error &apos;num+ &quot;one argument was not a number&quot;)]))  ;&#x6709;&#x53C2;&#x6570;&#x4E0D;&#x662F;&#x6570;
</code></pre>
<p>&#x8BF7;&#x7559;&#x610F;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x505A;&#x52A0;&#x6CD5;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x68C0;&#x67E5;&#x4E86;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x786E;&#x5B9A;&#x5176;&#x4E3A;&#x6570;&#x3002;&#x540E;&#x9762;&#x4F1A;&#x6709;&#x7AE0;&#x8282;&#x7EE7;&#x7EED;&#x8C08;&#x8BBA;&#x7C7B;&#x578B;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x8981;&#x5B8C;&#x6210;&#x3002;&#x5148;&#x662F;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x3002;&#x4E0A;&#x9762;&#x8BF4;&#x8FC7;&#xFF0C;&#x51FD;&#x6570;&#x503C;&#x5C31;&#x662F;&#x5176;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;fun-case-take-1&gt; ::=  ;&#x51FD;&#x6570;&#x5B50;&#x53E5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;

    [fdC (n a b) (funV n a b)]
</code></pre>
<p>&#x6700;&#x540E;&#x5269;&#x4E0B;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4ECE;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x94FE;&#x8868;&#x4E2D;&#x67E5;&#x8BE2;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x8FD8;&#x662F;&#x5C3D;&#x91CF;&#x4FDD;&#x7559;&#x4E4B;&#x524D;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x7ED3;&#x6784;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;app-case-take-1&gt; ::=  ;&#x8C03;&#x7528;&#x5B50;&#x53E5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;

    [appC (f a) (let ([fd f])
                  (interp (fdC-body fd)
                          (extend-env (bind (fdC-arg fd)
                                            (interp a env))
                                      mt-env)))]
</code></pre>
<p>&#x5728;&#x539F;&#x6765;&#x662F;lookup&#x67E5;&#x627E;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x4E86;<code>f</code>&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x3002;&#x6CE8;&#x610F;&#x7531;&#x4E8E;&#x5728;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x51FA;&#x73B0;&#x7684;&#x4F4D;&#x7F6E;&#x4E8B;&#x5B9E;&#x4E0A;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4EFB;&#x4F55;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x597D;&#x7F16;&#x7801;&#x68C0;&#x6D4B;&#x5B83;&#x662F;&#x5426;&#x5B9E;&#x662F;&#x51FD;&#x6570;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x201C;&#x662F;&#x201D;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x662F;&#x8981;&#x68C0;&#x67E5;&#x5B83;&#x662F;&#x4F5C;&#x4E3A;&#x8BED;&#x6CD5;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x5373;<code>fdC</code>&#x6784;&#x9020;&#xFF09;&#xFF0C;&#x8FD8;&#x662F;&#x53EA;&#x662F;&#x68C0;&#x67E5;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x662F;&#x51FD;&#x6570;&#x503C;&#xFF08;&#x5373;<code>funV</code>&#xFF09;&#x5462;&#xFF1F;&#x8FD9;&#x4E24;&#x79CD;&#x505A;&#x6CD5;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x4F60;&#x80FD;&#x4E0D;&#x80FD;&#x627E;&#x51FA;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x5C55;&#x793A;&#x5176;&#x533A;&#x522B;&#xFF1F;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x9762;&#x4E34;&#x9009;&#x62E9;&#xFF1A;</p>
<ol>
<li>&#x68C0;&#x67E5;&#x5B83;&#x5728;&#x8BED;&#x6CD5;&#x4E0A;&#x662F;&#x5426;&#x662F;<code>fdC</code>&#x6784;&#x9020;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</li>
<li>&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6C42;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x68C0;&#x67E5;&#x5176;&#x8FD4;&#x56DE;<strong>&#x503C;</strong>&#x662F;&#x5426;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</li>
</ol>
<p>&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x540E;&#x4E00;&#x79CD;&#x505A;&#x6CD5;&#xFF0C;&#x5B83;&#x4F1A;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x66F4;&#x4E3A;&#x7075;&#x6D3B;&#x3002;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x4E0D;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x9009;&#x62E9;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x66F4;&#x591A;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x3002;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5C31;&#x5728;<a href="#75-&#x533F;&#x540D;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;">&#x533F;&#x540D;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;</a>&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x4FEE;&#x6539;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x5F97;&#x5230;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;app-case-take-2&gt; ::=  ;&#x8C03;&#x7528;&#x5B50;&#x53E5;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x5C1D;&#x8BD5;

    [appC (f a) (let ([fd (interp f env)])
                  (interp (funV-body fd)
                          (extend-env (bind (funV-arg fd)
                                            (interp a env))
                                      mt-env)))]
</code></pre>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;</p>
</blockquote>
<p>&#x4FE1;&#x4E0D;&#x4FE1;&#x7531;&#x4F60;&#xFF0C;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#xFF0C;&#x4E00;&#x4E2A;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x53C8;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x7167;&#x65E7;&#x7ED9;&#x51FA;&#x4E24;&#x4E2A;&#x6D4B;&#x8BD5;&#x6848;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (interp (plusC (numC 10) (appC (fdC &apos;const5 &apos;_ (numC 5)) (numC 10)))
              mt-env)
      (numV 15))

(test/exn (interp (appC (fdC &apos;f1 &apos;x (appC (fdC &apos;f2 &apos;y (plusC (idC &apos;x) (idC &apos;y)))
                                          (numC 4)))
                        (numC 3))
                  mt-env)
          &quot;name not found&quot;)
</code></pre>
<h2 id="72-&#x4EC0;&#x4E48;&#xFF1F;&#x5D4C;&#x5957;&#xFF1F;">7.2 &#x4EC0;&#x4E48;&#xFF1F;&#x5D4C;&#x5957;&#xFF1F;</h2>
<p>&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x4F53;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x800C;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x4E8E;&#x662F;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#xB7;&#xB7;&#xB7;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;nested-fdC&gt; ::=  ;&#x5D4C;&#x5957;&#x7684;fdC

    (fdC &apos;f1 &apos;x
         (fdC &apos;f2 &apos;x
              (plusC (idC &apos;x) (idC &apos;x))))
</code></pre>
<p>&#x5BF9;&#x5B83;&#x6C42;&#x503C;&#x8FD8;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x6709;&#x610F;&#x601D;&#xFF1A;</p>
<pre><code class="lang-Racket">(funV &apos;f1 &apos;x (fdC &apos;f2 &apos;x (plusC (idC &apos;x) (idC &apos;x))))
</code></pre>
<p>&#x5F53;&#x65F6;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8C03;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;applied-nested-fdC&gt; ::=  ;&#x8C03;&#x7528;&#x5D4C;&#x5957;&#x7684;fdC

    (appC &lt;nested-fdC&gt;
          (numC 4))
</code></pre>
<p>&#x518D;&#x6C42;&#x503C;&#xFF0C;&#x7ED3;&#x679C;&#x5C31;&#x6709;&#x70B9;&#x610F;&#x601D;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-Racket">(funV &apos;f2 &apos;x (plusC (idC &apos;x) (idC &apos;x)))
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x5C31;&#x597D;&#x50CF;&#x5916;&#x90E8;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x5BF9;&#x5185;&#x90E8;&#x7684;&#x51FD;&#x6570;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#x4E00;&#x6837;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5462;&#xFF1F;&#x5916;&#x90E8;&#x51FD;&#x6570;&#x5F15;&#x5165;&#x7684;&#x53C2;&#x6570;&#x88AB;&#x5185;&#x90E8;&#x51FD;&#x6570;&#x5F15;&#x5165;&#x7684;<strong>&#x540C;&#x540D;</strong>&#x53C2;&#x6570;&#x8986;&#x76D6;&#xFF08;mask&#xFF09;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x9075;&#x4ECE;&#x9759;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#xFF08;&#x5FC5;&#x987B;&#x7684;&#xFF09;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x5185;&#x90E8;&#x7684;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x8986;&#x76D6;&#x5916;&#x90E8;&#x53C2;&#x6570;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(appC (fdC &apos;f1 &apos;x
           (fdC &apos;f2 &apos;y
                (plusC (idC &apos;x) (idC &apos;y))))
      (numC 4))
</code></pre>
<p>&#x6C42;&#x503C;&#x5F97;&#x5230;&#xFF1A;</p>
<pre><code class="lang-Racket">(funV &apos;f2 &apos;y (plusC (idC &apos;x) (idC &apos;y)))
</code></pre>
<p>&#x55EF;&#xFF0C;&#x6709;&#x70B9;&#x610F;&#x601D;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x60F3;&#x60F3;&#x6709;&#x610F;&#x601D;&#x7684;&#x70B9;&#x5728;&#x54EA;&#xFF1F;</p>
</blockquote>
<p>&#x4E3A;&#x4E86;&#x770B;&#x770B;&#x5230;&#x5E95;&#x6709;&#x610F;&#x601D;&#x5728;&#x54EA;&#xFF0C;&#x6211;&#x4EEC;&#x8C03;&#x7528;&#x4E00;&#x4E0B;&#x8BE5;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(appC (appC (fdC &apos;f1 &apos;x
                 (fdC &apos;f2 &apos;y
                      (plusC (idC &apos;x) (idC &apos;y))))
            (numC 4))
      (numC 5))
</code></pre>
<p>&#x5B83;&#x5C06;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x6CA1;&#x627E;&#x5230;&#x6807;&#x8BC6;&#x7B26;<code>x</code>&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#xFF01;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x51FD;&#x6570;<code>f1</code>&#x7684;&#x8C03;&#x7528;&#x88AB;&#x7ED1;&#x5B9A;&#x5417;&#xFF1F;&#x6E05;&#x6670;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5207;&#x6362;&#x4E3A;&#xFF08;&#x5047;&#x5B9A;&#x7684;&#xFF09;Racket&#x8BED;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-Racket">((define (f1 x)
   ((define (f2 y)
      (+ x y))
    4))
 5)
</code></pre>
<p>&#x5728;&#x8C03;&#x7528;&#x5916;&#x5C42;&#x51FD;&#x6570;&#x65F6;&#xFF0C;x&#x5E94;&#x8BE5;&#x88AB;&#x66FF;&#x6362;&#x6210;5&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">((define (f2 y)
   (+ 5 y))
 4)
</code></pre>
<p>&#x7EE7;&#x7EED;&#x8C03;&#x7528;&#x3001;&#x66FF;&#x6362;&#x5F97;&#x5230;<code>(+ 5 4)</code>&#x4E5F;&#x5C31;&#x662F;<code>9</code>&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x80AF;&#x5B9A;&#x662F;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x505A;&#x9519;&#x4E86;&#x4EE5;&#x81F3;&#x4E8E;&#x6CA1;&#x6709;&#x6355;&#x6349;&#x5230;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x7684;&#x53C2;&#x6570;&#x66FF;&#x6362;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x51FD;&#x6570;&#x503C;&#x9700;&#x8981;<strong>&#x8BB0;&#x4F4F;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x66FF;&#x6362;&#x64CD;&#x4F5C;</strong>&#x3002;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x79CD;&#x66FF;&#x6362;&#xFF0C;&#x56E0;&#x6B64;&#x51FD;&#x6570;&#x503C;&#x9700;&#x8981;&#x5305;&#x542B;&#x8BB0;&#x5F55;&#x4E86;&#x8BE5;&#x66FF;&#x6362;&#x7684;&#x73AF;&#x5883;&#x3002;&#x8FD9;&#x6837;&#x5F97;&#x5230;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x79F0;&#x4E3A;<strong>&#x95ED;&#x5305;&#xFF08;closure&#xFF09;</strong>&#xFF1A;</p>
<blockquote>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x66FF;&#x6362;&#x6A21;&#x578B;&#xFF0C;<code>x</code>&#x4F1A;&#x88AB;&#x66FF;&#x6362;&#x6210;<code>(numV 4)</code>&#xFF0C;&#x51FD;&#x6570;&#x4F53;&#x5C31;&#x53D8;&#x6210;<code>(plusC (numV 5) (idC &#x2019;y))</code>&#xFF0C;&#x800C;&#x5B83;&#x5E76;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x5047;&#x8BBE;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x5408;&#x6CD5;&#x8BED;&#x6CD5;&#x3002;&#x5176;&#x5B9E;&#x5C0A;&#x5D07;&#x8BE5;&#x5047;&#x8BBE;&#x4E5F;&#x80FD;&#x5B66;&#x4E60;&#x5F88;&#x591A;&#x9AD8;&#x7EA7;&#x7F16;&#x7A0B;&#x6982;&#x5FF5;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x6253;&#x7B97;&#x5F80;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x7EE7;&#x7EED;&#x8BA8;&#x8BBA;&#x3002;</p>
</blockquote>
<p>&#x6CE8;&#x610F;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;&#x89E3;&#x91CA;&#x5668;&#x7684;<code>appC</code>&#x5B50;&#x53E5;&#x4E2D;&#x7528;&#x5230;&#x4E86;<code>funV-arg</code>&#x548C;<code>funV-body</code>&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x7528;&#x5230;<code>funV-name</code>&#x3002;&#x60F3;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x540D;&#x5B57;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#xFF1F;&#x56E0;&#x4E3A;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x540D;&#x5B57;&#x627E;&#x5230;&#x51FD;&#x6570;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x89E3;&#x91CA;&#x5668;&#x627E;&#x5230;&#x51FD;&#x6570;&#xFF0C;&#x51FD;&#x6570;&#x540D;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x63CF;&#x8FF0;&#x6027;&#x7684;&#x5B58;&#x5728;&#x7F62;&#x4E86;&#x3002;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x51FD;&#x6570;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x540D;&#x5B57;&#xFF0C;&#x5C31;&#x8DDF;&#x5E38;&#x6570;&#x4E00;&#x6837;&#xFF1A;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;3&#x7684;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x7ED9;&#x5B83;&#x547D;&#x540D;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5462;&#xFF1F;&#x51FD;&#x6570;<strong>&#x672C;&#x8D28;&#x4E0A;</strong>&#x662F;&#x533F;&#x540D;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5E94;&#x8BE5;&#x5C06;&#x5176;&#x5B9A;&#x4E49;&#x548C;&#x547D;&#x540D;&#x5206;&#x5F00;&#x6765;&#x3002;</p>
<p>&#xFF08;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x8BBA;&#x70B9;&#x53EA;&#x5728;&#x51FD;&#x6570;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x5E76;&#x4F7F;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x624D;&#x6210;&#x7ACB;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x5B9A;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x540D;&#x5B57;&#x7684;&#x4E48;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x6B63;&#x662F;&#xFF0C;&#x540E;&#x9762;&#x7684;<a href="#75-&#x533F;&#x540D;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;">&#x533F;&#x540D;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;</a>&#x4E2D;&#x4F1A;&#x8BF4;&#x5230;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#xFF09;</p>
<h2 id="73-&#x5B9E;&#x73B0;&#x95ED;&#x5305;">7.3 &#x5B9E;&#x73B0;&#x95ED;&#x5305;</h2>
<p>&#x9996;&#x5148;&#x5C06;&#x51FD;&#x6570;&#x503C;&#x7C7B;&#x578B;&#x6539;&#x4E3A;&#x95ED;&#x5305;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x51FD;&#x6570;&#x672C;&#x4F53;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;answer-type&gt; ::=  ;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;

    (define-type Value
      [numV (n : number)]
      [closV (arg : symbol) (body : ExprC) (env : Env)])
</code></pre>
<p>&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x53BB;&#x9664;&#x6CA1;&#x7528;&#x7684;&#x51FD;&#x6570;&#x540D;&#x90E8;&#x5206;&#x3002;&#x7531;&#x4E8E;&#x5386;&#x53F2;&#x539F;&#x56E0;&#xFF0C;&#x8BE5;&#x6784;&#x9020;&#x88AB;&#x79F0;&#x4E3A;<strong>lambda</strong>&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;fun-type&gt; ::=  ;&#x51FD;&#x6570;&#x7C7B;&#x578B;

    [lamC (arg : symbol) (body : ExprC)]
</code></pre>
<p>&#x73B0;&#x5728;&#xFF0C;&#x5F53;&#x89E3;&#x91CA;&#x5668;&#x9047;&#x5230;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x4E0B;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x8FDB;&#x884C;&#x8FC7;&#x7684;&#x6240;&#x6709;&#x66FF;&#x6362;&#xFF1A;&#x3010;&#x6CE8;&#x91CA;&#x3011;</p>
<pre><code class="lang-Racket">&lt;fun-case&gt; ::=  ;&#x51FD;&#x6570;&#x5B50;&#x53E5;

    [lamC (a b) (closV a b env)]
</code></pre>
<blockquote>
<p>&#x201C;Save the environment! Create a closure today!&#x201D; &#x2014;Cormac Flanagan</p>
</blockquote>
<p>&#x7136;&#x540E;&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7A7A;&#x767D;&#x73AF;&#x5883;&#x3002;</p>
<pre><code class="lang-Racket">&lt;app-case&gt; ::=  ;&#x8C03;&#x7528;&#x5B50;&#x53E5;

    [appC (f a) (let ([f-value (interp f env)])
                  (interp (closV-body f-value)
                          (extend-env (bind (closV-arg f-value)
                                            (interp a env))
                                      (closV-env f-value))))]
</code></pre>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x8FD8;&#x53EF;&#x4EE5;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5904;&#x7684;&#x73AF;&#x5883;&#xFF1A;</p>
<pre><code class="lang-Racket">[appC (f a) (local ([define f-value (interp f env)])
              (interp (closV-body f-value)
                      (extend-env (bind (closV-arg f-value)
                                        (interp a env))
                                  env)))]
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x7684;&#x73AF;&#x5883;&#xFF08;&#x5373;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5904;&#x7684;&#x73AF;&#x5883;&#xFF09;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x4EC0;&#x4E48;&#xFF1F;</p>
</blockquote>
<p>&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x770B;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4F55;&#x6211;&#x4EEC;&#x5728;&#x89E3;&#x91CA;&#x51FD;&#x6570;&#x4F53;&#x65F6;&#x4F7F;&#x7528;&#x7A7A;&#x767D;&#x73AF;&#x5883;&#x4E86;&#x3002;&#x5982;&#x679C;&#x51FD;&#x6570;&#x662F;&#x5B9A;&#x4E49;&#x5728;&#x7A0B;&#x5E8F;&#x9876;&#x5C42;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x6CA1;&#x6709;&#x201C;&#x5305;&#x542B;&#x201D;&#x4EFB;&#x4F55;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x7684;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x662F;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;</p>
<h2 id="74-&#x518D;&#x6B21;&#x804A;&#x804A;&#x66FF;&#x6362;">7.4 &#x518D;&#x6B21;&#x804A;&#x804A;&#x66FF;&#x6362;</h2>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#xFF0C;&#x901A;&#x8FC7;&#x66FF;&#x6362;&#x8FD9;&#x79CD;&#x975E;&#x5E38;&#x7B26;&#x5408;&#x76F4;&#x89C9;&#x7684;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x7406;&#x89E3;&#x5982;&#x4F55;&#x5B9E;&#x73B0;<code>lambda</code>&#x51FD;&#x6570;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x66FF;&#x6362;&#x672C;&#x8EAB;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C0F;&#x5FC3;&#x4E00;&#x4E9B;&#x9677;&#x9631;&#xFF01;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF08;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;Racket&#x8BED;&#x6CD5;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">(lambda (f)
  (lambda (x)
    (f 10)))
</code></pre>
<p>&#x5047;&#x8BBE;<code>f</code>&#x88AB;&#x66FF;&#x6362;&#x4E3A;lambda&#x8868;&#x8FBE;&#x5F0F;<code>(lambda (y) (+ x y))</code>&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x81EA;&#x7531;&#x53D8;&#x91CF;<code>x</code>&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5B83;&#x88AB;&#x6C42;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x4F1A;&#x5F97;&#x5230;&#x672A;&#x7ED1;&#x5B9A;&#x53D8;&#x91CF;&#x9519;&#x8BEF;&#x3002;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x66FF;&#x6362;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F97;&#x5230;&#xFF1A;</p>
<pre><code class="lang-Racket">(lambda (x)
  ((lambda (y) (+ x y)) 10))
</code></pre>
<p>&#x81EA;&#x7531;&#x53D8;&#x91CF;&#x6D88;&#x5931;&#x4E86;&#xFF01;</p>
<p>&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x66FF;&#x6362;&#x64CD;&#x4F5C;&#x5B9E;&#x73B0;&#x7684;&#x592A;&#x8FC7;&#x7B80;&#x5355;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x7684;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B9E;&#x73B0;<strong>&#x975E;&#x6355;&#x83B7;&#x578B;&#x7684;&#x66FF;&#x6362;&#xFF08;capture-free substitution&#xFF09;</strong>&#x3002;&#x5927;&#x81F4;&#x6765;&#x8BF4;&#x5B83;&#x662F;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#xFF1A;&#x6211;&#x4EEC;<strong>&#x603B;&#x662F;</strong>&#x5C06;&#x7ED1;&#x5B9A;&#x6807;&#x8BC6;&#x7B26;<strong>&#x91CD;&#x547D;&#x540D;</strong>&#x4E3A;&#x4ECE;&#x672A;&#x7528;&#x8FC7;&#x7684;&#xFF08;<strong>&#x65B0;&#x9C9C;&#x7684;&#xFF0C;fresh</strong>&#xFF09;&#x540D;&#x5B57;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x6BCF;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x52A0;&#x4E2A;&#x6570;&#x5B57;&#x540E;&#x7F00;&#x6765;&#x4FDD;&#x8BC1;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x91CD;&#x540D;&#xFF1A;</p>
<pre><code class="lang-Racket">(lambda (f1)
  (lambda (x1)
    (f1 10)))
</code></pre>
<p>&#xFF08;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x628A;f&#x7684;&#x7ED1;&#x5B9A;&#x548C;&#x88AB;&#x7ED1;&#x5B9A;&#x51FA;&#x73B0;&#x90FD;&#x66FF;&#x6362;&#x6210;&#x4E86;f1&#x3002;&#xFF09;&#x63A5;&#x4E0B;&#x6765;&#x5BF9;&#x88AB;&#x66FF;&#x6362;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x8FDB;&#x884C;&#x540C;&#x6837;&#x7684;&#x91CD;&#x547D;&#x540D;&#xFF1A;</p>
<pre><code class="lang-Racket">(lambda (y1) (+ x y1))
</code></pre>
<p>&#x4E8E;&#x662F;&#x66FF;&#x6362;<code>f1</code>&#x5F97;&#x5230;&#xFF1A;&#x3010;&#x6CE8;&#x91CA;&#x3011;</p>
<pre><code class="lang-Racket">(lambda (x1)
  ((lambda (y1) (+ x y1)) 10))
</code></pre>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5BF9;&#x4F5C;&#x4E3A;<code>x</code>&#x8FDB;&#x884C;&#x91CD;&#x547D;&#x540D;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x5F15;&#x7528;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8981;&#x4E48;&#x6211;&#x4EEC;&#x4E5F;&#x5BF9;&#x5168;&#x5C40;&#x5B9A;&#x4E49;&#x8FDB;&#x884C;&#x540C;&#x6837;&#x7684;&#x91CD;&#x547D;&#x540D;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x91CD;&#x547D;&#x540D;&#x539F;&#x5219;&#x3002;&#x5BF9;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x6CA1;&#x5565;&#x533A;&#x522B;&#x3002;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#xFF0C;<code>x</code>&#x4ECD;&#x7136;&#x662F;&#x81EA;&#x7531;&#x53D8;&#x91CF;&#xFF01;&#x8FD9;&#x624D;&#x662F;&#x6B63;&#x786E;&#x7684;&#x66FF;&#x6362;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x7B49;&#x4E00;&#x7B49;&#x3002;&#x600E;&#x4E48;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x89E3;&#x91CA;&#x5668;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x540E;&#x679C;&#x662F;&#x5565;&#xFF1F;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x8BD5;&#x4E00;&#x4E0B;&#x3002;</p>
</blockquote>
<p>&#x8BD5;&#x4E86;&#x4F60;&#x5C31;&#x77E5;&#x9053;&#xFF0C;&#x4E00;&#x5207;&#x6B63;&#x786E;&#xFF1A;&#x7A0B;&#x5E8F;&#x62A5;&#x544A;&#x6709;&#x672A;&#x7ED1;&#x5B9A;&#x53D8;&#x91CF;&#x3002;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x5B9E;&#x9645;&#x4E0A;&#x5B9E;&#x73B0;&#x4E86;&#x975E;&#x6355;&#x83B7;&#x578B;&#x66FF;&#x6362;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x662F;&#x600E;&#x4E48;&#x907F;&#x514D;&#x66FF;&#x6362;&#x4E2D;&#x7684;&#x6355;&#x83B7;&#x95EE;&#x9898;&#x7684;&#xFF1F;</p>
</blockquote>
<h2 id="75-&#x533F;&#x540D;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;">7.5 &#x533F;&#x540D;&#x4E4B;&#x4E0A;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x8FC7;&#x5934;&#x8003;&#x8651;&#x51FD;&#x6570;&#x547D;&#x540D;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x5B9E;&#x9645;&#x7F16;&#x7A0B;&#x6765;&#x8BF4;&#x5B83;&#x6709;&#x660E;&#x663E;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x6CE8;&#x610F;&#x6211;&#x4EEC;&#x73B0;&#x5728;<strong>&#x5DF2;&#x7ECF;</strong>&#x6709;&#x547D;&#x540D;&#x4E1C;&#x897F;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;&#x901A;&#x8FC7;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x53C2;&#x6570;&#x7684;&#x503C;&#x548C;&#x53C2;&#x6570;&#x540D;&#x6784;&#x6210;&#x4E86;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x5173;&#x7CFB;&#x3002;&#x5728;&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7528;&#x5F62;&#x53C2;&#x5C31;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x5B9E;&#x53C2;&#x4E86;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x51FD;&#x6570;&#x6765;&#x7ED9;&#x4E00;&#x7CFB;&#x5217;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x547D;&#x540D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;Racket&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (double x) (+ x x))
(double 10)
</code></pre>
<p>&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p>
<pre><code class="lang-Racket">(define double (lambda (x) (+ x x)))
(double 10)
</code></pre>
<p>&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x76F4;&#x63A5;&#x5185;&#x8054;&#xFF08;inline&#xFF09;double&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x4E0D;&#x8FC7;&#x4E3A;&#x4E86;&#x4FDD;&#x7559;&#x547D;&#x540D;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p>
<pre><code class="lang-Racket">((lambda (double)
   (double 10))
 (lambda (x) (+ x x)))
</code></pre>
<p>&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x6682;&#x4E14;&#x79F0;&#x4E3A;&#x201C;left-left-lambda&#x201D;&#x2014;&#x2014;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x79CD;&#x5C40;&#x90E8;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x3002;&#x5B83;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;Racket&#x4E3A;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E13;&#x95E8;&#x7684;&#x8BED;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([double (lambda (x) (+ x x))])
  (double 10))
</code></pre>
<p><code>let</code>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x6210;&#x4E0A;&#x9762;&#x90A3;&#x79CD;&#x8BED;&#x6CD5;&#x7CD6;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E2A;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x70B9;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (double x) (+ x x))
(define (quadruple x) (double (double x)))
(quadruple 10)
</code></pre>
<p>&#x8FD9;&#x53EF;&#x4EE5;&#x88AB;&#x6539;&#x5199;&#x6210;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([double (lambda (x) (+ x x))])
  (let ([quadruple (lambda (x) (double (double x)))])
    (quadruple 10)))
</code></pre>
<p>&#x4E00;&#x5207;&#x6B63;&#x5E38;&#x3002;&#x6539;&#x53D8;&#x4E00;&#x4E0B;&#x987A;&#x5E8F;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([quadruple (lambda (x) (double (double x)))])
  (let ([double (lambda (x) (+ x x))])
    (quadruple 10)))
</code></pre>
<p>&#x8FD9;&#x662F;&#x7531;&#x4E8E;<code>quadruple</code>&#x4E2D;&#x201C;&#x770B;&#x4E0D;&#x89C1;&#x201D;<code>double</code>&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x770B;&#x5230;&#x5168;&#x5C40;&#x7ED1;&#x5B9A;&#x548C;&#x5C40;&#x90E8;&#x7ED1;&#x5B9A;&#x7684;&#x533A;&#x522B;&#xFF1A;&#x4F4D;&#x4E8E;&#x9876;&#x5C42;&#x7684;&#x5168;&#x5C40;&#x7ED1;&#x5B9A;&#x6709;&#x201C;&#x65E0;&#x9650;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x201D;&#x3002;&#x8FD9;&#x662F;&#x5176;&#x5F3A;&#x5927;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x662F;&#x95EE;&#x9898;&#x7684;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD8;&#x6709;&#x4E2A;&#x66F4;&#x4E3A;&#x5FAE;&#x5999;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x548C;&#x9012;&#x5F52;&#x6709;&#x5173;&#x3002;&#x8003;&#x8651;&#x5982;&#x4E0B;&#x7684;&#x7B80;&#x5355;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (loop-forever x) (loop-forever x))
(loop-forever 10)
</code></pre>
<p>&#x8F6C;&#x6362;&#x6210;<code>let</code>&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([loop-forever (lambda (x) (loop-forever x))])
  (loop-forever 10))
</code></pre>
<p>&#x770B;&#x4E0A;&#x53BB;&#x597D;&#x50CF;&#x6CA1;&#x6BDB;&#x75C5;&#xFF0C;&#x662F;&#x5427;&#xFF1F;&#x91CD;&#x5199;&#x6210;<code>lambda</code>&#x7684;&#x5F62;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-Racket">((lambda (loop-forever)
   (loop-forever 10))
 (lambda (x) (loop-forever x)))
</code></pre>
<p>&#x663E;&#x7136;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x884C;&#x4E2D;&#x7684;<code>loop-forever</code>&#x6CA1;&#x6709;&#x88AB;&#x7ED1;&#x5B9A;&#xFF01;</p>
<p>&#x5BF9;&#x4E8E;&#x5168;&#x5C40;&#x7ED1;&#x5B9A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x3002;&#x8BE5;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;&#x8FD9;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x9012;&#x5F52;&#x7684;&#x542B;&#x4E49;&#x3002;&#x5F88;&#x5FEB;&#x6211;&#x4EEC;&#x5C06;&#x63ED;&#x5F00;&#x8FD9;&#x5C42;&#x795E;&#x79D8;&#x7684;&#x9762;&#x7EB1;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap6.html" class="navigation navigation-prev " aria-label="Previous page:  6. 从替换模型到环境模型">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap8.html" class="navigation navigation-next " aria-label="Next page:  8. 可变结构体和变量">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":" 7. 任意位置的函数","level":"1.8","depth":1,"next":{"title":" 8. 可变结构体和变量","level":"1.9","depth":1,"path":"chap8.md","ref":"chap8.md","articles":[]},"previous":{"title":" 6. 从替换模型到环境模型","level":"1.7","depth":1,"path":"chap6.md","ref":"chap6.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-76420995-1"},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc; MrMathematica","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap7.md","mtime":"2018-09-28T07:36:04.702Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-28T07:36:08.800Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

