
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>6. 从替换模型到环境模型 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="lotuc">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap7.html" />
    
    
    <link rel="prev" href="chap5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                    1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                    2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                    3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                    4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                    5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                    6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                    7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                    8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                    9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >6. 从替换模型到环境模型</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="6-&#x4ECE;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x5230;&#x73AF;&#x5883;&#x6A21;&#x578B;">6 &#x4ECE;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x5230;&#x73AF;&#x5883;&#x6A21;&#x578B;</h1>
<p>&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5BF9;&#x5176;&#x4E0D;&#x592A;&#x6EE1;&#x610F;&#x3002;&#x5904;&#x7406;&#x6807;&#x8BC6;&#x7B26;&#x65F6;&#xFF0C;&#x76F4;&#x89C2;&#x4E0A;&#x5E94;&#x8BE5;&#x662F;&#x201C;&#x627E;&#x5230;&#x5B83;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x201D;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x6CA1;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x8FD8;&#x5728;&#x9047;&#x5230;&#x6807;&#x8BC6;&#x7B26;&#x65F6;&#x76F4;&#x63A5;&#x629B;&#x51FA;&#x9519;&#x8BEF;&#xFF01;&#x8FD9;&#x4E48;&#x505A;&#x4E5F;&#x6CA1;&#x9519;&#xFF0C;&#x4F46;&#x611F;&#x89C9;&#x602A;&#x602A;&#x7684;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x7F16;&#x5199;&#x89E3;&#x91CA;&#x5668;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x5176;<strong>&#x7406;&#x89E3;&#x5E76;&#x89E3;&#x91CA;</strong>&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x8BE5;&#x89E3;&#x91CA;&#x5668;&#x73B0;&#x5728;&#x770B;&#x6765;&#x5E76;&#x6CA1;&#x6709;&#x8FBE;&#x6210;&#x6211;&#x4EEC;&#x7684;&#x610F;&#x613F;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x904D;&#x5386;&#x6E90;&#x7A0B;&#x5E8F;&#x7684;&#x6B21;&#x6570;&#x3002;&#x7406;&#x60F3;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x53EA;&#x8BBF;&#x95EE;&#x7A0B;&#x5E8F;&#x4E2D;&#x88AB;&#x5B9E;&#x9645;&#x6C42;&#x503C;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4E14;&#xFF0C;&#x4EC5;&#x5F53;&#x5FC5;&#x8981;&#x65F6;&#x624D;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x5FC5;&#x987B;&#x904D;&#x5386;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x90E8;&#x5206;&#x2014;&#x2014;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6761;&#x4EF6;&#x5206;&#x652F;&#x4E2D;&#x4E0D;&#x6267;&#x884C;&#x7684;&#x5206;&#x652F;&#x2014;&#x2014;&#x800C;&#x4E14;&#x8FD8;&#x9700;&#x8981;&#x904D;&#x5386;&#x7A0B;&#x5E8F;&#x4E24;&#x904D;&#xFF0C;&#x4E00;&#x904D;&#x66FF;&#x6362;&#xFF0C;&#x4E00;&#x904D;&#x89E3;&#x91CA;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x66FF;&#x6362;&#x6A21;&#x578B;&#x4F1A;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x6027;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x66FF;&#x6362;&#x6A21;&#x578B;&#x8FD8;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x7684;&#x7ED3;&#x6784;&#x53D7;&#x9650;&#x4E8E;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x5B58;&#x50A8;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x9700;&#x8981;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5BF9;&#x5176;&#x89E3;&#x91CA;&#x3002;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x2014;&#x2014;&#x6BD4;&#x5982;&#x8BF4;&#x7F16;&#x8BD1;&#x5668;&#x2014;&#x2014;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5B58;&#x8D2E;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x91C7;&#x53D6;&#x66F4;&#x4E00;&#x822C;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x663E;&#x7136;&#x66F4;&#x4E3A;&#x5408;&#x7406;&#x3002;</p>
<blockquote>
<p>&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x80FD;&#x4E5F;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x67D0;&#x4E9B;&#x6E90;&#x4EE3;&#x7801;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x62A5;&#x544A;&#x8FD0;&#x884C;&#x65F6;&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x8FDB;&#x884C;&#x5373;&#x65F6;&#x7F16;&#x8BD1;&#xFF08;JIT&#xFF09;&#x3002;</p>
</blockquote>
<h2 id="61-&#x4ECB;&#x7ECD;&#x73AF;&#x5883;&#x6A21;&#x578B;">6.1 &#x4ECB;&#x7ECD;&#x73AF;&#x5883;&#x6A21;&#x578B;</h2>
<p>&#x76F4;&#x89C9;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x89E3;&#x51B3;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x89E3;&#x91CA;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x5B57;&#x5178;&#x91CC;&#x9762;&#x201C;&#x5BFB;&#x627E;&#x201D;&#x6807;&#x8BC6;&#x7B26;&#xFF1B;&#x89E3;&#x51B3;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;<strong>&#x5EF6;&#x8FDF;</strong>&#x66FF;&#x6362;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E24;&#x70B9;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x8FD8;&#x80FD;&#x89E3;&#x51B3;&#x7B2C;&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5B57;&#x5178;&#x91CC;&#x9762;&#x8BB0;&#x5F55;&#x7684;&#x662F;<strong>&#x5C06;&#x8981;&#x8FDB;&#x884C;&#x7684;&#x66FF;&#x6362;</strong>&#xFF0C;&#x800C;&#x5E76;&#x4E0D;&#x5BF9;&#x539F;&#x59CB;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x56E0;&#x4E3A;&#x8BB0;&#x5F55;&#x4E0B;&#x4E86;&#x5C06;&#x8981;&#x8FDB;&#x884C;&#x7684;&#x66FF;&#x6362;&#xFF0C;&#x800C;&#x5E76;&#x975E;&#x76F4;&#x63A5;&#x66FF;&#x6362;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5EF6;&#x8FDF;&#x8FDB;&#x884C;&#x66FF;&#x6362;&#x6B65;&#x9AA4;&#x3002;&#x8BB0;&#x5F55;&#x66FF;&#x6362;&#x5185;&#x5BB9;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x73AF;&#x5883;</strong>&#xFF08;environment&#xFF09;&#x3002;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x907F;&#x514D;&#x4E86;&#x6E90;&#x4EE3;&#x7801;&#x7EA7;&#x522B;&#x7684;&#x91CD;&#x5199;&#xFF0C;&#x5E76;&#x4E14;&#x548C;&#x5E95;&#x5C42;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8868;&#x793A;&#x6CD5;&#x5F88;&#x597D;&#x5730;&#x5BF9;&#x5E94;&#x3002;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x7ED3;&#x5408;&#x5173;&#x7CFB;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7ED1;&#x5B9A;</strong>&#xFF08;binding&#xFF09;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x8981;&#x4FEE;&#x6539;&#x7684;&#x662F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;<strong>&#x5B9E;&#x73B0;&#x7B56;&#x7565;</strong>&#xFF0C;&#x800C;&#x4E0D;&#x662F;<strong>&#x4FEE;&#x6539;&#x8BED;&#x8A00;&#x672C;&#x8EAB;</strong>&#x3002;&#x56E0;&#x6B64;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x8FD8;&#x6709;&#x89E3;&#x91CA;&#x5668;&#x6267;&#x884C;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x4E0D;&#x5E94;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x4E4B;&#x524D;&#x90A3;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x5F53;&#x4F5C;&#x6211;&#x4EEC;&#x8FD9;&#x6B21;&#x8981;&#x5199;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x201C;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#x201D;&#xFF0C;&#x4E24;&#x8005;&#x7684;&#x7ED3;&#x679C;&#x5E94;&#x8BE5;&#x4E00;&#x81F4;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x8BA9;&#x5B83;&#x751F;&#x6210;&#x5F88;&#x591A;&#x6D4B;&#x7ED9;&#x4E24;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x6765;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x8FD4;&#x56DE;&#x7684;&#x7ED3;&#x679C;&#x90FD;&#x76F8;&#x540C;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;<strong>&#x8BC1;&#x660E;</strong>&#x4E24;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#x884C;&#x4E3A;&#x4E00;&#x81F4;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5B83;&#x662F;&#x5F88;&#x597D;&#x7684;&#x9AD8;&#x9636;&#x8BFE;&#x9898;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x4E00;&#x81F4;&#x201D;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x7279;&#x522B;&#x5730;&#xFF0C;&#x5F53;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x62A5;&#x9519;&#x65F6;&#x5462;&#xFF1F;</p>
</blockquote>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x5B9A;&#x4E49;&#x73AF;&#x5883;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x73AF;&#x5883;&#x662F;&#x5C06;&#x540D;&#x5B57;&#x4E0E;&#x4EC0;&#x4E48;&#x7684;&#x7ED1;&#x5B9A;&#x7684;&#x5217;&#x8868;&#xFF1F;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x65F6;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF0C;&#x73AF;&#x5883;&#x4E2D;&#x5C06;&#x540D;&#x5B57;&#x6620;&#x5C04;&#x6210;&#x4E86;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x95EE;&#x66F4;&#x597D;&#x66F4;&#x57FA;&#x672C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5F97;&#x51FA;&#x8FD9;&#x4E2A;&#x5F88;&#x81EA;&#x7136;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#xFF1F;</p>
</blockquote>
<p>&#x8BB0;&#x4F4F;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5F15;&#x5165;&#x73AF;&#x5883;&#x662F;&#x4E3A;&#x4E86;&#x63A8;&#x8FDF;&#x66FF;&#x6362;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7B54;&#x6848;&#x5728;&#x66FF;&#x6362;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x5728;<a href="chap5.html#&#x7B49;&#x7B49;&#xFF0C;&#x8FD8;&#x6CA1;&#x5B8C;&#x5462;&#xFF01;">&#x4E0A;&#x4E00;&#x7AE0;&#x6700;&#x540E;&#x4E00;&#x8282;</a>&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x76F4;&#x63A5;&#x5C06;&#x540D;&#x5B57;&#x66FF;&#x6362;&#x4E3A;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x5373;&#x5BF9;&#x5E94;&#x4E8E;&#x51FD;&#x6570;&#x7684;&#x53CA;&#x65E9;&#x6C42;&#x503C;&#x7B56;&#x7565;&#x3002;&#x56E0;&#x6B64;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x73AF;&#x5883;&#x4E2D;&#x5E94;&#x8BE5;&#x5C06;&#x540D;&#x5B57;&#x6620;&#x5C04;&#x4E3A;&#x6C42;&#x503C;&#x7ED3;&#x679C;&#x3002;</p>
<pre><code class="lang-racket">(define-type Binding
  [bind (name : symbol) (val : number)])

(define-type-alias Env (listof Binding))
(define mt-env empty)
(define extend-env cons)
</code></pre>
<h2 id="62-&#x73AF;&#x5883;&#x6A21;&#x578B;&#x89E3;&#x91CA;&#x5668;">6.2 &#x73AF;&#x5883;&#x6A21;&#x578B;&#x89E3;&#x91CA;&#x5668;</h2>
<p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x89E3;&#x91CA;&#x5668;&#x4E86;&#x3002;&#x9664;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5206;&#x652F;&#x60C5;&#x51B5;&#x5916;&#xFF0C;&#x5176;&#x5B83;&#x4EE3;&#x7801;&#x5747;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8003;&#x8651;&#xFF1A;</p>
<pre><code class="lang-racket">&lt;*&gt; ::=

    (define (interp [expr : ExprC] [env : Env] [fds : (listof FunDefC)]) : number
      (type-case ExprC expr
        [numC (n) n]
        &lt;idC-case&gt;  ;&#x6807;&#x8BC6;&#x7B26;&#x5B50;&#x53E5;
        &lt;appC-case&gt;  ;&#x8C03;&#x7528;&#x5B50;&#x53E5;
        &lt;plusC/multC-case&gt;))  ;&#x52A0;&#x6CD5;&#x4E58;&#x6CD5;&#x5B50;&#x53E5;
</code></pre>
<p>&#x7B97;&#x672F;&#x64CD;&#x4F5C;&#x662F;&#x6700;&#x597D;&#x5199;&#x7684;&#x3002;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#xFF0C;&#x9012;&#x5F52;&#x4E2D;&#x672A;&#x6D89;&#x53CA;&#x5230;&#x65B0;&#x7684;&#x66FF;&#x6362;&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x9700;&#x7279;&#x522B;&#x5904;&#x7406;&#xFF0C;&#x73AF;&#x5883;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF1A;</p>
<pre><code class="lang-racket">&lt;plusC/multC-case&gt; ::=  ;&#x52A0;&#x6CD5;&#x4E58;&#x6CD5;&#x5B50;&#x53E5;

    [plusC (l r) (+ (interp l env fds) (interp r env fds))]
    [multC (l r) (* (interp l env fds) (interp r env fds))]
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x73B0;&#x5728;&#x9047;&#x5230;&#x6807;&#x8BC6;&#x7B26;&#x4E0D;&#x5E94;&#x8BE5;&#x76F4;&#x63A5;&#x62A5;&#x9519;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5728;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x4E2D;&#x67E5;&#x627E;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#xFF1A;</p>
<pre><code class="lang-racket">&lt;idC-case&gt; ::=  ;&#x6807;&#x8BC6;&#x7B26;&#x5B50;&#x53E5;

    [idC (n) (lookup n env)]
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x5B9E;&#x73B0;lookup&#x51FD;&#x6570;&#x3002;</p>
</blockquote>
<p>&#x6700;&#x540E;&#xFF0C;&#x5904;&#x7406;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x6CE8;&#x610F;&#x5230;&#x5728;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#xFF0C;&#x552F;&#x4E00;&#x521B;&#x5EFA;&#x65B0;&#x66FF;&#x6362;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x4F1A;&#x662F;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x7ED1;&#x5B9A;&#x7684;&#x5730;&#x65B9;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8DDF;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x63D0;&#x53D6;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-racket">&lt;appC-case&gt; ::=  ;&#x8C03;&#x7528;&#x5B50;&#x53E5;

    [appC (f a) (local ([define fd (get-fundef f fds)])
                  &lt;appC-interp&gt;)]  ;&#x8C03;&#x7528;&#x7684;&#x89E3;&#x91CA;
</code></pre>
<p>&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5148;&#x8FDB;&#x884C;&#x66FF;&#x6362;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x91CA;&#x3002;&#x73B0;&#x5728;&#x5254;&#x9664;&#x6389;&#x66FF;&#x6362;&#x8FD9;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BB0;&#x5F55;&#x4E0B;&#x8981;&#x66FF;&#x6362;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7136;&#x540E;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x89E3;&#x91CA;&#x6B65;&#x9AA4;&#xFF1A;</p>
<pre><code class="lang-racket">&lt;appC-interp&gt; ::=  ;&#x8C03;&#x7528;&#x7684;&#x89E3;&#x91CA;

    (interp (fdC-body fd)
            &lt;appC-interp-bind-in-env&gt;  ;&#x8C03;&#x7528;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x73AF;&#x5883;&#x7ED1;&#x5B9A;
            fds)
</code></pre>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x90E8;&#x5206;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF1B;&#x6211;&#x4EEC;&#x7167;&#x65E7;&#x89E3;&#x91CA;&#x51FD;&#x6570;&#x7684;&#x4E3B;&#x4F53;&#x90E8;&#x5206;&#xFF1B;&#x4E0D;&#x8FC7;&#x89E3;&#x91CA;&#x8FC7;&#x7A0B;&#x8981;&#x88AB;&#x653E;&#x5728;&#x65B0;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8BE5;&#x73AF;&#x5883;&#x5305;&#x542B;&#x4E86;&#x51FD;&#x6570;&#x5F62;&#x5F0F;&#x53C2;&#x6570;&#x7684;&#x7ED1;&#x5B9A;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x5B9A;&#x4E49;&#x7ED1;&#x5B9A;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<pre><code class="lang-racket">&lt;appC-interp-bind-in-env-take-1&gt; ::=  ;&#x8C03;&#x7528;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x73AF;&#x5883;&#x7ED1;&#x5B9A;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;

    (extend-env (bind (fdC-arg fd)
                      (interp a env fds))
                env)
</code></pre>
<p>&#x8981;&#x7ED1;&#x5B9A;&#x7684;&#x662F;&#x5F62;&#x53C2;&#xFF08;&#x4E4B;&#x524D;&#x88AB;&#x66FF;&#x6362;&#x7684;&#x4E5F;&#x662F;&#x5F62;&#x53C2;&#xFF09;&#x3002;&#x7ED1;&#x5B9A;&#x7684;&#x503C;&#x662F;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x89E3;&#x91CA;&#x6C42;&#x503C;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x91C7;&#x53D6;&#x53CA;&#x65E9;&#x6C42;&#x503C;&#x8BED;&#x4E49;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x6269;&#x5145;&#x6211;&#x4EEC;&#x7684;&#x73AF;&#x5883;&#x3002;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x786E;&#x4FDD;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<p>&#x6700;&#x540E;&#x52A0;&#x4E0A;lookup&#x51FD;&#x6570;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4E00;&#x5207;&#x5C31;&#x90FD;&#x5B8C;&#x6210;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-racket">(define (lookup [for : symbol] [env : Env]) : number
  (cond
    [(empty? env) (error &apos;lookup &quot;name not found&quot;)]  ;&#x627E;&#x4E0D;&#x5230;&#x540D;&#x79F0;
    [else (cond
            [(symbol=? for (bind-name (first env)))
             (bind-val (first env))]
            [else (lookup for (rest env))])]))
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x67E5;&#x627E;&#x81EA;&#x7531;&#x6807;&#x8BC6;&#x7B26;&#x65F6;&#x4F9D;&#x65E7;&#x4F1A;&#x62A5;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E00;&#x6B65;&#x4ECE;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x88AB;&#x5265;&#x79BB;&#x51FA;&#x6765;&#x2014;&#x2014;&#x89E3;&#x91CA;&#x5668;&#x5E76;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#x67D0;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x662F;&#x5426;&#x88AB;&#x7ED1;&#x5B9A;&#x2014;&#x2014;&#x7531;lookup&#x51FD;&#x6570;&#x6839;&#x636E;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x6765;&#x51B3;&#x5B9A;&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x89E3;&#x91CA;&#x5668;&#x540E;&#xFF0C;&#x5F53;&#x7136;&#x9700;&#x8981;&#x6D4B;&#x8BD5;&#x4EE5;&#x786E;&#x4FDD;&#x5176;&#x6B63;&#x786E;&#x6027;&#x3002;&#x4E0B;&#x9762;&#x8FD9;&#x51E0;&#x4E2A;&#x6D4B;&#x8BD5;&#x90FD;&#x901A;&#x8FC7;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-racket">(test (interp (plusC (numC 10) (appC &apos;const5 (numC 10)))
              mt-env
              (list (fdC &apos;const5 &apos;_ (numC 5))))
      15)

(test (interp (plusC (numC 10) (appC &apos;double (plusC (numC 1) (numC 2))))
              mt-env
              (list (fdC &apos;double &apos;x (plusC (idC &apos;x) (idC &apos;x)))))
      16)

(test (interp (plusC (numC 10) (appC &apos;quadruple (plusC (numC 1) (numC 2))))
              mt-env
              (list (fdC &apos;quadruple &apos;x (appC &apos;double (appC &apos;double (idC &apos;x))))
                    (fdC &apos;double &apos;x (plusC (idC &apos;x) (idC &apos;x)))))
      22)
</code></pre>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x4E86;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x627E;&#x627E;&#x770B;bug&#x5728;&#x54EA;&#x3002;</p>
</blockquote>
<h2 id="63-&#x6B63;&#x786E;&#x7684;&#x8FDB;&#x884C;&#x5EF6;&#x8FDF;&#x6C42;&#x503C;">6.3 &#x6B63;&#x786E;&#x7684;&#x8FDB;&#x884C;&#x5EF6;&#x8FDF;&#x6C42;&#x503C;</h2>
<p>&#x8003;&#x8651;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<pre><code class="lang-racket">(interp (appC &apos;f1 (numC 3))
                  mt-env
                  (list (fdC &apos;f1 &apos;x (appC &apos;f2 (numC 4)))
                        (fdC &apos;f2 &apos;y (plusC (idC &apos;x) (idC &apos;y)))))
</code></pre>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#xFF0C;&#x5B83;&#x7684;&#x7ED3;&#x679C;&#x4E3A;7&#x3002;&#x8FD9;&#x6B63;&#x786E;&#x5417;&#xFF1F;</p>
<p>&#x5C06;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x8F6C;&#x6362;&#x6210;Racket&#x4EE3;&#x7801;&#xFF0C;&#x4E24;&#x4E2A;&#x5B9A;&#x4E49;&#x52A0;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-racket">(define (f1 x) (f2 4))
(define (f2 y) (+ x y))

(f1 3)
</code></pre>
<p>&#x8003;&#x8651;&#x5176;&#x6C42;&#x503C;&#x8FC7;&#x7A0B;&#x3002;<code>(f1 3)</code>&#x5C06;&#x51FD;&#x6570;<code>f1</code>&#x7684;&#x51FD;&#x6570;&#x4F53;&#x4E2D;<code>x</code>&#x66FF;&#x6362;&#x4E3A;3&#xFF0C;&#x4E8E;&#x662F;&#x4E0B;&#x4E00;&#x6B65;&#x5904;&#x7406;<code>(f2 4)</code>&#x3002;&#x4F46;&#x662F;&#x6CE8;&#x610F;&#x5230;&#x5728;&#x51FD;&#x6570;<code>f2</code>&#x4E2D;&#xFF0C; &#x6807;&#x8BC6;&#x7B26;<code>x</code><strong>&#x672A;&#x7ED1;&#x5B9A;</strong>&#xFF01;&#x5F53;&#x7136;Racket&#x62A5;&#x9519;&#x4E86;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x89E3;&#x91CA;&#x5668;&#x4E5F;&#x4F1A;&#x62A5;&#x9519;&#xFF01;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x4F1A;&#x62A5;&#x9519;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x6211;&#x4EEC;<strong>&#x4EC5;</strong>&#x4F1A;&#x5728;<code>f1</code>&#x7684;&#x51FD;&#x6570;&#x4F53;&#x5185;&#x5C06;&#x6807;&#x8BC6;&#x7B26;<code>x</code>&#x66FF;&#x6362;&#x4E3A;&#x6570;3&#x7684;&#x8868;&#x793A;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#xFF08;&#x8FD9;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x4E8B;&#xFF1A;<code>x</code>&#x662F;<code>f1</code>&#x7684;&#x53C2;&#x6570;&#xFF1B;&#x5982;&#x679C;&#x5176;&#x5B83;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x540D;&#x78B0;&#x5DE7;&#x4E5F;&#x53EB;<code>x</code>&#xFF0C;&#x90A3;&#x4E5F;&#x662F;&#x4E2A;<strong>&#x4E0D;&#x540C;&#x7684;</strong><code>x</code>&#xFF09;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;<code>f2</code>&#x65F6;&#xFF0C;&#x5176;&#x4E2D;<code>x</code>&#x6CA1;&#x6709;&#x88AB;&#x66FF;&#x6362;&#x8FC7;&#xFF0C;&#x56E0;&#x6B64;&#x62A5;&#x9519;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x6570;3&#x7684;&#x8868;&#x793A;&#x201D;&#x542C;&#x4E0A;&#x53BB;&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x7F57;&#x55E6;&#xFF1F;&#x4EE5;&#x540E;&#x8FD9;&#x7C7B;&#x60C5;&#x51B5;&#x6211;&#x5C31;&#x76F4;&#x63A5;&#x8BF4;&#x201C;3&#x201D;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x8BF7;&#x4F60;&#x7406;&#x89E3;&#x8FD9;&#x5176;&#x4E2D;&#x7684;&#x533A;&#x522B;&#x3002;</p>
</blockquote>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x7684;&#x95EE;&#x9898;&#x5230;&#x5E95;&#x51FA;&#x5728;&#x54EA;&#x5462;&#xFF1F;&#x8BF7;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x5FAE;&#x5999;&#x3002;&#x53EA;&#x6709;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x4F1A;&#x6539;&#x53D8;&#x73AF;&#x5883;&#xFF0C;&#x6211;&#x4EEC;&#x91CD;&#x70B9;&#x89C2;&#x5BDF;&#x8FD9;&#x4E00;&#x6B65;&#x3002;&#x5C06;&#x5F62;&#x53C2;&#x66FF;&#x6362;&#x6210;&#x5B9E;&#x53C2;&#x662F;&#x901A;&#x8FC7;<strong>&#x6269;&#x5C55;&#x5F53;&#x524D;&#x73AF;&#x5883;</strong>&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5728;&#x5904;&#x7406;<code>f2</code>&#x51FD;&#x6570;&#x4F53;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x8981;&#x6C42;&#x5B83;&#x5BF9;<code>f2</code>&#x7684;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x66FF;&#x6362;&#xFF0C;&#x8FD8;&#x8981;&#x5B83;&#x5BF9;&#x5F53;&#x524D;&#x6240;&#x6709;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8C03;&#x7528;<code>f2</code>&#x7684;<code>f1</code>&#x7684;&#x53C2;&#x6570;&#xFF09;&#x90FD;&#x8FDB;&#x884C;&#x66FF;&#x6362;&#x3002;&#x5982;&#x679C;&#x8FD8;&#x6709;&#x4E0A;&#x4E00;&#x5C42;&#xFF0C;&#x5B83;&#x7684;&#x53C2;&#x6570;&#x4E5F;&#x4F1A;&#x88AB;&#x66FF;&#x6362;&#x3002;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x6DFB;&#x52A0;&#x5230;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x7ED1;&#x5B9A;&#x53EA;&#x589E;&#x4E0D;&#x51CF;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x524D;&#x9762;&#x8BF4;&#x8FC7;&#xFF0C;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x662F;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x7684;&#x66FF;&#x4EE3;&#x5B9E;&#x73B0;&#x7B56;&#x7565;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x610F;&#x4E49;&#x4E0D;&#x5E94;&#x8BE5;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x2014;&#x2014;&#x552F;&#x4E00;&#x5408;&#x7406;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4FEE;&#x6539;&#x89E3;&#x91CA;&#x5668;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x8BA9;&#x89E3;&#x91CA;&#x8FC7;&#x7A0B;&#x643A;&#x5E26;&#x6240;&#x6709;&#x5386;&#x53F2;&#x7ED1;&#x5B9A;&#xFF0C;&#x800C;&#x5E94;&#x4E3A;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x5E72;&#x51C0;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x7C7B;&#x4F3C;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x5F88;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code class="lang-racket">&lt;appC-interp-bind-in-env&gt; ::=  ;&#x8C03;&#x7528;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x73AF;&#x5883;&#x7ED1;&#x5B9A;

    (extend-env (bind (fdC-arg fd)
                      (interp a env fds))
                mt-env)
</code></pre>
<p>&#x5230;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x91CD;&#x73B0;&#x4E86;&#x66FF;&#x6362;&#x6A21;&#x578B;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x62A5;&#x9519;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6D4B;&#x8BD5;&#x8BE5;&#x600E;&#x4E48;&#x5199;&#x5462;&#xFF1F;&#x8BF7;&#x67E5;&#x9605;test/exn&#x7684;&#x6587;&#x6863;&#x3002;</p>
</blockquote>
<h2 id="64-&#x4F5C;&#x7528;&#x57DF;">6.4 &#x4F5C;&#x7528;&#x57DF;</h2>
<p>&#x4E0A;&#x9762;&#x90A3;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x73AF;&#x5883;&#x6A21;&#x578B;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x6240;&#x5B9E;&#x73B0;&#x7684;&#x8BED;&#x4E49;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#xFF08;dynamic scope&#xFF09;</strong>&#x3002;&#x5B83;&#x610F;&#x5473;&#x7740;&#x968F;&#x7740;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x7ED1;&#x5B9A;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x67D0;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x662F;&#x5426;&#x88AB;&#x7ED1;&#x5B9A;&#x53D6;&#x51B3;&#x4E8E;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x5386;&#x53F2;&#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x88AB;&#x89C6;&#x4F5C;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x5B83;&#x589E;&#x52A0;&#x4E86;&#x6240;&#x6709;&#x76F8;&#x5173;&#x5DE5;&#x5177;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5982;&#x7F16;&#x8BD1;&#x5668;&#x3001;IDE&#xFF0C;&#x4E5F;&#x4F7F;&#x5F97;&#x5176;&#x4EE3;&#x7801;&#x96BE;&#x4E8E;&#x9605;&#x8BFB;&#x7EF4;&#x62A4;&#x3002;</p>
<p>&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x66FF;&#x6362;&#x6A21;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0A;&#x9762;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#x7684;&#x73AF;&#x5883;&#x6A21;&#x578B;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x7684;&#x662F;<strong>&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#xFF08;lexical scope&#xFF09;</strong> &#x6216;&#x79F0;<strong>&#x9759;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#xFF08;static scope&#xFF09;</strong>&#x3002;&#x8FD9;&#x91CC;&#x201C;&#x8BCD;&#x6CD5;&#xFF08;lexical&#xFF09;&#x201D;&#x6307;&#x7684;&#x662F; &#x201C;&#x901A;&#x8FC7;&#x6E90;&#x7801;&#x5373;&#x53EF;&#x786E;&#x5B9A;&#x201D;&#xFF1B;&#x201C;&#x9759;&#x6001;&#xFF08;static&#xFF09;&#x201D;&#x6307;&#x7684;&#x662F;&#x201C;&#x4E0D;&#x9700;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x5373;&#x53EF;&#x786E;&#x5B9A;&#x201D;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x4E24;&#x8005;&#x6307;&#x4EE3;&#x7684;&#x610F;&#x4E49;&#x76F8;&#x540C;&#x3002;&#x5F53;&#x9047;&#x5230;&#x6807;&#x8BC6;&#x7B26;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x77E5;&#x9053;&#x4E24;&#x4EF6;&#x4E8B;&#xFF1A;</p>
<ol>
<li>&#x5B83;&#x662F;&#x5426;&#x88AB;&#x7ED1;&#x5B9A;&#x4E86;&#xFF1F;</li>
<li>&#x5982;&#x679C;&#x88AB;&#x7ED1;&#x5B9A;&#xFF0C;&#x5728;&#x4F55;&#x5904;&#x88AB;&#x7ED1;&#x5B9A;&#x7684;&#xFF1F;</li>
</ol>
<p>&#x8FD9;&#x91CC;&#x201C;&#x4F55;&#x5904;&#x88AB;&#x7ED1;&#x5B9A;&#x201D;&#x6307;&#x7684;&#x662F;&#x5F53;&#x7A0B;&#x5E8F;&#x4E2D;&#x67D0;&#x4E2A;&#x540D;&#x5B57;&#x5728;&#x591A;&#x5904;&#x88AB;&#x7ED1;&#x5B9A;&#xFF0C;&#x5F53;&#x524D;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x5BF9;&#x5E94;&#x4E8E;&#x54EA;&#x4E2A;&#x7ED1;&#x5B9A;&#x3002;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x90A3;&#x4E2A;&#x7ED1;&#x5B9A;&#x8D1F;&#x8D23;&#x5F53;&#x524D;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x7ED1;&#x5B9A;&#xFF1F;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x9759;&#x6001;&#x7684;&#x7B54;&#x6848;&#xFF1B;&#x4E8E;&#x662F;&#x4F60;&#x7684;IDE&#x6CA1;&#x6CD5;&#x63D0;&#x793A;&#x4F60;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x5728;&#x54EA;&#x4E2A;&#x5730;&#x65B9;&#x88AB;&#x5B9A;&#x4E49;&#x7684;&#xFF08;DrRacket&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x753B;&#x7BAD;&#x5934;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x793A;&#x6B64;&#x7C7B;&#x4FE1;&#x606F;&#xFF09;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x56E0;&#x6B64;&#xFF0C;&#x968F;&#x7740;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x53D8;&#x5F97;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#xFF08;&#x6BD4;&#x5982;&#x5F15;&#x5165;&#x5BF9;&#x8C61;&#x3001;&#x7EBF;&#x7A0B;&#x7B49;&#x6982;&#x5FF5;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x9700;&#x52AA;&#x529B;&#x7EF4;&#x62A4;&#x9759;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x539F;&#x5219;&#x3002;</p>
<blockquote>
<p>&#x601D;&#x8003;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5728;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;<strong>&#x6240;&#x6709;</strong>&#x53D8;&#x91CF;&#x7684;&#x7ED1;&#x5B9A;&#x4F4D;&#x7F6E;&#x90FD;&#x6CA1;&#x6CD5;&#x9759;&#x6001;&#x786E;&#x5B9A;&#xFF0C;&#x5B83;&#x603B;&#x662F;&#x53D6;&#x51B3;&#x4E8E;&#x52A8;&#x6001;&#x7684;&#x73AF;&#x5883;&#x3002;&#x6362;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x8FD9;&#x79CD;&#x4FE1;&#x606F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x3002;</p>
</blockquote>
<h3 id="641-&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x5230;&#x5E95;&#x6709;&#x591A;&#x7CDF;&#x7CD5;">6.4.1 &#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x5230;&#x5E95;&#x6709;&#x591A;&#x7CDF;&#x7CD5;</h3>
<p>&#x53EF;&#x80FD;&#x770B;&#x5230;&#x4E0A;&#x8FF0;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x5C0F;&#x9898;&#x5927;&#x4F5C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x8FD9;&#x4E24;&#x4EF6;&#x4E8B;&#xFF1A;</p>
<ol>
<li>&#x8981;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;<strong>&#x5FC5;&#x9700;&#x9605;&#x8BFB;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;</strong>&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x600E;&#x4E48;&#x5C06;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x89E3;&#x8026;&#x6210;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x7684;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x4E2A;&#x81EA;&#x7531;&#x53D8;&#x91CF;&#x5462;&#x3002;</li>
<li>&#x8981;&#x7406;&#x89E3;&#x7ED1;&#x5B9A;&#x5173;&#x7CFB;&#xFF0C;&#x5176;&#x590D;&#x6742;&#x5EA6;&#x4E0D;&#x4EC5;&#x6D89;&#x53CA;&#x5230;&#x7A0B;&#x5E8F;&#x7684;<strong>&#x4F53;&#x79EF;</strong>&#xFF0C;&#x8FD8;&#x7275;&#x626F;&#x5230;&#x63A7;&#x5236;&#x6D41;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x4E86;&#x5F88;&#x591A;&#x56DE;&#x8C03;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x8FFD;&#x8E2A;&#x6574;&#x4E2A;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x6765;&#x786E;&#x5B9A;&#x67D0;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x503C;&#x7684;&#x6765;&#x6E90;&#x3002;</li>
</ol>
<p>&#x8FD8;&#x4E0D;&#x591F;&#x6709;&#x8BF4;&#x670D;&#x529B;&#xFF1F;&#x8BA9;&#x6211;&#x4EEC;&#x628A;&#x793A;&#x4F8B;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x66FF;&#x6362;&#x4E3A;&#xFF1A;</p>
<pre><code class="lang-racket">(if (moon-visible?)
    (f1 10)
    (f2 10))
</code></pre>
<p>&#x5047;&#x8BBE;<code>moon-visible?</code>&#x51FD;&#x6570;&#x5728;&#x65B0;&#x6708;&#x7684;&#x591C;&#x665A;&#x5176;&#x503C;&#x4E3A;&#x5047;&#xFF0C;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;&#x771F;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x5E94;&#x5F53;&#x5728;&#x65B0;&#x6708;&#x591C;&#x665A;&#x62A5;&#x9519;&#xFF0C;&#x672A;&#x7ED1;&#x5B9A;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#x8FD4;&#x56DE;&#x67D0;&#x4E2A;&#x503C;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x5728;&#x591A;&#x4E91;&#x7684;&#x591C;&#x665A;&#x5462;&#xFF1F;</p>
</blockquote>
<h3 id="642-&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;">6.4.2 &#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;</h3>
<p>&#x5F53;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x601D;&#x8003;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x4E2D;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x65F6;&#xFF0C;&#x4E8B;&#x60C5;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E9B;&#x7248;&#x672C;&#x7684;Scheme&#xFF08;&#x5178;&#x578B;&#x7684;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x8BED;&#x8A00;&#xFF09;&#x5141;&#x8BB8;&#x4F60;&#x5199;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-scheme">(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> y <span class="hljs-number">1</span>)
(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> (<span class="hljs-name">f</span> x) (<span class="hljs-name"><span class="hljs-builtin-name">+</span></span> x y))
</code></pre>
<p>&#x770B;&#x4E0A;&#x53BB;&#x597D;&#x50CF;&#x51FD;&#x6570;<code>f</code>&#x4E2D;&#x7684;<code>y</code>&#x6765;&#x6E90;&#x5F88;&#x6E05;&#x6670;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF1A;</p>
<pre><code class="lang-scheme">(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> y <span class="hljs-number">1</span>)
(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> (<span class="hljs-name">f</span> x) (<span class="hljs-name"><span class="hljs-builtin-name">+</span></span> x y))
(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> y <span class="hljs-number">2</span>)
</code></pre>
<p>&#x8FD9;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x4E14;&#x8BA1;&#x7B97;<code>(f 10)</code>&#x65F6;&#x5B83;&#x8FD4;&#x56DE;12&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#xFF0C;&#x90A3;&#x4E48;&#x53D6;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x5C31;&#x5BF9;&#x4E86;&#xFF01;&#x3002;&#x4F46;&#x662F;&#xFF1A;</p>
<pre><code class="lang-scheme">(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> y <span class="hljs-number">1</span>)
(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> f (<span class="hljs-name"><span class="hljs-builtin-name">let</span></span> ((<span class="hljs-name">z</span> y)) (<span class="hljs-name"><span class="hljs-builtin-name">lambda</span></span> (x) (<span class="hljs-name"><span class="hljs-builtin-name">+</span></span> x y z))))
(<span class="hljs-name"><span class="hljs-builtin-name">define</span></span> y <span class="hljs-number">2</span>)
</code></pre>
<p>&#x8FD9;&#x65F6;&#x5019;&#xFF0C;<code>z</code>&#x7ED1;&#x5B9A;&#x7684;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;<code>y</code>&#x7684;&#x503C;&#xFF0C;lambda&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;<code>y</code>&#x88AB;&#x7ED1;&#x5B9A;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;<code>y</code>&#x7684;&#x503C;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x4E8B;&#x5B9E;&#x4E0A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x89E3;&#x91CA;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8BA9;&#x60C5;&#x51B5;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x53EF;&#x80FD;&#x907F;&#x514D;&#x8FD9;&#x6837;&#x7684;&#x91CD;&#x5B9A;&#x4E49;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;Racket&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x7684;&#xFF08;&#x5728;Racket&#x4E2D;&#x8FD9;&#x4E48;&#x64CD;&#x4F5C;&#x4F1A;&#x5BFC;&#x81F4;&#x62A5;&#x9519;&#xFF09;&#xFF0C;&#x5B83;&#x80FD;&#x63D0;&#x4F9B;&#x7528;&#x6237;&#x5168;&#x5C40;&#x5B9A;&#x4E49;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x907F;&#x514D;&#x8FD9;&#x7C7B;&#x9EBB;&#x70E6;&#x4E8B;&#x3002;</p>
<blockquote>
<p>&#x5F88;&#x591A;&#x201C;&#x811A;&#x672C;&#x201D;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6240;&#x4EE5;&#x7F51;&#x4E0A;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x5F88;&#x591A;&#x4EBA;&#x641E;&#x4E0D;&#x6E05;&#x695A;&#x67D0;&#x79CD;&#x8BED;&#x8A00;&#x5230;&#x5E95;&#x662F;&#x9759;&#x6001;&#x8FD8;&#x662F;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4EBA;&#x4EEC;&#x53EA;&#x662F;&#x5728;&#x6BD4;&#x8F83;&#x51FD;&#x6570;&#x5185;&#x7684;&#x884C;&#x4E3A;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x9759;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#xFF09;&#x8FD8;&#x662F;&#x5168;&#x5C40;&#x7684;&#x884C;&#x4E3A;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#xFF09;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
</blockquote>
<h2 id="65-&#x66B4;&#x9732;&#x73AF;&#x5883;">6.5 &#x66B4;&#x9732;&#x73AF;&#x5883;</h2>
<p>&#x5982;&#x679C;&#x662F;&#x5B9E;&#x73B0;&#x4F9B;&#x522B;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x660E;&#x667A;&#x7684;&#x9009;&#x62E9;&#x662F;&#x5C06;&#x73AF;&#x5883;&#x9690;&#x85CF;&#x8D77;&#x6765;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x63A5;&#x53E3;&#x53EA;&#x63A5;&#x6536;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5916;&#x52A0;&#x4E00;&#x7CFB;&#x5217;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5728;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x4ECE;&#x7A7A;&#x767D;&#x7684;&#x73AF;&#x5883;&#x5F00;&#x59CB;&#x8C03;&#x7528;interp&#x3002;&#x8FD9;&#x6837;&#x5373;&#x4E0D;&#x7528;&#x5C06;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x66B4;&#x9732;&#x7ED9;&#x7528;&#x6237;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x7531;&#x4E8E;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x9519;&#x8BEF;&#x7684;&#x73AF;&#x5883;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x66B4;&#x9732;&#x73AF;&#x5883;&#x53C2;&#x6570;&#x4E5F;&#x662F;&#x6709;&#x7528;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x5982;&#x679C;&#x8BED;&#x8A00;&#x5E0C;&#x671B;&#x9ED8;&#x8BA4;&#x7ED1;&#x5B9A;&#x4E00;&#x7CFB;&#x5217;&#x503C;:&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5C06;<code>pi</code>&#x7ED1;&#x5B9A;&#x5230;3.2&#xFF08;<a href="https://en.wikipedia.org/wiki/Indiana_Pi_Bill" target="_blank">Indiana</a>&#xFF09;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap5.html" class="navigation navigation-prev " aria-label="Previous page: 5. 添加函数">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap7.html" class="navigation navigation-next " aria-label="Next page: 7. 任意位置的函数">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"6. 从替换模型到环境模型","level":"1.7","depth":1,"next":{"title":"7. 任意位置的函数","level":"1.8","depth":1,"path":"chap7.md","ref":"chap7.md","articles":[]},"previous":{"title":"5. 添加函数","level":"1.6","depth":1,"path":"chap5.md","ref":"chap5.md","articles":[]},"dir":"ltr"},"config":{"plugins":["livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap6.md","mtime":"2017-11-27T05:14:35.624Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-11-27T11:51:52.513Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

