
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>10. 对象 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lotuc; MrMathematica">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap11.html" />
    
    
    <link rel="prev" href="chap9.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                     1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                     2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                     3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                     4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                     5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                     6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                     7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                     8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                     9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="chap15.html">
            
                <a href="chap15.html">
            
                    
                    15. 静态地检查程序中的不变量：类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="chap16.html">
            
                <a href="chap16.html">
            
                    
                    16. 动态地检查程序中的不变量：契约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chap17.html">
            
                <a href="chap17.html">
            
                    
                    17. 其他调用语义
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >10. 对象</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="10-&#x5BF9;&#x8C61;">10 &#x5BF9;&#x8C61;</h1>
<p>&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x503C;&#xFF0C;&#x5C31;&#x6700;&#x4E3A;&#x81EA;&#x7136;&#x5730;&#x63D0;&#x4F9B;&#x4E86;&#x8868;&#x793A;&#x8BA1;&#x7B97;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002;&#x5047;&#x8BBE;&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x628A;&#x67D0;&#x4E2A;&#x51FD;&#x6570;<code>f</code>&#x53C2;&#x6570;&#x5316;&#x3002;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x90FD;&#x4F1A;&#x5141;&#x8BB8;&#x628A;<strong>&#x88AB;&#x52A8;&#x7684;</strong>&#x6570;&#x636E;&#x2014;&#x2014;&#x6BD4;&#x5982;&#x6570;&#x5B57;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x2014;&#x2014;&#x7528;&#x4F5C;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;<strong>&#x4E3B;&#x52A8;&#x7684;</strong>&#x6570;&#x636E;&#x2014;&#x2014;&#x53EF;&#x4EE5;<strong>&#x8BA1;&#x7B97;</strong>&#x51FA;&#x7ED3;&#x679C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x54CD;&#x5E94;&#x67D0;&#x79CD;&#x4FE1;&#x606F;&#x2014;&#x2014;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5C31;&#x5F88;&#x6709;&#x5438;&#x5F15;&#x529B;&#x4E86;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x7ED9;<code>f</code>&#x7684;&#x51FD;&#x6570;&#x2014;&#x2014;&#x5047;&#x8BBE;&#x5B83;&#x9075;&#x4ECE;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x2014;&#x2014;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x8C03;&#x7528;&#x8005;&#x63D0;&#x4F9B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x65E0;&#x9700;&#x66B4;&#x9732;&#x7ED9;<code>f</code>&#xFF0C;&#x8FD9;&#x7ED9;&#x5B89;&#x5168;&#x548C;&#x9690;&#x79C1;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x77F3;&#x3002;&#x6B63;&#x56E0;&#x5982;&#x6B64;&#xFF0C;&#x9075;&#x4ECE;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x51FD;&#x6570;&#x6210;&#x4E86;&#x8BBE;&#x8BA1;&#x5F88;&#x591A;&#x5B89;&#x5168;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x7684;&#x6838;&#x5FC3;&#x3002;</p>
<p>&#x51FD;&#x6570;&#x662F;&#x597D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x592A;&#x8FC7;&#x7B80;&#x6D01;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x591A;&#x4E2A;&#x51FD;&#x6570;&#x95ED;&#x5408;&#x4E8E;&#x540C;&#x4E00;&#x4EFD;<strong>&#x5171;&#x4EAB;&#x7684;</strong>&#x6570;&#x636E;&#xFF1B;&#x5171;&#x4EAB;&#x7684;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#xFF0C;&#x5F53;&#x8FD9;&#x4EFD;&#x6570;&#x636E;&#x88AB;&#x5176;&#x4E2D;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x770B;&#x5230;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF1B;&#x53D1;&#x9001;&#x4E00;&#x7EC4;&#x51FD;&#x6570;&#x66F4;&#x6709;&#x7528;&#x3002;&#x63A5;&#x6536;&#x65B9;&#x5219;&#x9700;&#x8981;&#x80FD;&#x591F;&#x4ECE;&#x8FD9;&#x7EC4;&#x51FD;&#x6570;&#x4E2D;&#x63D0;&#x53D6;&#x51FA;&#x5404;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4E48;&#x4E00;&#x7EC4;&#x51FD;&#x6570;&#xFF0C;&#x5916;&#x52A0;&#x4ECE;&#x4E2D;&#x9009;&#x53D6;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4FBF;&#x662F;<strong>&#x5BF9;&#x8C61;</strong>&#xFF08;object&#xFF09;&#x7684;&#x7CBE;&#x9AD3;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x8FC7;&#x4E86;&#x51FD;&#x6570;&#xFF08;<a href="chap7.html">&#x7B2C;&#x4E03;&#x7AE0;</a>&#xFF09;&#x548C;&#x53EF;&#x53D8;&#x7ED3;&#x6784;&#xFF08;<a href="chap8.html">&#x7B2C;&#x516B;&#x7AE0;</a>&#xFF09;&#xFF0C;&#x73B0;&#x5728;&#x6B63;&#x662F;&#x5B66;&#x4E60;&#x5BF9;&#x8C61;&#x7684;&#x6700;&#x4F73;&#x65F6;&#x673A;&#x2014;&#x2014;&#x540C;&#x65F6;&#x524D;&#x9762;&#x5B66;&#x4E60;&#x7684;&#x9012;&#x5F52;&#xFF08;<a href="chap9.html">&#x7B2C;&#x4E5D;&#x7AE0;</a>&#xFF09;&#x4E5F;&#x5C06;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x628A;&#x6B64;&#x6982;&#x5FF5;&#x7684;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#x548C;&#x6269;&#x5C55;&#x5B83;&#xFF0C;&#x4ECE;&#x800C;&#x63A2;&#x7A76;&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x7684;&#x5404;&#x79CD;&#x7EF4;&#x5EA6;&#x3002;&#x9996;&#x5148;&#x5C55;&#x793A;&#x4E00;&#x4E0B;&#x600E;&#x4E48;&#x5C06;&#x5BF9;&#x8C61;&#x52A0;&#x5165;&#x5230;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x60F3;&#x8981;&#x5FEB;&#x901F;&#x6784;&#x5EFA;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x8F6C;&#x5411;&#x57FA;&#x4E8E;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x7B56;&#x7565;&#x3002;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x662F;&#x5426;&#x8BA4;&#x4E3A;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#x5BF9;&#x7406;&#x89E3;&#x4F60;&#x7684;&#x8BED;&#x8A00;&#x7684;&#x672C;&#x8D28;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x5224;&#x65AD;&#x8FD9;&#x70B9;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x770B;&#x4F60;&#x7684;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x8FC7;&#x7A0B;&#x53D8;&#x5F97;&#x6709;&#x591A;&#x590D;&#x6742;&#xFF0C;&#x4EE5;&#x53CA;&#xFF0C;&#x5728;&#x7ED9;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7279;&#x6027;&#x540E;&#xFF0C;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x80FD;&#x5426;&#x5927;&#x5E45;&#x964D;&#x4F4E;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4E0D;&#x80FD;&#x6307;&#x671B;&#x8FD9;&#x91CC;&#x80FD;&#x8BA8;&#x8BBA;&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x5207;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#xC9;ric Tanter&#x7684;&#x300A;<a href="http://users.dcc.uchile.cl/~etanter/ooplai/" target="_blank">Object-Oriented Programming Languages: Application and Interpretation</a>&#x300B;&#xFF08;&#x300A;<a href="https://mrmathematica.gitbooks.io/ooplai/content/" target="_blank">&#x9762;&#x5BF9;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF1A;&#x5E94;&#x7528;&#x548C;&#x89E3;&#x91CA;</a>&#x300B;&#xFF09; &#x6765;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x4E3B;&#x9898;&#x3002;</p>
</blockquote>
<h2 id="101-&#x4E0D;&#x652F;&#x6301;&#x7EE7;&#x627F;&#x7684;&#x5BF9;&#x8C61;">10.1 &#x4E0D;&#x652F;&#x6301;&#x7EE7;&#x627F;&#x7684;&#x5BF9;&#x8C61;</h2>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x5BF9;&#x8C61;&#x6982;&#x5FF5;&#x2014;&#x2014;&#x53EF;&#x80FD;&#x662F;&#x552F;&#x4E00;&#x6240;&#x6709;&#x8C08;&#x8BBA;&#x5BF9;&#x8C61;&#x7684;&#x4EBA;&#x90FD;&#x80FD;&#x8BA4;&#x540C;&#x7684;&#x5B9A;&#x4E49;&#x2014;&#x2014;&#x5BF9;&#x8C61;&#x662F;&#xFF1A;</p>
<ul>
<li>&#x503C;&#xFF0C;</li>
<li>&#x591F;&#x5C06;&#x4E00;&#x4E9B;&#x540D;&#x5B57;&#x6620;&#x5C04;&#x6210;</li>
<li>&#x5176;&#x5B83;&#x4E1C;&#x897F;&#xFF1A;&#x503C;&#x6216;&#x8005;&#x201C;&#x65B9;&#x6CD5;&#xFF08;methods&#xFF09;&#x201D;</li>
</ul>
<p>&#x4ECE;&#x7B80;&#x7EA6;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x5C31;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x4E86;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x5FFD;&#x7565;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<blockquote>
<p>&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x201C;&#x65B9;&#x6CD5;&#x201D;&#x548C;&#x51FD;&#x6570;&#x6781;&#x5176;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x67D0;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x9762;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1A;&#x8C03;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x5185;&#x90E8;&#x6240;&#x7ED1;&#x5B9A;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
</blockquote>
<h3 id="1011-&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;">10.1.1 &#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;</h3>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5F80;&#x652F;&#x6301;&#x4E00;&#x7B49;&#x51FD;&#x6570;&#x7684;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#xFF08;&#x8BD1;&#x6CE8;&#xFF0C;&#x5373;&#x7B2C;&#x4E03;&#x7AE0;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x8BED;&#x8A00;&#xFF09;&#x4E2D;&#x52A0;&#x5165;&#x7B80;&#x5355;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x663E;&#x7136;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6269;&#x5C55;&#x503C;&#x7684;&#x6982;&#x5FF5;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type Value
  [numV (n : number)]
  [closV (arg : symbol) (body : ExprC) (env : Env)]
  [objV (ns : (listof symbol)) (vs : (listof Value))])
</code></pre>
<p>&#x8FD8;&#x8981;&#x6269;&#x5C55;&#x8BED;&#x6CD5;&#xFF0C;&#x652F;&#x6301;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x8868;&#x8FBE;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-Racket">[objC (ns : (listof symbol)) (es : (listof ExprC))]
</code></pre>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x5DF2;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x6289;&#x62E9;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#xFF08;&#x5982;JavaScript&#xFF09;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5199;&#x51FA;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x6982;&#x5FF5;&#xFF0C;JavaScript&#x4E2D;&#x8BE5;&#x529F;&#x80FD;&#x7684;&#x90E8;&#x5206;&#x8BED;&#x6CD5;&#x6210;&#x4E86;&#x7F51;&#x7EDC;&#x6807;&#x51C6;&#x2014;&#x2014;JSON&#x3002;&#x5728;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#xFF08;&#x5982;Java&#xFF09;&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6765;&#x521B;&#x5EFA;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x8BBE;&#x8BA1;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x3002;&#x8981;&#x6A21;&#x62DF;&#x540E;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x6A21;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x9075;&#x4ECE;&#x540E;&#x6587;&#x8BA8;&#x8BBA;&#x5230;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x7A0B;&#x5F0F;&#x5316;&#x60EF;&#x4F8B;&#xFF0C;&#x53EA;&#x5728;&#x7279;&#x5B9A;&#x4F4D;&#x7F6E;&#x76F4;&#x63A5;&#x5199;&#x51FA;&#x5BF9;&#x8C61;&#x3002;</p>
</blockquote>
<p>&#x5BF9;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x6C42;&#x503C;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5BF9;&#x6BCF;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4F4D;&#x7F6E;&#x90FD;&#x6C42;&#x503C;&#x5C31;&#x884C;&#xFF1A;</p>
<pre><code class="lang-Racket">[objC (ns es) (objV ns (map (lambda (e)
                              (interp e env))
                            es))]
</code></pre>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5B9E;&#x9645;<strong>&#x4F7F;&#x7528;</strong>&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x5176;&#x5185;&#x5BB9;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x6765;&#x63D0;&#x53D6;&#x6210;&#x5458;&#xFF1A;</p>
<pre><code class="lang-Racket">[msgC (o : ExprC) (n : symbol)]  ;&#x6D88;&#x606F;&#xFF0C;&#x6838;&#x5FC3;&#x8BED;&#x8A00;
</code></pre>
<p>&#x5176;&#x884C;&#x4E3A;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#xFF1A;</p>
<pre><code class="lang-Racket">[msgC (o n) (lookup-msg n (interp o env))]
</code></pre>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x5B9E;&#x73B0;&#x51FD;&#x6570;</p>
<pre><code class="lang-Racket">; lookup-msg : symbol * Value -&gt; Value
</code></pre>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x5E94;&#x8BE5;&#x662F;<code>objV</code>&#x3002;</p>
</blockquote>
<p>&#x539F;&#x5219;&#x4E0A;&#xFF0C;<code>msgC</code>&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x4EFB;&#x610F;&#x7C7B;&#x578B;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x4F46;&#x662F;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6210;&#x5458;&#x4E2D;&#x53EA;&#x6709;&#x51FD;&#x6570;&#x3002;&#x8981;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x6210;&#x5458;&#xFF0C;&#x9700;&#x8981;&#x7ED9;&#x5176;&#x4F20;&#x5165;&#x53C2;&#x6570;&#x503C;&#x3002;&#x5728;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x6CD5;&#x4E2D;&#x8FD9;&#x4E48;&#x5199;&#x6709;&#x70B9;&#x7B28;&#x62D9;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x8FC7;&#x7A0B;&#x964D;&#x4F4E;&#x4E86;&#x8BED;&#x6CD5;&#x590D;&#x6742;&#x6027;&#xFF1A;&#x8868;&#x5C42;&#x8BED;&#x6CD5;&#x4E2D;&#x6D88;&#x606F;&#x8C03;&#x7528;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x6D88;&#x606F;&#x540D;&#x548C;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">[msgS (o : ExprS) (n : symbol) (a : ExprS)]  ;&#x6D88;&#x606F;&#xFF0C;&#x8868;&#x5C42;&#x8BED;&#x8A00;
</code></pre>
<p>&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5F97;<code>msgC</code>&#x548C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF1A;</p>
<pre><code class="lang-Racket">[msgS (o n a) (appC (msgC (desugar o) n) (desugar a))]
</code></pre>
<p>&#x81F3;&#x6B64;&#xFF0C;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#x5C31;&#x8BDE;&#x751F;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x5BF9;&#x8C61;&#x5B9A;&#x4E49;&#x548C;&#x8C03;&#x7528;&#xFF1A;</p>
<pre><code class="lang-Racket">(letS &apos;o (objS (list &apos;add1 &apos;sub1)
               (list (lamS &apos;x (plusS (idS &apos;x) (numS 1)))
                     (lamS &apos;x (plusS (idS &apos;x) (numS -1)))))
      (msgS (idS &apos;o) &apos;add1 (numS 3)))
</code></pre>
<p>&#x5B83;&#x8BA1;&#x7B97;&#x5F97;<code>(numV 4)</code>&#x3002;</p>
<h3 id="1012-&#x901A;&#x8FC7;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5B9E;&#x73B0;&#x5BF9;&#x8C61;">10.1.2 &#x901A;&#x8FC7;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5B9E;&#x73B0;&#x5BF9;&#x8C61;</h3>
<p>&#x5728;&#x8BED;&#x8A00;&#x6838;&#x5FC3;&#x4E2D;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x4E5F;&#x8BB8;&#x662F;&#x503C;&#x5F97;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x5B66;&#x4E60;&#x5B83;&#x6765;&#x8BF4;&#x8FD9;&#x4E48;&#x505A;&#x592A;&#x9EBB;&#x70E6;&#x4E86;&#x3002;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x662F;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x4F7F;&#x7528;Racket&#x8BED;&#x8A00;&#x4E2D;&#x90A3;&#x4E9B;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x5DF2;&#x7ECF;&#x5B9E;&#x73B0;&#x8FC7;&#x7684;&#x7279;&#x6027;&#x6765;&#x8868;&#x793A;&#x5BF9;&#x8C61;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x662F;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#xFF08;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x7406;&#x7531;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x7A0B;&#x5F0F;&#x5316;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x80FD;&#x67D0;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x770B;&#x4E0A;&#x53BB;&#x5E76;&#x4E0D;&#x5FC5;&#x8981;&#xFF0C;&#x4F46;&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x662F;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x4EE3;&#x7801;&#x3002;&#xFF09;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x540E;&#x9762;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x4F7F;&#x7528;<code>#lang plai</code>&#xFF0C;<strong>&#x800C;&#x4E0D;&#x662F;</strong><code>typed</code>&#xFF08;&#x9759;&#x6001;&#x7C7B;&#x578B;&#xFF09;&#x8BED;&#x8A00;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;<code>#lang plai</code>&#xFF1F;&#x4E0D;&#x7136;&#x7684;&#x8BDD;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x540E;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x78B0;&#x5230;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x597D;&#x89E3;&#x51B3;&#x5417;&#xFF0C;&#x6BD4;&#x5982;&#x5F15;&#x5165;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x7C7B;&#x578B;&#x6B63;&#x786E;&#xFF1F;&#x5982;&#x679C;&#x7B80;&#x5316;&#x6211;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x5462;&#xFF0C;&#x6BD4;&#x5982;&#x8BA9;&#x65B9;&#x6CD5;&#x53EA;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF1F;&#x6216;&#x8005;&#x5176;&#x4E2D;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#x5F88;&#x96BE;&#x89E3;&#x51B3;&#xFF1F;</p>
</blockquote>
<h3 id="1013-&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x540D;&#x79F0;&#x96C6;&#x5408;">10.1.3 &#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;&#x540D;&#x79F0;&#x96C6;&#x5408;</h3>
<p>&#x9996;&#x5148;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5B9E;&#x73B0;&#x7684;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x3002;&#x5BF9;&#x8C61;&#x662F;&#x5BF9;&#x7ED9;&#x5B9A;&#x540D;&#x79F0;&#x8FDB;&#x884C;&#x5206;&#x6D3E;&#x7684;&#x4E00;&#x79CD;&#x503C;&#x3002;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x7528;<code>lambda</code>&#x8868;&#x793A;&#x5BF9;&#x8C61;&#xFF0C;&#x7528;<code>case</code>&#x5B9E;&#x73B0;&#x5206;&#x6D3E;&#xFF1A;</p>
<pre><code class="lang-Racket">(define o-1
  (lambda (m)
    (case m
      [(add1) (lambda (x) (+ x 1))]
      [(sub1) (lambda (x) (- x 1))])))
</code></pre>
<blockquote>
<p>&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x6CDB;&#x5316;&#x4E86;&#x7684;<code>lambda</code>&#xFF0C;&#x5E26;&#x6709;&#x591A;&#x4E2A;&#x201C;&#x5165;&#x53E3;&#x70B9;&#x201D;&#x3002;&#x76F8;&#x53CD;&#xFF0C;<code>lambda</code>&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5165;&#x53E3;&#x70B9;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x56E0;&#x6B64;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x201C;&#x65B9;&#x6CD5;&#x540D;&#x201D;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x548C;&#x672C;&#x7AE0;&#x524D;&#x9762;&#x7684;&#x5B9A;&#x4E49;&#x7684;&#x5BF9;&#x8C61;&#x76F8;&#x540C;&#xFF0C;&#x4F7F;&#x7528;&#x5176;&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x5F0F;&#x4E5F;&#x76F8;&#x540C;&#xFF1A;</p>
<pre><code class="lang-Racket">(test ((o-1 &apos;add1) 5) 6)  ;;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x4F1A;&#x901A;&#x8FC7;
</code></pre>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x79CD;&#x5D4C;&#x5957;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6709;&#x70B9;&#x81C3;&#x80BF;&#xFF08;&#x5E76;&#x4E14;&#x5C06;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x81C3;&#x80BF;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x6700;&#x597D;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x65B9;&#x4FBF;&#x7684;&#x8BED;&#x6CD5;&#x6765;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x2014;&#x2014;&#x548C;&#x524D;&#x6587;<code>msgS</code>&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5C06;&#x5176;&#x5B9A;&#x4E49;&#x4E3A;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (msg o m . a)
  (apply (o m) a))
</code></pre>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x4E86;Racket&#x7684;&#x53EF;&#x53D8;&#x53C2;&#x6570;&#x76EE;&#x6570;&#x8BED;&#x6CD5;&#xFF1A;<code>. a</code>&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x5C06;&#x5269;&#x4E0B;&#x6240;&#x6709;&#x53C2;&#x6570;&#x2014;&#x2014;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x2014;&#x2014;&#x7ED1;&#x5B9A;&#x5230;&#x540D;&#x4E3A;<code>a</code>&#x7684;&#x94FE;&#x8868;&#x3002;<code>apply</code>&#x5C06;&#x94FE;&#x8868;&#x4E2D;&#x7684;&#x503C;&#x53D6;&#x51FA;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x6765;&#x8FDB;&#x884C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x7684;&#x6D4B;&#x8BD5;&#x5C31;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5199;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (msg o-1 &apos;add1 5) 6)
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x6362;&#x7528;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x65B9;&#x5F0F;&#x540E;&#xFF0C;&#x6709;&#x4E9B;&#x91CD;&#x5927;&#x6539;&#x53D8;&#x3002;&#x4F60;&#x610F;&#x8BC6;&#x5230;&#x662F;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x8BED;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-Racket">[msgC (o : ExprC) (n : symbol)]
</code></pre>
<p>&#x6CE8;&#x610F;&#x5230;&#x6D88;&#x606F;&#x201C;&#x540D;&#x5B57;&#x201D;&#x7684;&#x4F4D;&#x7F6E;&#x5FC5;&#x987B;&#x662F;<strong>&#x7B26;&#x53F7;</strong>&#x3002;&#x5373;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x8BE5;&#x4F4D;&#x7F6E;&#x5FC5;&#x987B;&#x5B57;&#x9762;&#x5199;&#x4E0A;&#x7B26;&#x53F7;&#x3002;&#x800C;&#x5728;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x7248;&#x672C;&#x4E2D;&#xFF0C;&#x540D;&#x5B57;&#x7684;&#x4F4D;&#x7F6E;&#x53EA;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5F53;&#x7136;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x5FC5;&#x987B;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7B26;&#x53F7;&#xFF1B;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5199;&#xFF1A;</p>
<pre><code class="lang-Racket">(test ((o-1 (string-&gt;symbol &quot;add1&quot;)) 5) 6)  ;;&#x8FD9;&#x4E5F;&#x4F1A;&#x901A;&#x8FC7;
</code></pre>
<p>&#x8FD9;&#x662F;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x5E38;&#x89C1;&#x95EE;&#x9898;&#xFF1A;&#x76EE;&#x6807;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x80FD;&#x5728;&#x6E90;&#x7801;&#x4E2D;&#x6CA1;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x8868;&#x793A;&#xFF0C;&#x4E8E;&#x662F;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x6620;&#x5C04;&#x56DE;&#x53BB;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x6620;&#x5C04;&#xFF0C;&#x4E0D;&#x8FC7;&#x67D0;&#x4E9B;&#x8C03;&#x8BD5;&#x548C;&#x7A0B;&#x5E8F;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x4E2D;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4FDD;&#x8BC1;&#x76EE;&#x6807;&#x8BED;&#x8A00;&#x4E2D;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x65E0;&#x6CD5;&#x5728;&#x6E90;&#x7801;&#x4E2D;&#x5BF9;&#x5E94;&#x7684;<strong>&#x503C;</strong>&#x3002;</p>
<p>&#x6709;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x6DFB;&#x52A0;&#x90A3;&#x4E9B;&#x5927;&#x591A;&#x6570;&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x4E2D;&#x90FD;&#x6709;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<h3 id="1014-&#x6784;&#x9020;&#x5668;">10.1.4 &#x6784;&#x9020;&#x5668;</h3>
<p>&#x6784;&#x9020;&#x5668;&#x5C31;&#x662F;&#x5728;&#x5BF9;&#x8C61;&#x6784;&#x9020;&#x65F6;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x5B9A;&#x4E49;&#x8FC7;&#x8FD9;&#x79CD;&#x51FD;&#x6570;&#x3002;&#x53EA;&#x8981;&#x5C06;&#x5BF9;&#x8C61;&#x4ECE;&#x5B57;&#x9762;&#x503C;&#x8F6C;&#x6362;&#x6210;&#x63A5;&#x53D7;&#x6784;&#x9020;&#x53C2;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x6548;&#x679C;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (o-constr-1 x)
  (lambda (m)
    (case m
      [(addX) (lambda (y) (+ x y))])))

(test (msg (o-constr-1 5) &apos;addX 3) 8)
(test (msg (o-constr-1 2) &apos;addX 3) 5)
</code></pre>
<p>&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F20;&#x5165;5&#x4F5C;&#x4E3A;&#x6784;&#x9020;&#x5668;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x52A0;3&#x5F97;8&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x8FD9;&#x8868;&#x660E;&#x6784;&#x9020;&#x5668;&#x7684;&#x4E24;&#x6B21;&#x8C03;&#x7528;&#x4E0D;&#x4F1A;&#x76F8;&#x4E92;&#x5E72;&#x6270;&#x3002;</p>
<h3 id="1015-&#x72B6;&#x6001;">10.1.5 &#x72B6;&#x6001;</h3>
<p>&#x8BB8;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x5BF9;&#x8C61;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x7528;&#x6765;&#x5C01;&#x88C5;&#x72B6;&#x6001;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x6211;&#x4EEC;&#x5F53;&#x7136;&#x4FDD;&#x6709;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x3002;&#x5982;&#x679C;&#x53BB;&#x9664;&#x8BED;&#x6CD5;&#x7CD6;&#x540E;&#x7684;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x53D8;&#x91CF;&#xFF08;&#x5F53;&#x7136;&#x652F;&#x6301;<code>box</code>&#x4E5F;&#x884C;&#xFF0C;&#x4EE3;&#x4EF7;&#x662F;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x8FC7;&#x7A0B;&#x4F1A;&#x66F4;&#x9EBB;&#x70E6;&#x4E9B;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x8D4B;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x4FEE;&#x6539;&#x6784;&#x9020;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (o-state-1 count)
  (lambda (m)
    (case m
      [(inc) (lambda () (set! count (+ count 1)))]
      [(dec) (lambda () (set! count (- count 1)))]
      [(get) (lambda () count)])))
</code></pre>
<blockquote>
<p>Alan Kay&#x2014;&#x2014;&#x56E0;&#x53D1;&#x660E;Smalltalk&#x548C;&#x73B0;&#x4EE3;&#x5BF9;&#x8C61;&#x6280;&#x672F;&#x800C;&#x83B7;&#x5F97;&#x56FE;&#x7075;&#x5956;&#x2014;&#x2014;&#x4E0D;&#x540C;&#x610F;&#x8FD9;&#x4E00;&#x89C2;&#x70B9;&#x3002;&#x5728;&#x300A;<a href="http://www.smalltalk.org/smalltalk/TheEarlyHistoryOfSmalltalk_Abstract.html" target="_blank">Smalltalk&#x7684;&#x65E9;&#x671F;&#x5386;&#x53F2;</a>&#x300B;&#x4E2D;&#xFF0C;&#x4ED6;&#x8BF4;&#xFF0C;&#x201C;&#x5728;Smalltalk&#x7684;&#x65E9;&#x671F;&#x5386;&#x53F2;&#x4E2D;&#xFF0C;&#x5F80;&#x5C0F;&#x4E86;&#x8BF4;&#xFF08;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x52A8;&#x673A;&#xFF09;&#x662F;&#x5BFB;&#x627E;&#x66F4;&#x6613;&#x7528;&#x7684;&#x8D4B;&#x503C;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x5219;&#x662F;&#x5C1D;&#x8BD5;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x8D4B;&#x503C;&#x3002;&#x4ED6;&#x8865;&#x5145;&#x8BF4;&#xFF1A;&#x201C;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4ECA;&#x5929;&#x6240;&#x8C13;&#x7684;&#x2018;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x2019;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x65B0;&#x74F6;&#x88C5;&#x65E7;&#x9152;&#x3002;&#x5F88;&#x591A;&#x7A0B;&#x5E8F;&#x90FD;&#x5145;&#x6EE1;&#x4E86;&#x2018;&#x8D4B;&#x503C;&#x5F0F;&#x7684;&#x2019;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x7531;&#x66F4;&#x6602;&#x8D35;&#x7684;&#x9644;&#x52A0;&#x5B50;&#x7A0B;&#x5E8F;&#x5B8C;&#x6210;&#x7F62;&#x4E86;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5E8F;&#x5217;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (let ([o (o-state-1 5)])
        (begin (msg o &apos;inc)
               (msg o &apos;dec)
               (msg o &apos;get)))
      5)
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x8D4B;&#x503C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (let ([o1 (o-state-1 3)]
            [o2 (o-state-1 3)])
        (begin (msg o1 &apos;inc)
               (msg o1 &apos;inc)
               (+ (msg o1 &apos;get)
                  (msg o2 &apos;get))))
      (+ 5 3))
</code></pre>
<h3 id="1016-&#x79C1;&#x6709;&#x6210;&#x5458;">10.1.6 &#x79C1;&#x6709;&#x6210;&#x5458;</h3>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x662F;&#x79C1;&#x6709;&#x6210;&#x5458;&#xFF1A;&#x53EA;&#x5728;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x53EF;&#x89C1;&#xFF0C;&#x5916;&#x90E8;&#x5C31;&#x4E0D;&#x53EF;&#x89C1;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x770B;&#x4E0A;&#x53BB;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x8FD8;&#x6709;&#x5F85;&#x6211;&#x4EEC;&#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x3001;&#x8BCD;&#x6CD5;&#x7ED1;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (o-state-2 init)
  (let ([count init])
    (lambda (m)
      (case m
        [(inc) (lambda () (set! count (+ count 1)))]
        [(dec) (lambda () (set! count (- count 1)))]
        [(get) (lambda () count)]))))
</code></pre>
<blockquote>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5728;Java&#x4E2D;&#xFF0C;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5176;&#x4ED6;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x4E5F;&#x80FD;&#x8BBF;&#x95EE;&#x201C;&#x79C1;&#x6709;&#x201D;&#x6210;&#x5458;&#x3002;&#x5426;&#x5219;&#x5C31;&#x6CA1;&#x529E;&#x6CD5;&#x5B9E;&#x73B0;&#x62BD;&#x8C61;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x4E48;&#x53BB;&#x9664;&#x8BED;&#x6CD5;&#x7CD6;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x8BBF;&#x95EE;<code>count</code>&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x5219;&#x786E;&#x4FDD;&#x5B83;&#x5BF9;&#x5916;&#x90E8;&#x4E0D;&#x53EF;&#x89C1;&#x3002;</p>
<h3 id="1017-&#x9759;&#x6001;&#x6210;&#x5458;">10.1.7 &#x9759;&#x6001;&#x6210;&#x5458;</h3>
<p>&#x5BF9;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x7279;&#x6027;&#x662F;<strong>&#x9759;&#x6001;</strong>&#x6210;&#x5458;&#xFF1A;&#x6240;&#x6709;&#x201C;&#x76F8;&#x540C;&#x201D;&#x7C7B;&#x578B;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x5171;&#x4EAB;&#x7684;&#x6210;&#x5458;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#xFF08;&#x79C1;&#x6709;&#x7684;&#xFF09;&#x8BCD;&#x6CD5;&#x8303;&#x56F4;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5E76;&#x4E14;&#x4F4D;&#x4E8E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E4B;&#x5916;&#xFF08;&#x8FD9;&#x4F7F;&#x5176;&#x5BF9;&#x6240;&#x6709;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">(define o-static-1
  (let ([counter 0])
    (lambda (amount)
      (begin
        (set! counter (+ 1 counter))
        (lambda (m)
          (case m
            [(inc) (lambda (n) (set! amount (+ amount n)))]
            [(dec) (lambda (n) (set! amount (- amount n)))]
            [(get) (lambda () amount)]
            [(count) (lambda () counter)]))))))
</code></pre>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x7528;&#x5F15;&#x53F7;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x5BF9;&#x8C61;&#x6709;&#x8BB8;&#x591A;&#x201C;&#x76F8;&#x540C;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x592A;&#x591A;&#x4E86;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x628A;&#x589E;&#x52A0;<code>counter</code>&#x7684;&#x90A3;&#x884C;&#x653E;&#x5728;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x201C;&#x6784;&#x9020;&#x5668;&#x201D;&#x6240;&#x5728;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x88AB;&#x64CD;&#x7EB5;&#x3002;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x5C31;&#x662F;&#x6784;&#x9020;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x5F71;&#x54CD;&#x4E86;&#x5168;&#x5C40;&#x7684;<code>count</code>&#xFF1A;</p>
<pre><code class="lang-Racket">(test (let ([o (o-static-1 1000)])
        (msg o &apos;count))
      1)

(test (let ([o (o-static-1 0)])
        (msg o &apos;count))
      2)
</code></pre>
<h3 id="1018-&#x5E26;&#x81EA;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;">10.1.8 &#x5E26;&#x81EA;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;</h3>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5BF9;&#x8C61;&#x8FD8;&#x53EA;&#x662F;&#x6253;&#x5305;&#x7684;&#x5B9E;&#x540D;&#x51FD;&#x6570;&#xFF1B;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x6709;&#x591A;&#x4E2A;&#x5B9E;&#x540D;&#x5165;&#x53E3;&#x70B9;&#x7684;&#x51FD;&#x6570;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5F88;&#x591A;&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x4E2D;&#x88AB;&#x8BA4;&#x4E3A;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x7279;&#x6027;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x51FD;&#x6570;&#x548C;&#x4F5C;&#x7528;&#x57DF;&#x5B9E;&#x73B0;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#x61C2;&#x5F97;<code>lambda</code>&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x786E;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x6CA1;&#x6709;&#x7ED9;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x8D77;&#x540D;&#x5B57;&#x7F62;&#x4E86;&#x3002;</p>
<p>&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x5F81;&#x662F;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x81EA;&#x5E26;&#x4E86;&#x5BF9;&#x8BE5;&#x5BF9;&#x8C61;&#x81EA;&#x5DF1;&#x7684;&#x5F15;&#x7528;&#xFF0C;&#x901A;&#x5E38;&#x79F0;&#x4E3A;<code>self</code>&#x6216;&#x8005;<code>this</code>&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x7684;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x5417;&#xFF1F;</p>
<blockquote>
<p>&#x5BF9;&#x8C61;&#x7684;&#x5021;&#x5BFC;&#x8005;&#x4EEC;&#x7ECF;&#x5E38;&#x91C7;&#x7528;&#x7684;&#x62DF;&#x4EBA;&#x5316;&#x7684;&#x672F;&#x8BED;&#x201C;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x201D;&#xFF0C;&#x800C;&#x6211;&#x66F4;&#x559C;&#x6B22;&#x8FD9;&#x79CD;&#x7565;&#x663E;&#x67AF;&#x71E5;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x8981;&#x6C42;&#x52A9;&#x4E8E;&#x62DF;&#x4EBA;&#x5316;&#xFF0C;&#x5DF2;&#x7ECF;&#x63CF;&#x8FF0;&#x4E86;&#x5F88;&#x591A;&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x7684;&#x5C5E;&#x6027;&#x4E86;&#x3002;</p>
</blockquote>
<h4 id="10181-&#x4F7F;&#x7528;&#x8D4B;&#x503C;&#x5B9E;&#x73B0;&#x81EA;&#x5F15;&#x7528;">10.1.8.1 &#x4F7F;&#x7528;&#x8D4B;&#x503C;&#x5B9E;&#x73B0;&#x81EA;&#x5F15;&#x7528;</h4>
<p>&#x662F;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5B9E;&#x73B0;&#xFF0C;&#x4E4B;&#x524D;&#x5B9E;&#x73B0;&#x9012;&#x5F52;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x6B64;&#x6A21;&#x5F0F;&#x4E86;&#xFF1B;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x5176;&#x4E00;&#x822C;&#x5316;&#xFF0C;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x81EA;&#x8EAB;&#x800C;&#x4E0D;&#x662F;<code>box</code>&#x6216;&#x8005;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define o-self!
  (let ([self &apos;dummy])
    (begin
      (set! self
            (lambda (m)
              (case m
                [(first) (lambda (x) (msg self &apos;second (+ x 1)))]
                [(second) (lambda (x) (+ x 1))])))
      self)))
</code></pre>
<p>&#x53EF;&#x4EE5;&#x770B;&#x89C1;&#x8FD9;&#x5C31;&#x662F;&#x9012;&#x5F52;&#x7684;&#x6A21;&#x5F0F;&#xFF08;<a href="chap9.html">&#x9012;&#x5F52;&#x51FD;&#x6570;</a>&#xFF09;&#xFF0C;&#x7A0D;&#x4F5C;&#x8C03;&#x6574;&#x3002;&#x5728;&#x65B9;&#x6CD5;<code>first</code>&#x4E2D;&#x4F7F;&#x7528;&#x81EA;&#x5F15;&#x7528;&#x8C03;&#x7528;&#x4E86;&#x65B9;&#x6CD5;<code>second</code>&#x3002;&#x6D4B;&#x8BD5;&#x8868;&#x660E;&#x8FD9;&#x4E48;&#x505A;&#x53EF;&#x884C;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (msg o-self! &apos;first 5) 7)
</code></pre>
<h4 id="10182-&#x4E0D;&#x7528;&#x8D4B;&#x503C;&#x5B9E;&#x73B0;&#x81EA;&#x5F15;&#x7528;">10.1.8.2 &#x4E0D;&#x7528;&#x8D4B;&#x503C;&#x5B9E;&#x73B0;&#x81EA;&#x5F15;&#x7528;</h4>
<p>&#x5982;&#x679C;&#x4F60;&#x7814;&#x7A76;&#x8FC7;&#x600E;&#x4E48;&#x4E0D;&#x4F7F;&#x7528;&#x8D4B;&#x503C;&#x5B9E;&#x73B0;&#x9012;&#x5F52;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8BE5;&#x65B9;&#x6848;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x8FD9;&#x91CC;&#x3002;</p>
<pre><code class="lang-Racket">(define o-self-no!
  (lambda (m)
    (case m
      [(first) (lambda (self x) (msg/self self &apos;second (+ x 1)))]
      [(second) (lambda (self x) (+ x 1))])))
</code></pre>
<p>&#x73B0;&#x5728;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x4F20;&#x5165;<code>self</code>&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x4E5F;&#x9700;&#x8981;&#x4FEE;&#x6539;&#xFF0C;&#x4EE5;&#x9075;&#x5FAA;&#x65B0;&#x6A21;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (msg/self o m . a)
  (apply (o m) o a))
</code></pre>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x8C03;&#x7528;&#x5BF9;&#x8C61;<code>o</code>&#x7684;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x628A;<code>o</code>&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x65B9;&#x6CD5;&#x3002;&#x663E;&#x7136;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B58;&#x5728;&#x9690;&#x60A3;&#xFF0C;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4F20;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;<code>self</code>&#x3002;&#x56E0;&#x6B64;&#x5C06;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x63D0;&#x4F9B;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x574F;&#x4E3B;&#x610F;&#xFF1B;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x5219;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<blockquote>
<p>&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;Python&#x8FD8;&#x662F;&#x5728;&#x5176;&#x8868;&#x5C42;&#x8BED;&#x6CD5;&#x4E2D;&#x8FD9;&#x4E48;&#x505A;&#x4E86;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x79CD;&#x81F4;&#x656C;Y-combinator&#x7684;&#x884C;&#x4E3A;&#x4EE4;&#x4EBA;&#x611F;&#x52A8;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x6B64;&#x5E26;&#x6765;&#x7684;&#x8106;&#x5F31;&#x6027;&#x4E5F;&#x8BB8;&#x4E0D;&#x5FC5;&#x8981;&#x3002;</p>
</blockquote>
<h3 id="1019-&#x52A8;&#x6001;&#x5206;&#x53D1;">10.1.9 &#x52A8;&#x6001;&#x5206;&#x53D1;</h3>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5BF9;&#x8C61;&#x7CFB;&#x7EDF;&#x7684;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x77E5;&#x9053;&#x6216;&#x8005;&#x51B3;&#x5B9A;&#x54EA;&#x4E2A;&#x5BF9;&#x8C61;&#x4F1A;&#x5904;&#x7406;&#x8BE5;&#x8C03;&#x7528;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x4E2A;&#x4E8C;&#x53C9;&#x6811;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6811;&#x4E2D;&#x8981;&#x4E48;&#x662F;&#x4E0D;&#x542B;&#x503C;&#x7684;&#x8282;&#x70B9;&#x6216;&#x8005;&#x542B;&#x503C;&#x7684;&#x53F6;&#x8282;&#x70B9;&#xFF08;&#x8BD1;&#x6CE8;&#xFF1A;&#x539F;&#x6587;&#x5982;&#x6B64;&#xFF0C;&#x548C;&#x540E;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6709;&#x76F8;&#x53CD;&#x4E4B;&#x5904;&#xFF09;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x501F;&#x52A9;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#x2014;&#x2014;<code>cond</code>&#x3001;<code>type-case</code>&#x3001;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#xFF0C;&#x6216;&#x4E0E;&#x4E4B;&#x7B49;&#x4EF7;&#x7684;&#x4E1C;&#x897F;&#x2014;&#x2014;&#x7A77;&#x4E3E;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x7684;&#x6811;&#x5E76;&#x6839;&#x636E;&#x5BF9;&#x5E94;&#x5F62;&#x5F0F;&#x6765;&#x9009;&#x62E9;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x6811;&#x7684;&#x5B9A;&#x4E49;&#x6269;&#x5C55;&#x4E86;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x65B0;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x5FC5;&#x987B;&#x4FEE;&#x6539;&#x3002;&#x52A8;&#x6001;&#x5206;&#x53D1;&#xFF08;dynamic dispatch&#xFF09;&#x5C06;&#x8BE5;&#x6761;&#x4EF6;&#x9009;&#x62E9;&#x79FB;&#x5230;<strong>&#x8BED;&#x8A00;&#x5185;&#x90E8;</strong>&#xFF0C;&#x4F7F;&#x5F97;&#x7528;&#x6237;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x7684;&#x5173;&#x952E;&#x7279;&#x6027;&#x662F;<strong>&#x53EF;&#x6269;&#x5C55;&#x7684;&#x6761;&#x4EF6;</strong>&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x3002;</p>
<blockquote>
<p>&#x52A8;&#x6001;&#x5206;&#x53D1;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x5177;&#x6709;<strong>&#x9ED1;&#x76D2;&#x53EF;&#x6269;&#x5C55;&#x6027;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x4E2A;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x89E6;&#x53CA;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#xFF08;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6269;&#x5C55;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x4E5F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x5927;&#x597D;&#x5904;&#x3002;&#x8FD9;&#x7684;&#x786E;&#x662F;&#x5BF9;&#x8C61;&#x76F8;&#x6BD4;&#x51FD;&#x6570;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x7136;&#x800C;&#x51FD;&#x6570;&#x76F8;&#x6BD4;&#x5BF9;&#x8C61;&#x6709;&#x4E2A;&#x5BF9;&#x7B49;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5F88;&#x591A;&#x5BF9;&#x8C61;&#x7A0B;&#x5E8F;&#x5458;&#x4F7F;&#x7528;&#x8BBF;&#x95EE;&#x8005;&#x6A21;&#x5F0F;&#xFF08;Visitor pattern&#xFF09;&#x6765;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x5176;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x50CF;&#x51FD;&#x6570;&#x5F0F;&#x7684;&#x3002;&#x8BF7;&#x53C2;&#x9605;<a href="http://www.cs.brown.edu/~sk/Publications/Papers/Published/kff-synth-fp-oo/" target="_blank">Synthesizing Object-Oriented and Functional Design to Promote Re-Use</a> &#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7ED9;&#x51FA;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x5B8C;&#x6574;&#x63CF;&#x8FF0;&#x3002;&#x8BD5;&#x7740;&#x7528;&#x4F60;&#x6700;&#x559C;&#x6B22;&#x7684;&#x8BED;&#x8A00;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x770B;&#x770B;<a href="http://www.cs.utah.edu/plt/publications/icfp98-ff/paper.shtml" target="_blank">Racket&#x4E2D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</a>&#x3002;</p>
</blockquote>
<p>&#x5148;&#x6765;&#x5B9A;&#x4E49;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6811;&#x5BF9;&#x8C61;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (mt)
  (let ([self &apos;dummy])
    (begin
      (set! self
            (lambda (m)
              (case m
                [(add) (lambda () 0)])))
      self)))

(define (node v l r)
  (let ([self &apos;dummy])
    (begin
      (set! self
            (lambda (m)
              (case m
                [(add) (lambda () (+ v
                                     (msg l &apos;add)
                                     (msg r &apos;add)))])))
      self)))
</code></pre>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x9020;&#x5177;&#x4F53;&#x7684;&#x6811;&#xFF1A;</p>
<pre><code class="lang-Racket">(define a-tree
  (node 10
        (node 5 (mt) (mt))
        (node 15 (node 6 (mt) (mt)) (mt))))
</code></pre>
<p>&#x6700;&#x540E;&#xFF0C;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (msg a-tree &apos;add) (+ 10 5 15 6))
</code></pre>
<p>&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5728;&#x6D4B;&#x8BD5;&#x6848;&#x4F8B;&#x4E2D;&#xFF0C;&#x8FD8;&#x6709;&#x5728;<code>node</code>&#x7684;<code>add</code>&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x90FD;&#x8C03;&#x7528;&#x4E86;<code>add</code>&#x65B9;&#x6CD5;&#x800C;&#x6CA1;&#x6709;&#x68C0;&#x67E5;&#x63A5;&#x6536;&#x65B9;&#x662F;<code>mt</code>&#x8FD8;&#x662F;<code>node</code>&#x3002;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x63D0;&#x53D6;&#x51FA;&#x63A5;&#x6536;&#x65B9;&#x7684;<code>add</code>&#x65B9;&#x6CD5;&#x5E76;&#x6267;&#x884C;&#x3002;&#x7528;&#x6237;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x6CA1;&#x6709;&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x52A8;&#x6001;&#x5206;&#x53D1;&#x7684;&#x7CBE;&#x9AD3;&#x3002;</p>
<h2 id="102-&#x6210;&#x5458;&#x8BBF;&#x95EE;&#x7684;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;">10.2 &#x6210;&#x5458;&#x8BBF;&#x95EE;&#x7684;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;</h2>
<p>&#x5BF9;&#x4E8E;&#x6210;&#x5458;&#x540D;&#x79F0;&#x7684;&#x5904;&#x7406;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E24;&#x4E2A;&#x6B63;&#x4EA4;&#x7684;&#x7EAC;&#x5EA6;&#x3002;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x662F;&#x540D;&#x5B57;&#x662F;&#x9759;&#x6001;&#x7ED9;&#x5B9A;&#x8FD8;&#x662F;&#x8BA1;&#x7B97;&#x7ED9;&#x51FA;&#x7684;&#xFF0C;&#x53E6;&#x4E00;&#x7EAC;&#x5EA6;&#x662F;&#x540D;&#x5B57;&#x7684;&#x96C6;&#x5408;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x8FD8;&#x662F;&#x53EF;&#x53D8;&#x7684;&#xFF1A;</p>
<table>
<thead>
<tr>
<th></th>
<th>&#x540D;&#x5B57;&#x662F;&#x9759;&#x6001;&#x7684;</th>
<th>&#x540D;&#x5B57;&#x662F;&#x8BA1;&#x7B97;&#x6C42;&#x5F97;&#x7684;</th>
</tr>
</thead>
<tbody>
<tr>
<td><strong>&#x6210;&#x5458;&#x56FA;&#x5B9A;</strong></td>
<td>&#x57FA;&#x672C;&#x7684;Java</td>
<td>Java&#x4E2D;&#x901A;&#x8FC7;&#x53CD;&#x5C04;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x540D;&#x5B57;</td>
</tr>
<tr>
<td><strong>&#x6210;&#x5458;&#x53EF;&#x53D8;</strong></td>
<td>&#x65E0;&#x6CD5;&#x60F3;&#x8C61;</td>
<td>&#x5927;&#x90E8;&#x5206;&#x811A;&#x672C;&#x8BED;&#x8A00;</td>
</tr>
</tbody>
</table>
<p>&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#xFF1A;&#x5982;&#x679C;&#x5F3A;&#x5236;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x6E90;&#x7801;&#x4E2D;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x6210;&#x5458;&#x540D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x65E0;&#x6CD5;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x53EF;&#x8BBF;&#x95EE;&#x7684;&#x6210;&#x5458;&#x4E86;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x8BBF;&#x95EE;&#x66FE;&#x7ECF;&#x5B58;&#x5728;&#x8FC7;&#x4F46;&#x662F;&#x88AB;&#x5220;&#x9664;&#x7684;&#x6210;&#x5458;&#x8FD8;&#x662F;&#x4F1A;&#x62A5;&#x9519;&#xFF09;&#x3002;&#x5176;&#x5B83;&#x7684;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x5DF2;&#x7ECF;&#x5728;&#x5404;&#x79CD;&#x8BED;&#x8A00;&#x4E2D;&#x88AB;&#x5C1D;&#x8BD5;&#x8FC7;&#x4E86;&#x3002;</p>
<p>&#x53F3;&#x4E0B;&#x65B9;&#x90A3;&#x79CD;&#x60C5;&#x51B5;&#x5BC6;&#x5207;&#x5BF9;&#x5E94;&#x4E8E;&#x90A3;&#x4E9B;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x8868;&#x793A;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x6210;&#x5458;&#x540D;&#x5B57;&#x5373;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x5C06;&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x63A8;&#x5230;&#x6781;&#x9650;&#xFF0C;&#x5F53;&#x7D22;&#x5F15;&#x662F;&#x6570;&#x5B57;&#x65F6;&#x4E5F;&#x540C;&#x6837;&#x5904;&#x7406;&#xFF0C;&#x4E8E;&#x662F;&#x5BF9;&#x8C61;&#x548C;&#x548C;&#x5B57;&#x5178;&#xFF08;&#x751A;&#x81F3;&#x6570;&#x7EC4;&#xFF09;&#x90FD;&#x6DF7;&#x5230;&#x4E86;&#x4E00;&#x8D77;&#x3002;&#x5373;&#x4F7F;&#x5BF9;&#x8C61;&#x53EA;&#x5904;&#x7406;&#x201C;&#x6210;&#x5458;&#x540D;&#x5B57;&#x201D;&#xFF0C;&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x7684;&#x5BF9;&#x8C61;&#x4E5F;&#x7ED9;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5E26;&#x6765;&#x6781;&#x5927;&#x56F0;&#x96BE;&#xFF0C;&#x8FD9;&#x53EF;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x597D;&#x4E8B;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x575A;&#x6301;&#x4F7F;&#x7528;&#x201C;&#x4F20;&#x7EDF;&#x7684;&#x201D;&#x5BF9;&#x8C61;&#xFF0C;&#x6210;&#x5458;&#x56FA;&#x5B9A;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x8BA9;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x53EA;&#x80FD;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF08;&#x5BF9;&#x5E94;&#x4E8E;&#x5DE6;&#x4E0A;&#x89D2;&#x90A3;&#x79CD;&#xFF09;&#x3002;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x53D1;&#x73B0;&#x4ECD;&#x6709;&#x5F88;&#x591A;&#x5F85;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h2 id="103-&#x8FD8;&#x6709;&#x70B9;&#x5565;&#xFF08;else&#x4E2D;&#x653E;&#x4EC0;&#x4E48;&#xFF09;&#xFF1F;">10.3 &#x8FD8;&#x6709;&#x70B9;&#x5565;&#xFF08;else&#x4E2D;&#x653E;&#x4EC0;&#x4E48;&#xFF09;&#xFF1F;</h2>
<p>&#x622A;&#x81F3;&#x76EE;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;<code>case</code>&#x8868;&#x8FBE;&#x5F0F;&#x5E76;&#x4E0D;&#x5305;&#x542B;<code>else</code>&#x5B50;&#x53E5;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x65B9;&#x4FBF;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x6210;&#x5458;&#xFF08;&#x53CA;&#x6210;&#x5458;&#x6570;&#x91CF;&#xFF09;&#x53EF;&#x53D8;&#xFF1B;&#x5C3D;&#x7BA1;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x4E5F;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5047;&#x5982;&#x5BF9;&#x8C61;&#x6210;&#x5458;&#x56FA;&#x5B9A;&#xFF0C;&#x628A;&#x5BF9;&#x8C61;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5B9E;&#x73B0;&#x4E3A;&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#x4ECE;&#x6F14;&#x793A;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BB2;&#x5F88;&#x5408;&#x7406;&#xFF08;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;<strong>&#x5F3A;&#x8C03;</strong>&#x4E86;&#x6210;&#x5458;&#x540D;&#x79F0;&#x56FA;&#x5B9A;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x800C;&#x54C8;&#x5E0C;&#x8868;&#x5B9E;&#x73B0;&#x5C31;&#x5C06;&#x8FD9;&#x4E00;&#x70B9;&#x4EA4;&#x7ED9;&#x4E86;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#xFF09;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x4E0A;<code>else</code>&#x5B50;&#x53E5;&#xFF1A;<strong>&#x7EE7;&#x627F;</strong>&#xFF08;inheritance&#xFF09;&#x3002;&#x5B83;&#x6307;&#x7684;&#x662F;&#xFF0C;&#x5C06;&#x63A7;&#x5236;&#x201C;&#x94FE;&#x5F0F;&#x5730;&#x201D;&#x4EA4;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x7236;&#x5BF9;&#x8C61;</strong>&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x4ECE;&#x524D;&#x6587;&#x4E2D;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x5F00;&#x59CB;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x7ED9;&#x5BF9;&#x8C61;&#x201C;&#x67D0;&#x79CD;&#x4E1C;&#x897F;&#x201D;&#xFF0C;&#x5F53;&#x9047;&#x5230;&#x5176;&#x8BC6;&#x522B;&#x4E0D;&#x4E86;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x59D4;&#x6258;&#x5B83;&#x5B9E;&#x73B0;&#x3002;&#x201C;&#x67D0;&#x79CD;&#x4E1C;&#x897F;&#x201D;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x5C06;&#x5BFC;&#x81F4;&#x8FE5;&#x5F02;&#x7684;&#x8BBE;&#x8BA1;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</p>
<pre><code class="lang-Racket">(case m
  ...
  [else (parent-object m)])
</code></pre>
<p>&#x57FA;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7236;&#x5BF9;&#x8C61;&#x4E2D;&#x641C;&#x7D22;&#x5F53;&#x524D;&#x5BF9;&#x8C61;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x5E76;&#x4E14;&#x9012;&#x5F52;&#x7684;&#x641C;&#x7D20;&#x7236;&#x5BF9;&#x8C61;&#x7684;&#x7236;&#x5BF9;&#x8C61;&#xFF09;&#x3002;&#x5982;&#x679C;&#x627E;&#x5230;&#x4E0E;&#x540D;&#x79F0;&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x65B9;&#x6CD5;&#x5C31;&#x4F1A;&#x94FE;&#x5F0F;&#x7684;&#x8FD4;&#x56DE;&#x6700;&#x521D;&#x7684;<code>msg</code>&#x8C03;&#x7528;&#x3002;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x62A5;&#x9519;&#x201C;&#x672A;&#x627E;&#x5230;&#x6D88;&#x606F;&#x201D;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x6CE8;&#x610F;&#x5230;&#x8C03;&#x7528;<code>(parent-object m)</code>&#x5C31;&#x50CF;&#x201C;&#x534A;&#x4E2A;<code>msg</code>&#x201D;&#x4E00;&#x6837;&#xFF0C;&#x548C;&#x5DE6;&#x503C;&#x662F;&#x201C;&#x534A;&#x4E2A;&#x67E5;&#x627E;&#x201D;&#x7C7B;&#x4F3C;&#x3002;&#x4E24;&#x8005;&#x6709;&#x4EC0;&#x4E48;&#x8054;&#x7CFB;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x8BD5;&#x8BD5;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x6269;&#x5C55;&#x6211;&#x4EEC;&#x7684;&#x6811;&#x5B9E;&#x73B0;&#x53E6;&#x4E00;&#x65B9;&#x6CD5;<code>size</code>&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x7ED9;&#x5BF9;&#x8C61;<code>node</code>&#x548C;<code>mt</code>&#x5206;&#x522B;&#x5B9E;&#x73B0;&#x201C;&#x6269;&#x5C55;&#x201D;&#xFF08;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x53EB;&#x5B83;&#x201C;&#x5B50;&#x7C7B;&#x201D;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x8BF7;&#x5148;&#x5FCD;&#x4F4F;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x524D;&#x8FF0;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x4E0D;&#x4F1A;&#x5BF9;&#x73B0;&#x6709;&#x7684;&#x5B9A;&#x4E49;&#x505A;&#x4EFB;&#x4F55;&#x7F16;&#x8F91;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x5BF9;&#x8C61;&#x7EE7;&#x627F;&#x7684;&#x610F;&#x4E49;&#x6240;&#x5728;&#xFF1A;&#x4EE5;&#x9ED1;&#x76D2;&#x7684;&#x5F62;&#x5F0F;&#x91CD;&#x7528;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5F7C;&#x6B64;&#x4E0D;&#x8BA4;&#x8BC6;&#x7684;&#x5404;&#x65B9;&#x53EF;&#x4EE5;&#x5404;&#x81EA;&#x6269;&#x5C55;&#x76F8;&#x540C;&#x7684;&#x57FA;&#x672C;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x7F16;&#x8F91;&#x57FA;&#x672C;&#x4EE3;&#x7801;&#xFF0C;&#x9996;&#x5148;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x5BF9;&#x65B9;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x6B64;&#x5916;&#xFF0C;&#x67D0;&#x4E00;&#x65B9;&#x53EF;&#x80FD;&#x4E0D;&#x559C;&#x6B22;&#x53E6;&#x4E00;&#x65B9;&#x505A;&#x7684;&#x7F16;&#x8F91;&#x3002;&#x7EE7;&#x627F;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x907F;&#x5F00;&#x8FD9;&#x79CD;&#x9EBB;&#x70E6;&#x3002;</p>
</blockquote>
<h3 id="1031-&#x7C7B;">10.3.1 &#x7C7B;</h3>
<p>&#x6211;&#x4EEC;&#x7ACB;&#x523B;&#x5C31;&#x9047;&#x5230;&#x4E86;&#x96BE;&#x9898;&#x3002;&#x6784;&#x9020;&#x5668;&#x7684;&#x6A21;&#x5F0F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x5417;&#xFF1F;</p>
<pre><code class="lang-Racket">(define (node/size parent-object v l r)
  ...)
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x8868;&#x660E;&#xFF0C;&#x7236;&#x5BF9;&#x8C61;&#x548C;&#x5BF9;&#x8C61;&#x6784;&#x9020;&#x5668;&#x7684;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x5904;&#x4E8E;&#x201C;&#x540C;&#x4E00;&#x7EA7;&#x522B;&#x201D;&#x3002;&#x8FD9;&#x770B;&#x4E0A;&#x53BB;&#x5F88;&#x5408;&#x7406;&#xFF0C;&#x53EA;&#x8981;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x90FD;&#x7ED9;&#x5B9A;&#x4E86;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x4E5F;&#x5C31;&#x88AB;&#x201C;&#x5B8C;&#x5168;&#x5B9A;&#x4E49;&#x201D;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x8FD8;&#x6709;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (node v l r)
  ...)
</code></pre>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x628A;&#x6240;&#x6709;&#x7684;&#x53C2;&#x6570;&#x5199;&#x4E24;&#x904D;&#x5417;&#xFF1F;&#xFF08;&#x5F53;&#x6709;&#x4EC0;&#x4E48;&#x76F8;&#x540C;&#x7684;&#x4E1C;&#x897F;&#x9700;&#x8981;&#x5199;&#x4E24;&#x6B21;&#xFF0C;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x5565;&#x5730;&#x65B9;&#x6CA1;&#x6709;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x56E0;&#x6B64;&#x5F15;&#x5165;&#x4E86;&#x5FAE;&#x5999;&#x7684;&#x9519;&#x8BEF;&#x3002;&#xFF09;&#x4EE5;&#x4E0B;&#x662F;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#xFF1A;<strong><code>node/size</code>&#x53EF;&#x4EE5;&#x6784;&#x9020;&#x5176;&#x7236;&#x5BF9;&#x8C61;&#x7684;&#x5B9E;&#x4F8B;</strong>&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F20;&#x7ED9;<code>node/size</code>&#x6307;&#x660E;&#x7236;&#x5BF9;&#x8C61;&#x7684;&#x53C2;&#x6570;&#x4E0D;&#x662F;&#x7236;<strong>&#x5BF9;&#x8C61;</strong>&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x662F;&#x7236;&#x5BF9;&#x8C61;&#x7684;<strong>&#x6784;&#x9020;&#x51FD;&#x6570;</strong>&#xFF1A;</p>
<pre><code class="lang-Racket">(define (node/size parent-maker v l r)
  (let ([parent-object (parent-maker v l r)]
        [self &apos;dummy])
    (begin
      (set! self
            (lambda (m)
              (case m
                [(size) (lambda () (+ 1
                                     (msg l &apos;size)
                                     (msg r &apos;size)))]
                [else (parent-object m)])))
      self)))

(define (mt/size parent-maker)
  (let ([parent-object (parent-maker)]
        [self &apos;dummy])
    (begin
      (set! self
            (lambda (m)
              (case m
                [(size) (lambda () 0)]
                [else (parent-object m)])))
      self)))
</code></pre>
<p>&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x5BF9;&#x8C61;&#x6784;&#x9020;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x8BB0;&#x5F97;&#x4F20;&#x5165;&#x7236;&#x5BF9;&#x8C61;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define a-tree/size
  (node/size node
             10
             (node/size node 5 (mt/size mt) (mt/size mt))
             (node/size node 15
                        (node/size node 6 (mt/size mt) (mt/size mt))
                        (mt/size mt))))
</code></pre>
<p>&#x663E;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5408;&#x9002;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;&#x7B80;&#x5316;&#x4E0A;&#x9762;&#x8FD9;&#x4E00;&#x5806;&#x4E1C;&#x897F;&#x3002;&#x5199;&#x4E24;&#x4E2A;&#x6D4B;&#x8BD5;&#x6765;&#x786E;&#x4FDD;&#x539F;&#x529F;&#x80FD;&#x548C;&#x65B0;&#x52A0;&#x529F;&#x80FD;&#x90FD;&#x6B63;&#x786E;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (msg a-tree/size &apos;add) (+ 10 5 15 6))
(test (msg a-tree/size &apos;size) 4)
</code></pre>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x628A;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6539;&#x5199;&#x6210;self&#x8C03;&#x7528;&#x6A21;&#x5F0F;&#x7684;&#xFF0C;&#x4E0D;&#x4F7F;&#x7528;&#x8D4B;&#x503C;&#xFF08;&#x7B2C;10.1.8.2&#x8282;&#xFF09;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#x5C55;&#x793A;&#x7684;&#x5C31;&#x662F;<strong>&#x7C7B;</strong>&#xFF08;class&#xFF09;&#x7684;&#x7CBE;&#x9AD3;&#x3002;&#x7ED9;&#x51FD;&#x6570;&#x52A0;&#x4E0A;&#x7236;&#x53C2;&#x6570;&#x540E;&#x5B83;&#x5C31;&#x662F;&#x2026;&#x2026;&#x597D;&#x5427;&#xFF0C;&#x771F;&#x7684;&#x6709;&#x70B9;&#x68D8;&#x624B;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x79F0;&#x4E3A;<strong>blob&#xFF08;&#x96BE;&#x4EE5;&#x540D;&#x72B6;&#x7684;&#x4E00;&#x56E2;&#xFF09;</strong>&#x3002;blob&#x5BF9;&#x5E94;&#x4E8E;Java&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x7F16;&#x5199;&#x7C7B;&#x65F6;&#x5B9A;&#x4E49;&#x7684;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">NodeSize</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Node</span> </span>{ ... }
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x628A;&#x5B83;&#x53EB;&#x505A;&#x201C;&#x7C7B;&#x201D;&#x5462;&#xFF1F;</p>
</blockquote>
<p>&#x5F53;&#x7A0B;&#x5E8F;&#x5458;&#x8C03;&#x7528;Java&#x7684;&#x7C7B;&#x6784;&#x9020;&#x5668;&#x65F6;&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x6784;&#x9020;&#x4E86;&#x7EE7;&#x627F;&#x94FE;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x6B64;&#x4F18;&#x5316;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x6784;&#x9020;&#x5668;&#x8C03;&#x7528;&#x548C;&#x4E00;&#x6B21;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x7236;&#x7C7B;&#x90FD;&#x4F1A;&#x5BF9;&#x5E94;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x79C1;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x5BF9;&#x4E8E;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x6765;&#x8BF4;&#x662F;&#x79C1;&#x6709;&#x7684;&#xFF09;&#x3002;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x4E2D;&#x6709;&#x591A;&#x5C11;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;Java&#x7684;&#x9009;&#x62E9;&#x548C;&#x6211;&#x4EEC;&#x4E0A;&#x8FF0;&#x7684;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#xFF0C;&#x662F;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x7ED9;&#x5B9A;&#x540D;&#x5B57;&#xFF08;&#x548C;&#x7B7E;&#x540D;&#xFF09;&#x7684;&#x65B9;&#x6CD5;&#x53EA;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#xFF0C;&#x4E0D;&#x7BA1;&#x8BE5;&#x65B9;&#x6CD5;&#x5728;&#x7EE7;&#x627F;&#x94FE;&#x4E0A;&#x88AB;&#x5B9E;&#x73B0;&#x4E86;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x800C;&#x6240;&#x6709;&#x7684;&#x5B57;&#x6BB5;&#x90FD;&#x88AB;&#x4FDD;&#x7559;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F3A;&#x5236;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x53BB;&#x8BBF;&#x95EE;&#x3002;&#x540E;&#x8005;&#x7EC6;&#x60F3;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x5B57;&#x6BB5;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x57FA;&#x4E8E;&#x5B83;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x5F7C;&#x6B64;&#x5206;&#x79BB;&#xFF08;&#x56E0;&#x6B64;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x90FD;&#x5B58;&#x5728;&#xFF09;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x51FA;&#x6765;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x4F7F;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x53EF;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x662F;&#x7EE7;&#x627F;&#x5C42;&#x6B21;&#x4E2D;&#x6700;&#x4F4E;&#xFF08;&#x5373;&#x6700;&#x7CBE;&#x70BC;&#xFF09;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5F88;&#x591A;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x524D;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x72AF;&#x4E86;&#x4E00;&#x4E2A;&#x672C;&#x8D28;&#x9519;&#x8BEF;&#x3002;<code>self</code>&#x5F15;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;<strong>&#x8BED;&#x6CD5;&#x4E0A;&#x7684;</strong>&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x5B83;&#x9700;&#x8981;&#x5F15;&#x7528;&#x7684;&#x662F;&#x6700;&#x7CBE;&#x70BC;&#xFF08;&#x7EE7;&#x627F;&#x5C42;&#x6B21;&#x4E2D;&#x6700;&#x4F4E;&#xFF09;&#x7684;&#x5BF9;&#x8C61;&#xFF1A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5F00;&#x653E;&#x5F0F;&#x9012;&#x5F52;</strong>&#xFF08;open recursion&#xFF09;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x4FEE;&#x6539;&#x5BF9;&#x8C61;&#x7684;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x4F7F;&#x5F97;<code>self</code>&#x603B;&#x662F;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x6700;&#x7CBE;&#x70BC;&#x7684;&#x7248;&#x672C;&#x3002;&#x63D0;&#x793A;&#xFF1A;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;self&#x8C03;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#xFF08;<a href="#10182-&#x4E0D;&#x7528;&#x8D4B;&#x503C;&#x5B9E;&#x73B0;&#x81EA;&#x5F15;&#x7528;">10.1.8.2&#x8282;</a>&#xFF09;&#x66F4;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x8FD9;&#x5C55;&#x793A;&#x4E86;&#x4ECE;&#x4F20;&#x7EDF;&#x5BF9;&#x8C61;&#x83B7;&#x5F97;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x5F62;&#x5F0F;&#xFF1A;<strong>&#x53EF;&#x6269;&#x5C55;&#x9012;&#x5F52;</strong>&#xFF08;extensible recursion&#xFF09;&#x3002;</p>
</blockquote>
<h3 id="1032-&#x539F;&#x578B;">10.3.2 &#x539F;&#x578B;</h3>
<p>&#x5728;&#x524D;&#x6587;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x6BCF;&#x4E2A;&#x7C7B;&#x63D0;&#x4F9B;&#x4E86;&#x5176;&#x7236;<strong>&#x7C7B;</strong>&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x6784;&#x9020;&#x5BF9;&#x8C61;&#x65F6;&#x5C06;&#x6CBF;&#x7740;&#x7EE7;&#x627F;&#x94FE;&#x521B;&#x5EFA;&#x6BCF;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x5173;&#x4E8E;&#x7236;&#x4EE3;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x60F3;&#x6CD5;&#xFF1A;&#x5B83;&#x4E0D;&#x662F;&#x9700;&#x8981;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x7C7B;&#xFF0C;&#x800C;&#x5C31;&#x662F;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x3002;&#x8FD9;&#x6837;&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7236;&#x4EE3;&#x7684;&#x5B50;&#x4EE3;&#x90FD;&#x4F1A;&#x770B;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4ECE;&#x67D0;&#x4E2A;&#x5B50;&#x5BF9;&#x8C61;&#x4E2D;&#x4FEE;&#x6539;&#x8BE5;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x5C06;&#x5BF9;&#x5176;&#x5B83;&#x5B50;&#x5BF9;&#x8C61;&#x53EF;&#x89C1;&#x3002;&#x8BE5;&#x5171;&#x6709;&#x5BF9;&#x8C61;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x539F;&#x578B;&#xFF08;prototype&#xFF09;</strong>&#x3002;</p>
<blockquote>
<p>&#x4EE3;&#x8868;&#x6027;&#x7684;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x662F;<a href="http://selflanguage.org/" target="_blank">Self</a>&#x3002;&#x867D;&#x7136;&#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x8FC7;JavaScript&#x662F;&#x201C;&#x57FA;&#x4E8E;&#x201D;Self&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x5176;&#x6E90;&#x5934;&#x6765;&#x7814;&#x7A76;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x800C;&#x4E14;Self&#x5C55;&#x793A;&#x4E86;&#x539F;&#x578B;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x6700;&#x7EAF;&#x7CB9;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
</blockquote>
<p>&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x8005;&#x8BA4;&#x4E3A;&#x539F;&#x578B;&#x6BD4;&#x7C7B;&#x66F4;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x56E0;&#x4E3A;&#x539F;&#x578B;&#xFF08;&#x5916;&#x52A0;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x57FA;&#x672C;&#x673A;&#x5236;&#xFF0C;&#x6BD4;&#x5982;&#x51FD;&#x6570;&#xFF09;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7C7B;&#x2014;&#x2014;&#x4F46;&#x662F;&#x53CD;&#x4E4B;&#x5219;&#x4E0D;&#x884C;&#x3002;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#xFF1A;&#x6BCF;&#x4E2A;&#x201C;&#x7C7B;&#x201D;&#x51FD;&#x6570;&#x4E2D;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x6240;&#x4EE5;&#x7C7B;&#x5C31;&#x662F;&#x8FD4;&#x56DE;&#x5BF9;&#x8C61;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8FD9;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x63A5;&#x7EE7;&#x627F;&#x5BF9;&#x8C61;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F97;&#x5230;&#x7C7B;&#x4F3C;&#x539F;&#x578B;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x4FEE;&#x6539;&#x7EE7;&#x627F;&#x6A21;&#x5F0F;&#xFF0C;&#x5B9E;&#x73B0;&#x7C7B;&#x4F3C;Self&#x7684;&#x3001;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x57FA;&#x4E8E;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x56E0;&#x4E3A;&#x7C7B;&#x4E3A;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x5176;&#x7236;&#x5BF9;&#x8C61;&#x7684;&#x4E0D;&#x540C;&#x62F7;&#x8D1D;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;<strong>&#x514B;&#x9686;</strong>&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x7B80;&#x5316;&#x5728;&#x539F;&#x578B;&#x4E0A;&#x6A21;&#x62DF;&#x7C7B;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
</blockquote>
<h3 id="1033-&#x591A;&#x91CD;&#x7EE7;&#x627F;">10.3.3 &#x591A;&#x91CD;&#x7EE7;&#x627F;</h3>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x5230;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF08;&#x65B9;&#x6CD5;&#x5728;&#x672C;&#x5BF9;&#x8C61;&#x4E2D;&#x627E;&#x4E0D;&#x5230;&#x65F6;&#xFF09;&#x53EA;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x9009;&#x9879;&#x5462;&#xFF1F;&#x5F88;&#x5BB9;&#x6613;&#x628A;&#x8FD9;&#x4E2A;&#x63A8;&#x5E7F;&#x5230;&#x591A;&#x4E2A;&#x9009;&#x9879;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x4E5F;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x5BFC;&#x51FA;<strong>&#x591A;&#x91CD;&#x7EE7;&#x627F;</strong>&#xFF08;multiple inheritance&#xFF09;&#x3002;&#x6709;&#x591A;&#x4E2A;&#x7236;&#x8F88;&#x4E4B;&#x540E;&#x5F88;&#x663E;&#x7136;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x67E5;&#x627E;&#x65B9;&#x6CD5;&#x65F6;&#x6309;&#x7167;&#x4F55;&#x79CD;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x3002;&#x7EE7;&#x627F;&#x5173;&#x7CFB;&#x7EC4;&#x7EC7;&#x6210;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x6743;&#x5A01;&#x7684;&#x987A;&#x5E8F;&#x53EF;&#x4F9B;&#x4F7F;&#x7528;&#xFF1A;&#x6BD4;&#x5982;&#x662F;&#x6DF1;&#x5EA6;&#x4F18;&#x5148;&#x5462;&#x8FD8;&#x662F;&#x5E7F;&#x5EA6;&#x4F18;&#x5148;&#x5462;&#xFF08;&#x4E24;&#x79CD;&#x505A;&#x6CD5;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x8BBA;&#x636E;&#x652F;&#x6301;&#xFF09;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x4F8B;&#x5982;blob A&#x6269;&#x5C55;&#x81EA;B&#x548C;C&#xFF1B;&#x800C;B&#x548C;C&#x90FD;&#x6269;&#x5C55;&#x81EA;D&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF1A;A&#x7684;&#x5B9E;&#x4F8B;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x8FD8;&#x662F;&#x4E24;&#x4E2A;D&#x5BF9;&#x8C61;&#x5462;&#xFF1F;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x65E2;&#x8282;&#x7701;&#x7A7A;&#x95F4;&#x4E14;&#x884C;&#x4E3A;&#x53EF;&#x80FD;&#x66F4;&#x7B26;&#x5408;&#x671F;&#x671B;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x8BBF;&#x95EE;&#x8BE5;&#x5BF9;&#x8C61;&#x65F6;&#x662F;&#x8BBF;&#x95EE;&#x4E00;&#x6B21;&#x8FD8;&#x662F;&#x4E24;&#x6B21;&#x5462;&#xFF1F;&#x4E24;&#x6B21;&#x8BBF;&#x95EE;&#x4E4B;&#x95F4;&#x5E94;&#x8BE5;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x6240;&#x4EE5;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x3002;&#x4F46;&#x4E00;&#x6B21;&#x8BBF;&#x95EE;&#x610F;&#x5473;&#x7740;B&#x6216;C&#x4E4B;&#x4E00;&#x7684;&#x884C;&#x4E3A;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x3002;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x51E0;&#x4E4E;&#x6BCF;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x7684;&#x8BED;&#x8A00;&#x90FD;&#x4F34;&#x968F;&#x7740;&#x4E00;&#x4E2A;&#x5FAE;&#x5999;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5B9A;&#x4E49;&#x67E5;&#x627E;&#x7684;&#x987A;&#x5E8F;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x5C31;&#x662F;&#x81ED;&#x540D;&#x662D;&#x8457;&#x7684;<strong>&#x83F1;&#x5F62;&#x7EE7;&#x627F;</strong>&#xFF08;diamond inheritance&#xFF09;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9009;&#x62E9;&#x5728;&#x8BED;&#x8A00;&#x4E2D;&#x5305;&#x542B;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#xFF0C;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6D89;&#x53CA;&#x7684;&#x8BBE;&#x8BA1;&#x6289;&#x62E9;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F60;&#x7EA0;&#x7ED3;&#x597D;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x4F60;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x627E;&#x5230;&#x89C4;&#x8303;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x7684;&#x75DB;&#x82E6;&#x624D;&#x521A;&#x521A;&#x5F00;&#x59CB;&#x3002;&#x3002;</p>
</blockquote>
<p>&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x53EA;&#x6709;&#x5728;&#x4F60;&#x601D;&#x8003;&#x4E4B;&#x524D;&#x624D;&#x6709;&#x5438;&#x5F15;&#x529B;&#x3002;</p>
<h3 id="1034-&#xFF08;&#x9AD8;&#x8D85;&#x7684;&#xFF09;super">10.3.4 &#xFF08;&#x9AD8;&#x8D85;&#x7684;&#xFF09;Super</h3>
<p>&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x4E2D;&#x652F;&#x6301;super&#x8C03;&#x7528;&#xFF0C;&#x5373;&#x8C03;&#x7528;&#x7EE7;&#x627F;&#x94FE;&#x4E0A;&#x4E00;&#x5C42;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x8BBF;&#x95EE;&#x4E0A;&#x4E00;&#x5C42;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x5305;&#x62EC;&#x5728;&#x5BF9;&#x8C61;&#x6784;&#x9020;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#x901A;&#x5E38;&#x9700;&#x8981;&#x8C03;&#x7528;&#x6240;&#x6709;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5BF9;&#x8C61;&#x88AB;&#x6B63;&#x786E;&#x5B9A;&#x4E49;&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x662F;&#x201C;&#x94FE;&#x201D;&#x3002;&#x5728;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x8981;&#x590D;&#x6742;&#x7684;&#x591A;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5BF9;&#x5411;&#x201C;&#x4E0A;&#x201D;&#x8C03;&#x7528;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#xFF0C;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x5FD8;&#x4E86;&#x95EE;&#x8FD9;&#x662F;&#x5426;&#x662F;&#x6700;&#x81EA;&#x7136;&#x7684;&#x65B9;&#x5411;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x6784;&#x9020;&#x5668;&#x548C;&#x65B9;&#x6CD5;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x7EF4;&#x62A4;<strong>&#x4E0D;&#x53D8;&#x91CF;</strong>&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x66F4;&#x4FE1;&#x4EFB;&#x8C01;&#xFF0C;&#x8D85;&#x7C7B;&#x8FD8;&#x662F;&#x5B50;&#x7C7B;&#xFF1F;&#x6709;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x5B50;&#x7C7B;&#x66F4;&#x4E3A;&#x7CBE;&#x70BC;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x62E5;&#x6709;&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x6700;&#x5168;&#x9762;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x4F46;&#x53CD;&#x8FC7;&#x6765;&#x8BF4;&#xFF0C;&#x8D85;&#x7C7B;&#x5FC5;&#x987B;&#x4FDD;&#x62A4;&#x5176;&#x4E0D;&#x53D8;&#x91CF;&#x4E0D;&#x53D7;&#x65E0;&#x77E5;&#x7684;&#x5B50;&#x7C7B;&#x80E1;&#x4E71;&#x7BE1;&#x6539;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x5173;&#x4E8E;&#x7EE7;&#x627F;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x7684;&#x4E24;&#x79CD;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x8BA4;&#x77E5;&#x3002;&#x5411;&#x4E0A;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x6269;&#x5C55;&#x662F;&#x8981;<strong>&#x66FF;&#x4EE3;</strong>&#x8D85;&#x7C7B;&#x3002;&#x5411;&#x4E0B;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x6269;&#x5C55;&#x662F;<strong>&#x6539;&#x5584;</strong>&#x7236;&#x4EE3;&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x5C06;&#x5B50;&#x7C7B;&#x7EE7;&#x627F;&#x89C6;&#x4E3A;&#x540E;&#x8005;&#xFF08;&#x6539;&#x5584;&#x548C;&#x7CBE;&#x70BC;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5374;&#x9009;&#x62E9;&#x4E86;&#x201C;&#x9519;&#x8BEF;&#x7684;&#x201D;&#x65B9;&#x5411;&#x5462;&#xFF1F;&#x56E0;&#x6B64;&#xFF0C;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x63A2;&#x7D22;&#x4E86;&#x9ED8;&#x8BA4;&#x5411;&#x4E0B;&#x8C03;&#x7528;&#x3002;</p>
<blockquote>
<p><a href="http://www.daimi.au.dk/~eernst/gbeta/" target="_blank">gbeta</a>&#x662F;&#x4E00;&#x95E8;&#x7531;&#x4F17;&#x591A;&#x6709;&#x8DA3;&#x7279;&#x6027;&#x7684;&#x73B0;&#x4EE3;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x652F;&#x6301; inner&#xFF08;&#x5373;&#x5411;&#x4E0B;&#x8C03;&#x7528;&#xFF09;&#x3002;&#x8003;&#x8651;&#x7ED3;&#x5408;&#x8FD9;<a href="http://www.cs.utah.edu/plt/publications/oopsla04-gff.pdf" target="_blank">&#x4E24;&#x4E2A;&#x65B9;&#x5411;</a>&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x7684;&#x3002;</p>
</blockquote>
<h3 id="1035-mixin&#x548C;trait">10.3.5 Mixin&#x548C;Trait</h3>
<p>&#x56DE;&#x8FC7;&#x5934;&#x8BA8;&#x8BBA;&#x6211;&#x4EEC;&#x7684;&#x201C;blob&#x201D;&#x3002;</p>
<p>&#x5728;Java&#x4E2D;&#x5F53;&#x6211;&#x4EEC;&#x5199;&#x4E0B;&#x4E00;&#x4E2A;&#x201C;&#x7C7B;&#x201D;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x5BF9;&#x5927;&#x62EC;&#x53F7;&#x4E2D;&#x4E8B;&#x5B9E;&#x4E0A;&#x662F;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x5462;&#xFF1F;&#x5B83;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x7C7B;&#xFF1A;&#x5B8C;&#x6574;&#x7684;&#x7C7B;&#x53D6;&#x51B3;&#x7236;&#x7C7B;&#xFF0C;&#x90A3;&#x53C8;&#x9012;&#x5F52;&#x7684;&#x53D6;&#x51B3;&#x4E8E;&#x5B83;&#x7684;&#x7236;&#x7C7B;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x5927;&#x62EC;&#x53F7;&#x5185;&#x5B9A;&#x4E49;&#x7684;&#x662F;<strong>&#x7C7B;&#x7684;&#x6269;&#x5C55;</strong>&#x3002;&#x4EC5;&#x5F53;&#x5728;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x4E2D;<strong>&#x52A0;&#x5165;</strong>&#x7236;&#x7C7B;&#x540E;&#xFF0C;&#x5B83;&#x624D;&#x662F;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7C7B;&#x3002;</p>
<p>&#x81EA;&#x7136;&#x6211;&#x4EEC;&#x8981;&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x628A;<strong>&#x6269;&#x5C55;&#x7684;&#x5B9A;&#x4E49;</strong>&#x548C;<strong>&#x5C06;&#x6269;&#x5C55;&#x5E94;&#x7528;&#x4E8E;&#x57FA;&#x7C7B;</strong>&#x8FD9;&#x4E24;&#x4E2A;&#x884C;&#x4E3A;&#x5206;&#x5F00;&#x5462;&#xFF1F;&#x5373;&#xFF0C;&#x5C06;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">C</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">B</span> </span>{ ... }
</code></pre>
<p>&#x5206;&#x5272;&#x6210;&#xFF1A;</p>
<pre><code class="lang-java">classext E { ... }
</code></pre>
<p>&#x548C;</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">C</span> </span>= E(B)
</code></pre>
<p>&#x5176;&#x4E2D;<code>B</code>&#x662F;&#x67D0;&#x4E2A;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x7C7B;&#x3002;</p>
<p>&#x770B;&#x4E0A;&#x53BB;&#x8FD9;&#x6837;&#x597D;&#x50CF;&#x53EA;&#x662F;&#x7528;&#x66F4;&#x957F;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x4E00;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x7C7B;&#x4F3C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x8BED;&#x6CD5;&#x4E0D;&#x7981;&#x8BA9;&#x6211;&#x4EEC;&#x6D6E;&#x60F3;&#x8054;&#x7FE9;&#xFF1A;&#x53EF;&#x4EE5;&#x5C06;&#x67D0;&#x4E2A;&#x6269;&#x5C55;&#x201C;&#x5E94;&#x7528;&#x201D;&#x4E8E;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x7C7B;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">C1</span> </span>= E(B1);
<span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">C2</span> </span>= E(B2);
<span class="hljs-comment">// ...</span>
</code></pre>
<p>&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x3002;&#x901A;&#x8FC7;&#x5C06;E&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x5176;&#x6269;&#x5C55;&#x7684;&#x7C7B;&#x5206;&#x79BB;&#x5F00;&#xFF0C;&#x6211;&#x4EEC;<strong>&#x5C06;&#x6269;&#x5C55;&#x4ECE;&#x56FA;&#x5B9A;&#x57FA;&#x7C7B;&#x7684;&#x66B4;&#x653F;&#x4E2D;&#x89E3;&#x653E;&#x51FA;&#x6765;</strong>&#x3002;&#x8FD9;&#x79CD;&#x6269;&#x5C55;&#x6709;&#x4E2A;&#x540D;&#x5B57;&#xFF1A;<strong>mixin</strong>&#x3002;</p>
<blockquote>
<p>&#x201C;mixin&#x201D;&#x4E00;&#x8BCD;&#x8D77;&#x6E90;&#x4E8E;Common Lisp&#xFF0C;&#x662F;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x7684;&#x7279;&#x5B9A;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x3002;&#x9E21;&#x7A9D;&#x91CC;&#x98DE;&#x51FA;&#x91D1;&#x51E4;&#x51F0;&#x3002;</p>
</blockquote>
<p>Mixin&#x4F7F;&#x5F97;&#x7C7B;&#x5B9A;&#x4E49;&#x5177;&#x6709;&#x66F4;&#x597D;&#x7684;&#x7EC4;&#x5408;&#x6027;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x7684;&#x597D;&#x5904;&#xFF08;&#x91CD;&#x7528;&#x591A;&#x6BB5;&#x529F;&#x80FD;&#x4EE3;&#x7801;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x907F;&#x514D;&#x4E86;&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x7684;&#x9EBB;&#x70E6;&#xFF08;&#x4F8B;&#x5982;&#x6CA1;&#x6709;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x7684;&#x590D;&#x6742;&#x7684;&#x67E5;&#x8BE2;&#x987A;&#x5E8F;&#x95EE;&#x9898;&#xFF09;&#x3002;&#x91C7;&#x7528;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x65B9;&#x5F0F;&#x7684;&#x8BDD;&#xFF0C;mixin&#x8FD8;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x3002;Mixin&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x201C;&#x7C7B;&#x7684;&#x51FD;&#x6570;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x4E14;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x4E86;&#x7C7B;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x540E;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x653E;&#x5165;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x7684;mixin&#x6A21;&#x578B;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x53BB;&#x9664;&#x8BED;&#x6CD5;&#x7CD6;&#x540E;&#x7684;&#x76EE;&#x6807;&#x8BED;&#x8A00;&#x62E5;&#x6709;&#x826F;&#x597D;&#x7684;&#x901A;&#x7528;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x6620;&#x5C04;&#x56DE;&#x6E90;&#x7801;&#x8BED;&#x8A00;&#xFF0C;&#x5C31;&#x80FD;&#x83B7;&#x5F97;<strong>&#x66F4;&#x597D;&#x7684;</strong>&#x7ED3;&#x6784;&#x3002;</p>
</blockquote>
<p>&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x597D;&#x7684;mixin&#x8BBE;&#x8BA1;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x6539;&#x5584;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x5B9E;&#x8DF5;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;mixin&#x7684; Java&#x3002;&#x5982;&#x679C;mixin&#x7B49;&#x6548;&#x4E8E;&#x7C7B;&#x5230;&#x7C7B;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x201C;&#x51FD;&#x6570;&#x201D;&#x7684;&#x201C;&#x7C7B;&#x578B;&#x201D;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x663E;&#x7136;&#xFF0C;mixin&#x5E94;&#x8BE5;&#x4F7F;&#x7528;<strong>&#x63A5;&#x53E3;</strong>&#xFF08;interface&#xFF09;&#x6765;&#x63CF;&#x8FF0;&#x5176;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;Java&#x652F;&#x6301;&#x540E;&#x8005;&#xFF08;&#x4F46;&#x4E0D;&#x5F3A;&#x5236;&#x8981;&#x6C42;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x652F;&#x6301;&#x524D;&#x8005;&#xFF1A;&#x7C7B;&#xFF08;&#x7684;&#x6269;&#x5C55;&#xFF09;&#x6269;&#x5C55;&#x7684;&#x662F;&#x53E6;&#x4E00;&#x4E2A;<strong>&#x7C7B;</strong>&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x7C7B;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x6210;&#x5458;&#x5BF9;&#x6269;&#x5C55;&#x90FD;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x2014;&#x2014;&#x800C;&#x4E0D;&#x662F;&#x5176;<strong>&#x63A5;&#x53E3;</strong>&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B50;&#x7C7B;&#x83B7;&#x53D6;&#x4E86;&#x7236;&#x7C7B;&#x6240;&#x6709;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5176;&#x89C4;&#x8303;&#x3002;&#x5982;&#x679C;&#x4FEE;&#x6539;&#x7236;&#x7C7B;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5B50;&#x7C7B;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x5728;&#x652F;&#x6301;mixin&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5199;&#xFF1A;</p>
<pre><code class="lang-java">mixin M extends I { ... }
</code></pre>
<p>&#x5176;&#x4E2D;I&#x662F;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;M&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6269;&#x5C55;&#x5B9E;&#x73B0;&#x4E86;&#x63A5;&#x53E3;I&#x7684;&#x7C7B;&#xFF0C;&#x8BED;&#x8A00;&#x80FD;<strong>&#x4FDD;&#x8BC1;&#x53EA;&#x6709;I&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x6210;&#x5458;&#x5728;M&#x4E2D;&#x53EF;&#x89C1;</strong>&#x3002;&#x8FD9;&#x5C31;&#x9075;&#x5FAA;&#x4E86;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x91CD;&#x8981;&#x539F;&#x5219;&#x4E4B;&#x4E00;&#x3002;</p>
<blockquote>
<p>&#x201C;&#x9762;&#x5411;&#x63A5;&#x53E3;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9762;&#x5411;&#x5B9E;&#x73B0;&#xFF08;Program to an interface, not an implementation&#xFF09;&#x201D; &#x2014;&#x2014; &#x300A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x300B;</p>
</blockquote>
<p>&#x597D;&#x7684;mixin&#x8BBE;&#x8BA1;&#x8FD8;&#x53EF;&#x4EE5;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x3002;&#x6309;&#x7167;&#x5B9A;&#x4E49;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x5728;&#x7EE7;&#x627F;&#x94FE;&#x4E2D;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x4E00;&#x6B21;&#xFF08;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x5F15;&#x7528;&#x5B83;&#x81EA;&#x5DF1;&#xFF0C;&#x90A3;&#x4E48;&#x7EE7;&#x627F;&#x94FE;&#x4E0A;&#x52BF;&#x5FC5;&#x5B58;&#x5728;&#x73AF;&#x8DEF;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF09;&#x3002;&#x53CD;&#x4E4B;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x79CD;&#x987E;&#x8651;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;<code>(map ... (filter (map ...)))</code>&#xFF09;&#x3002;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;mixin&#x4E24;&#x6B21;&#x6709;&#x610F;&#x4E49;&#x5417;&#xFF1F;</p>
<blockquote>
<p>&#x5F53;&#x7136;&#x6709;&#xFF01;&#x8BF7;&#x53C2;&#x9605;<a href="http://www.cs.brown.edu/~sk/Publications/Papers/Published/fkf-classes-mixins/" target="_blank">Classes and Mixins</a> &#x7684;&#x7B2C;3&#x548C;&#x7B2C;4&#x8282;&#x3002;</p>
</blockquote>
<p>mixin&#x89E3;&#x51B3;&#x4E86;&#x5E93;&#x8BBE;&#x8BA1;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x5341;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x6027;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x591A;&#x5C11;&#x4E2A;&#x7C7B;&#xFF1F;&#x66F4;&#x751A;&#x4E4B;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7279;&#x6027;&#x90FD;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x7EC4;&#x5408;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x4EA7;&#x751F;&#x6240;&#x6709;&#x7EC4;&#x5408;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x4E0D;&#x73B0;&#x5B9E;&#x3002;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6848;&#x662F;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x9009;&#x62E9;&#x4ED6;&#x4EEC;&#x5173;&#x5FC3;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4E14;&#x63D0;&#x4F9B;&#x5FC5;&#x8981;&#x7684;&#x673A;&#x5236;&#x9632;&#x6B62;&#x4E0D;&#x5408;&#x7406;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x8FD9;&#x6B63;&#x662F;mixin&#x6240;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF1A;mixin&#x63D0;&#x4F9B;&#x7C7B;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x7EC4;&#x5408;&#xFF0C;&#x800C;&#x63A5;&#x53E3;&#x5FC5;&#x987B;&#x8981;&#x80FD;&#x5BF9;&#x4E0A;&#xFF0C;&#x4ECE;&#x800C;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#x7C7B;&#x3002;</p>
<blockquote>
<p>Racket&#x7684;GUI&#x5E93;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x4E86;mixin&#x3002;&#x4F8B;&#x5982;<code>color:text-mixin</code>&#x7684;&#x8F93;&#x5165;&#x662F;&#x57FA;&#x672C;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x63A5;&#x53E3;&#xFF0C;&#x8F93;&#x51FA;&#x662F;&#x5F69;&#x8272;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x63A5;&#x53E3;&#x3002;&#x540E;&#x8005;&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x672C;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x63A5;&#x53E3;&#xFF0C;&#x4E8E;&#x662F;&#x5176;&#x4ED6;&#x57FA;&#x672C;&#x6587;&#x672C;&#x76F8;&#x5173;&#x7684;mixin&#x8FD8;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5E94;&#x7528;&#x4E8E;&#x5176;&#x8F93;&#x51FA;&#x3002;</p>
</blockquote>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x4F60;&#x6700;&#x559C;&#x6B22;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x7684;&#x5E93;&#x662F;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x4E0A;&#x8FF0;&#x95EE;&#x9898;&#x7684;&#xFF1F;</p>
</blockquote>
<p>Mixin&#x4E5F;&#x6709;&#x5C40;&#x9650;&#xFF1A;&#x53EA;&#x80FD;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#x6709;&#x65F6;&#x4F1A;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x5E26;&#x6765;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x8D1F;&#x62C5;&#x3002;&#x5C06;mixin&#x6CDB;&#x5316;&#xFF0C;&#x4E0D;&#x662F;&#x53EA;&#x5BF9;&#x5355;&#x4E2A;mixin&#x6269;&#x5C55;&#xFF0C;&#x800C;&#x662F;&#x6269;&#x5C55;&#x4E00;<strong>&#x7EC4;</strong>mixin&#xFF0C;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<strong>trait</strong>&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5141;&#x8BB8;&#x6269;&#x5C55;&#x591A;&#x4E2A;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x5904;&#x7406;&#x6F5C;&#x5728;&#x7684;&#x540D;&#x5B57;&#x51B2;&#x7A81;&#x3002;&#x56E0;&#x6B64;&#x5B9E;&#x73B0;trait&#x5FC5;&#x987B;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x89E3;&#x51B3;&#x540D;&#x5B57;&#x51B2;&#x7A81;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x67D0;&#x79CD;&#x540D;&#x79F0;&#x7EC4;&#x5408;&#x4EE3;&#x6570;&#x3002;Trait&#x662F;mixin&#x7684;&#x8865;&#x5145;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x9009;&#x62E9;&#x6700;&#x6EE1;&#x8DB3;&#x5176;&#x9700;&#x6C42;&#x7684;&#x673A;&#x5236;&#x3002;Racket&#x652F;&#x6301;mixin&#x548C;trait&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap9.html" class="navigation navigation-prev " aria-label="Previous page:  9. 递归和循环：子程序与数据">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap11.html" class="navigation navigation-next " aria-label="Next page: 11. 内存管理">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"10. 对象","level":"1.11","depth":1,"next":{"title":"11. 内存管理","level":"1.12","depth":1,"path":"chap11.md","ref":"chap11.md","articles":[]},"previous":{"title":" 9. 递归和循环：子程序与数据","level":"1.10","depth":1,"path":"chap9.md","ref":"chap9.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-76420995-1"},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc; MrMathematica","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap10.md","mtime":"2018-09-28T07:36:04.696Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-28T07:36:08.800Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

