
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>16. 动态地检查程序中的不变量：契约 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lotuc; MrMathematica">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap17.html" />
    
    
    <link rel="prev" href="chap15.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                     1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                     2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                     3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                     4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                     5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                     6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                     7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                     8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                     9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="chap15.html">
            
                <a href="chap15.html">
            
                    
                    15. 静态地检查程序中的不变量：类型
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.17" data-path="chap16.html">
            
                <a href="chap16.html">
            
                    
                    16. 动态地检查程序中的不变量：契约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chap17.html">
            
                <a href="chap17.html">
            
                    
                    17. 其他调用语义
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >16. 动态地检查程序中的不变量：契约</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="16-&#x52A8;&#x6001;&#x5730;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#xFF1A;&#x5951;&#x7EA6;">16 &#x52A8;&#x6001;&#x5730;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#xFF1A;&#x5951;&#x7EA6;</h1>
<p>&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E86;&#x4E30;&#x5BCC;&#x4E14;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x8868;&#x793A;&#x7A0B;&#x5E8F;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x79CD;&#x91CD;&#x8981;&#x7684;&#x6743;&#x8861;&#xFF0C;&#x56E0;&#x4E3A;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x7684;&#x975E;&#x5E73;&#x51E1;&#x5C5E;&#x6027;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x9759;&#x6001;&#x9A8C;&#x8BC1;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x6B64;&#x5916;&#xFF0C;&#x5373;&#x4F7F;&#x67D0;&#x4E2A;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x8BBE;&#x8BA1;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#xFF0C;&#x6CE8;&#x89E3;&#x548C;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x8D1F;&#x62C5;&#x4E5F;&#x53EF;&#x80FD;&#x8FC7;&#x5927;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x5173;&#x5FC3;&#x7684;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x53EA;&#x80FD;&#x88AB;&#x5FFD;&#x7565;&#x6216;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x89E3;&#x51B3;&#x3002;&#x672C;&#x7AE0;&#x6211;&#x4EEC;&#x6765;&#x8BA8;&#x8BBA;&#x8FD0;&#x884C;&#x65F6;&#x68C0;&#x67E5;&#x4E0D;&#x53D8;&#x91CF;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x5F0F;&#x7684;&#x5B9A;&#x7406;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;<a href="https://en.wikipedia.org/wiki/Rice&apos;s_theorem" target="_blank">&#x8D56;&#x65AF;&#x5B9A;&#x7406;</a>&#x3002;</p>
</blockquote>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6BCF;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x5305;&#x542B;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x65AD;&#x8A00;&#x673A;&#x5236;&#xFF0C;&#x4F7F;&#x7A0B;&#x5E8F;&#x5458;&#x80FD;&#x591F;&#x7F16;&#x5199;&#x6BD4;&#x8BED;&#x8A00;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x5141;&#x8BB8;&#x7684;&#x66F4;&#x4E30;&#x5BCC;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x53EF;&#x80FD;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x7C7B;&#x578B;&#x65AD;&#x8A00;&#x5F00;&#x59CB;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x67D0;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x5426;&#x4E3A;&#x6570;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x65AD;&#x8A00;&#x8BED;&#x8A00;&#x901A;&#x5E38;&#x662F;&#x6574;&#x4E2A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x56E0;&#x6B64;&#x4EFB;&#x4F55;&#x8C13;&#x8BCD;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x65AD;&#x8A00;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x67D0;&#x4E2A;&#x52A0;&#x5BC6;&#x5305;&#x7684;&#x5B9E;&#x73B0;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x786E;&#x4FDD;&#x67D0;&#x4E9B;&#x53C2;&#x6570;&#x901A;&#x8FC7;&#x7D20;&#x6027;&#x6D4B;&#x8BD5;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x641C;&#x7D22;&#x6811;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x786E;&#x4FDD;&#x5176;&#x5B50;&#x6811;&#x786E;&#x5B9E;&#x662F;&#x5E73;&#x8861;&#x4E14;&#x6709;&#x5E8F;&#x7684;&#x3002;</p>
<h2 id="161-&#x4EE5;&#x5951;&#x7EA6;&#x5B9E;&#x73B0;&#x8C13;&#x8BCD;">16.1 &#x4EE5;&#x5951;&#x7EA6;&#x5B9E;&#x73B0;&#x8C13;&#x8BCD;</h2>
<p>&#x56E0;&#x6B64;&#x5F88;&#x5BB9;&#x6613;&#x60F3;&#x5230;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x7684;&#x5951;&#x7EA6;&#xFF08;contract&#xFF09;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x5951;&#x7EA6;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x8C13;&#x8BCD;&#x3002;&#x5B83;&#x8BFB;&#x5165;&#x4E00;&#x4E2A;&#x503C;&#x5E76;&#x5C06;&#x8C13;&#x8BCD;&#x5E94;&#x7528;&#x4E8E;&#x8BE5;&#x503C;&#x3002;&#x5982;&#x679C;&#x503C;&#x80FD;&#x901A;&#x8FC7;&#x8C13;&#x8BCD;&#x5224;&#x65AD;&#xFF0C;&#x5219;&#x5951;&#x7EA6;&#x539F;&#x6837;&#x8FD4;&#x56DE;&#x8BE5;&#x503C;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x8BE5;&#x5951;&#x7EA6;&#x4F1A;&#x62A5;&#x544A;&#x9519;&#x8BEF;&#x3002;&#x5176;&#x884C;&#x4E3A;&#x53EA;&#x80FD;&#x662F;&#x8FD4;&#x56DE;&#x539F;&#x503C;&#x6216;&#x62A5;&#x9519;&#xFF1A;&#x5B83;&#x4E0D;&#x5E94;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x66F4;&#x6539;&#x503C;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5BF9;&#x4E8E;&#x80FD;&#x901A;&#x8FC7;&#x8C13;&#x8BCD;&#x7684;&#x503C;&#xFF0C;&#x5951;&#x7EA6;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x3002;</p>
<blockquote>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;<code>#lang plai</code>&#x8BED;&#x8A00;&#xFF0C;&#x539F;&#x56E0;&#x6709;&#x4E24;&#x4E2A;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x8FD9;&#x66F4;&#x597D;&#x5730;&#x6A21;&#x62DF;&#x4E86;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5951;&#x7EA6;&#x5199;&#x6210;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x65AD;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x7531;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x770B;&#x5230;&#x8FD0;&#x884C;&#x65F6;&#x884C;&#x4E3A;&#x3002;&#x4ECE;&#x6548;&#x679C;&#x6765;&#x770B;&#xFF0C;&#x201C;&#x5173;&#x95ED;&#x201D;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4F1A;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x5951;&#x7EA6;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x589E;&#x5F3A;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x51FD;&#x6570;&#x7F16;&#x7801;&#x8BE5;&#x672C;&#x8D28;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (make-contract pred?)
  (lambda (val)
    (if (pred? val) val (blame &quot;violation&quot;))))

(define (blame s) (error &apos;contract &quot;~a&quot; s))
</code></pre>
<p>&#x5951;&#x7EA6;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-Racket">(define non-neg?-contract
  (make-contract
   (lambda (n) (and (number? n)
                    (&gt;= n 0)))))
</code></pre>
<p>&#xFF08;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x68C0;&#x67E5;<code>number?</code>&#x5F53;&#x7136;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F7F;&#x7528;&#x5951;&#x7EA6;&#x51FD;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x9759;&#x6001;&#x68C0;&#x67E5;&#xFF01;&#xFF09;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8981;&#x786E;&#x4FDD;&#x8BA1;&#x7B97;&#x5E73;&#x65B9;&#x6839;&#x65F6;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x865A;&#x6570;&#xFF1B;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x5199;</p>
<pre><code class="lang-Racket">(define (real-sqrt-1 x)
  (sqrt (non-neg?-contract x)))
</code></pre>
<p>&#x5728;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x65AD;&#x8A00;&#x662F;&#x5199;&#x4F5C;&#x8BED;&#x53E5;&#x800C;&#x4E0D;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x53E6;&#x4E00;&#x79CD;&#x7F16;&#x5199;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (real-sqrt-2 x)
  (begin
    (non-neg?-contract x)
    (sqrt x)))
</code></pre>
<p>&#xFF08;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5728;&#x51FD;&#x6570;&#x7684;&#x5F00;&#x59CB;&#x90E8;&#x5206;&#x6E05;&#x6670;&#x5730;&#x58F0;&#x660E;&#x4E86;&#x53C2;&#x6570;&#x7684;&#x671F;&#x671B;&#x503C;&#x3002;&#x5B83;&#x8FD8;&#x786E;&#x4FDD;&#x53C2;&#x6570;&#x53EA;&#x88AB;&#x68C0;&#x67E5;&#x4E00;&#x6B21;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5951;&#x7EA6;&#x53EF;&#x4EE5;&#x5199;&#x5165;&#x51FD;&#x6570;&#x5934;&#x90E8;&#x4E2D; &#xFF0C;&#x4ECE;&#x800C;&#x6539;&#x5584;&#x63A5;&#x53E3;&#x7ED9;&#x51FA;&#x7684;&#x4FE1;&#x606F;&#x3002;&#xFF09;&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x5C06;<code>real-sqrt-1</code>&#x6216;<code>real-sqrt-2</code>&#x5E94;&#x7528;&#x4E8E;<code>4</code>&#xFF0C;&#x5219;&#x5B83;&#x4EEC;&#x4EA7;&#x751F;<code>2</code>&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5E94;&#x7528;&#x4E8E;<code>-1</code>&#xFF0C;&#x5219;&#x4F1A;&#x5F15;&#x53D1;&#x8FDD;&#x53CD;&#x5951;&#x7EA6;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<h2 id="162-&#x6807;&#x7B7E;&#x3001;&#x7C7B;&#x578B;&#x548C;&#x5BF9;&#x503C;&#x7684;&#x89C2;&#x6D4B;">16.2 &#x6807;&#x7B7E;&#x3001;&#x7C7B;&#x578B;&#x548C;&#x5BF9;&#x503C;&#x7684;&#x89C2;&#x6D4B;</h2>
<p>&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x91CD;&#x73B0;&#x4E86;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x4E2D;&#x65AD;&#x8A00;&#x7CFB;&#x7EDF;&#x7684;&#x672C;&#x8D28;&#x3002;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x8981;&#x8BA8;&#x8BBA;&#x7684;&#xFF1F;&#x6211;&#x4EEC;&#x5148;&#x5047;&#x8BBE;&#x624B;&#x4E0A;&#x7684;&#x8BED;&#x8A00;&#x4E0D;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7F16;&#x5199;&#x7684;&#x65AD;&#x8A00;&#x81F3;&#x5C11;&#x8981;&#x80FD;&#x91CD;&#x73B0;&#x4F20;&#x7EDF;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x53D8;&#x91CF;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x3002;&#x524D;&#x8FF0;&#x7684;<code>make-contract</code>&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x6240;&#x6709;&#x6807;&#x51C6;&#x7C7B;&#x578B;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x68C0;&#x67E5;&#x6570;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x7B49;&#x7B49;&#xFF0C;&#x5047;&#x8BBE;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x5408;&#x9002;&#x7684;&#x8C13;&#x8BCD;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x4ECE;&#x5DF2;&#x6709;&#x7684;&#x8C13;&#x8BCD;&#x4E2D;&#x6784;&#x9020;&#x51FA;&#x6765;&#x3002;&#x662F;&#x8FD9;&#x6837;&#x5417;&#xFF1F;</p>
<p>&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x6700;&#x7B80;&#x5355;&#x7684;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x53EA;&#x5305;&#x542B;&#x6570;&#x7B49;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x8FD8;&#x5305;&#x542B;&#x6784;&#x9020;&#x7C7B;&#x578B;&#x3002;&#x5C3D;&#x7BA1;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#xFF0C;&#x5982;&#x94FE;&#x8868;&#x548C;&#x5411;&#x91CF;&#xFF0C;&#x4F3C;&#x4E4E;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x96BE;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x6D89;&#x53CA;&#x8D4B;&#x503C;&#x3001;&#x6027;&#x80FD;&#x548C;&#x95EE;&#x8D23;&#xFF0C;&#x6311;&#x6218;&#x5C31;&#x6765;&#x4E86;&#xFF0C;&#x540E;&#x9762;&#x5C06;&#x8BA8;&#x8BBA;&#x5B83;&#x4EEC;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x51FD;&#x6570;&#x5C31;&#x5F88;&#x96BE;&#x5904;&#x7406;&#x4E86;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x793A;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define d/dx
  (lambda (f)
    (lambda (x)
      (/ (- (f (+ x 0.001))
            (f x))
         0.001))))
</code></pre>
<p>&#x5176;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">((number -&gt; number) -&gt; (number -&gt; number))
</code></pre>
<p>&#xFF08;&#x5B83;&#x8BFB;&#x5165;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x751F;&#x6210;&#x5176;&#x5BFC;&#x6570;&#x2014;&#x2014;&#x4E5F;&#x662F;&#x4E2A;&#x51FD;&#x6570;&#x3002;&#xFF09;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x60F3;&#x7528;&#x5951;&#x7EA6;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x6839;&#x672C;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x5C06;&#x5176;&#x8868;&#x793A;&#x4E3A;&#x8C13;&#x8BCD;&#x3002;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x5173;&#x4E8E;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5B58;&#x50A8;&#x4E86;&#x975E;&#x5E38;&#x6709;&#x9650;&#x7684;&#x4FE1;&#x606F;&#x2014;&#x2014;&#x76F8;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x770B;&#x5230;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x592A;&#x8FC7;&#x6709;&#x9650;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x540D;&#x79F0;&#x6765;&#x63CF;&#x8FF0;&#x5B83;&#x4EEC;&#xFF1B;&#x4F20;&#x7EDF;&#x4E0A;&#x5B83;&#x4EEC;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6807;&#x7B7E;</strong>&#xFF08;tag&#xFF09;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6807;&#x7B7E;&#x4E0E;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x662F;&#x7C7B;&#x578B;&#x7684;&#x4E0D;&#x8C0B;&#x800C;&#x5408;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x6570;&#x4F1A;&#x5E26;&#x4E0A;&#x6807;&#x8BC6;&#x5176;&#x4E3A;&#x6570;&#x7684;&#x6807;&#x7B7E;&#xFF08;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x662F;&#x67D0;&#x79CD;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x6570;&#xFF09;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x5E26;&#x6709;&#x6807;&#x8BC6;&#x5176;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x6807;&#x7B7E;&#x7684;&#x503C;&#x6765;&#x7F16;&#x5199;&#x8C13;&#x8BCD;&#x3002;</p>
<blockquote>
<p>&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#x8BD5;&#x56FE;&#x4FDD;&#x5B58;&#x4E30;&#x5BCC;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x4ECE;&#x6E90;&#x7A0B;&#x5E8F;&#x5230;&#x8F83;&#x4F4E;&#x7684;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x3001;&#x4E00;&#x76F4;&#x5230;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x7814;&#x7A76;&#x5DE5;&#x4F5C;&#x3002;</p>
</blockquote>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x7ED3;&#x6784;&#x5316;&#x503C;&#x65F6;&#xFF0C;&#x60C5;&#x51B5;&#x5C31;&#x590D;&#x6742;&#x4E86;&#x3002;&#x5411;&#x91CF;&#x5C06;&#x4F1A;&#x5E26;&#x6709;&#x6807;&#x7B7E;&#x58F0;&#x660E;&#x5B83;&#x662F;&#x5411;&#x91CF;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x6307;&#x660E;&#x5B83;&#x7684;&#x5143;&#x7D20;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF08;&#x800C;&#x4E14;&#x5B83;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x90FD;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x7C7B;&#x578B;&#xFF09;&#xFF1B;&#x4E0D;&#x8FC7;&#xFF0C;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x4E5F;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x5411;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4ECE;&#x800C;&#x904D;&#x5386;&#x5411;&#x91CF;&#x6765;&#x6536;&#x96C6;&#x6B64;&#x4FE1;&#x606F;&#x3002;&#xFF08;&#x7136;&#x800C;&#xFF0C;&#x5173;&#x4E8E;&#x7ED3;&#x6784;&#x5316;&#x503C;&#x540E;&#x9762;&#x8FD8;&#x66F4;&#x591A;&#x6709;&#x5F85;&#x8BA8;&#x8BBA;&#x7684;&#x3002;&#xFF09;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x7F16;&#x5199;&#x5951;&#x7EA6;&#xFF0C;&#x68C0;&#x67E5;&#x53EA;&#x5305;&#x542B;&#x5076;&#x6570;&#x7684;&#x94FE;&#x8868;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x5C31;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define list-of-even?-contract
  (make-contract
   (lambda (l)
     (and (list? l) (andmap number? l) (andmap even? l)))))
</code></pre>
<p>&#xFF08;&#x540C;&#x6837;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9759;&#x6001;&#x5730;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x6570;&#x7684;&#x94FE;&#x8868;&#xFF0C;&#x5219;&#x65E0;&#x9700;&#x95EE;&#x524D;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#xFF09;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x53EA;&#x5C06;&#x81EA;&#x5DF1;&#x6807;&#x8BC6;&#x4E3A;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x63D0;&#x4F9B;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x5141;&#x8BB8;&#x5BF9;&#x5BF9;&#x8C61;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x53CD;&#x5C04;&#xFF08;reflection&#xFF09;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5951;&#x7EA6;&#x4ECD;&#x53EF;&#x4EE5;&#x6536;&#x96C6;&#x5B83;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5F53;&#x9047;&#x5230;&#x51FD;&#x6570;&#x65F6;&#x5C31;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x5C06;&#x51FD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x7406;&#x89E3;&#x4E3A;&#x5305;&#x542B;&#x5176;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#xFF0C;&#x51FD;&#x6570;&#x53EA;&#x662F;&#x5E26;&#x6709;&#x51FD;&#x6570;&#x6807;&#x7B7E;&#x7684;&#x4E0D;&#x900F;&#x660E;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x6709;&#x9650;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF08;&#x5982;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x6570;&#x91CF;&#xFF09;&#x3002;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x751A;&#x81F3;&#x96BE;&#x4EE5;&#x5206;&#x8FA8;&#x51FD;&#x6570;&#x662F;&#x5426;&#x8BFB;&#x5165;&#x548C;&#x751F;&#x6210;&#x51FD;&#x6570;&#x2014;&#x2014;&#x800C;&#x975E;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x2014;&#x2014;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#x5224;&#x65AD;&#x5B83;&#x662F;&#x5426;&#x8BFB;&#x5165;&#x5E76;&#x751F;&#x6210;<code>(number -&gt; number)</code>&#x7C7B;&#x578B;&#x7684;&#x51FD;&#x6570;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F88;&#x597D;&#x5730;&#x4F53;&#x73B0;&#x5728;JavaScript&#x7684;&#xFF08;&#x9519;&#x8BEF;&#x547D;&#x540D;&#x7684;&#xFF09;<code>typeof</code>&#x8FD0;&#x7B97;&#x7B26;&#x4E2D;&#x3002;&#x4F20;&#x7ED9;&#x5176;&#x6570;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x7B49;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;<code>typeof</code>&#x4F1A;&#x8FD4;&#x56DE;&#x5BF9;&#x5E94;&#x7C7B;&#x578B;&#x540D;&#x5B57;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x4F8B;&#x5982;<code>&quot;number&quot;</code>&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE;<code>&quot;object&quot;</code>&#x3002;&#x6700;&#x8981;&#x547D;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#x5B83;&#x8FD4;&#x56DE;<code>&quot;function&quot;</code>&#xFF0C;&#x6CA1;&#x6709;&#x989D;&#x5916;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<blockquote>
<p>&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;<code>typeof</code>&#x5BF9;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x7B26;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x7CDF;&#x7CD5;&#x7684;&#x540D;&#x5B57;&#x3002;&#x5B83;&#x5E94;&#x8BE5;&#x88AB;&#x79F0;&#x4E3A;<code>tagof</code>&#xFF0C;&#x4E3A;&#x672A;&#x6765;&#x7684;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;JavaScript&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7559;&#x4E0B;&#x7684;<code>typeof</code>&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x3002;</p>
</blockquote>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F53;&#x9047;&#x5230;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x53EA;&#x80FD;&#x68C0;&#x67E5;&#x5B83;&#x662F;&#x5426;&#x7684;&#x786E;&#x662F;&#x51FD;&#x6570;&#xFF08;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x90A3;&#x663E;&#x7136;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF09;&#x3002;&#x5B83;&#x65E0;&#x6CD5;&#x68C0;&#x67E5;&#x6709;&#x5173;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x57DF;&#x548C;&#x503C;&#x57DF;&#x7684;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x653E;&#x5F03;&#x5417;&#xFF1F;</p>
<h2 id="163-&#x9AD8;&#x9636;&#x5951;&#x7EA6;">16.3 &#x9AD8;&#x9636;&#x5951;&#x7EA6;</h2>
<p>&#x4E3A;&#x4E86;&#x786E;&#x5B9A;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#x5951;&#x7EA6;&#x6700;&#x521D;&#x63D0;&#x4F9B;&#x4E86;&#x4EC0;&#x4E48;&#x4FDD;&#x8BC1;&#x3002;&#x5728;&#x524D;&#x8FF0;&#x7684;<code>real-sqrt-1</code>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x6C42;&#x53C2;&#x6570;&#x662F;&#x975E;&#x8D1F;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x53EA;&#x6709;&#x5728;<code>real-sqrt-1</code>&#x88AB;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x65F6;&#x624D;&#x4F1A;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#xFF0C;&#x5E76;&#x4E14;&#x4EC5;&#x68C0;&#x67E5;&#x5B9E;&#x9645;&#x4F20;&#x5165;&#x7684;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x5305;&#x542B;&#x7247;&#x6BB5;</p>
<pre><code class="lang-Racket">(lambda () (real-sqrt-1 -1))
</code></pre>
<p>&#x4F46;&#x8BE5;thunk&#x4E00;&#x76F4;&#x6CA1;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x7A0B;&#x5E8F;&#x5458;&#x5C06;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x5951;&#x7EA6;&#x88AB;&#x8FDD;&#x53CD;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x8FD9;&#x6B21;&#x8FD0;&#x884C;&#x4E2D;&#x6CA1;&#x6709;&#x8C03;&#x7528;&#x6B64;thunk&#xFF0C;&#x4F46;&#x5728;&#x540E;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x4E2D;&#x8C03;&#x7528;&#x5230;&#x4E86;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6F5C;&#x5728;&#x7684;&#x5951;&#x7EA6;&#x9519;&#x8BEF;&#x3002;&#x51FA;&#x4E8E;&#x6B64;&#x539F;&#x56E0;&#xFF0C;&#x901A;&#x5E38;&#x6700;&#x597D;&#x7528;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x6765;&#x8868;&#x793A;&#x4E0D;&#x53D8;&#x91CF;&#xFF1B;&#x4F46;&#x5728;&#x4F7F;&#x7528;&#x5951;&#x7EA6;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x660E;&#x767D;&#xFF0C;&#x4EC5;&#x5F53;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x5230;&#x76F8;&#x5173;&#x4F4D;&#x7F6E;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x4F1A;&#x6536;&#x5230;&#x9519;&#x8BEF;&#x901A;&#x77E5;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6709;&#x7528;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x51FD;&#x6570;&#x95EE;&#x9898;&#x63D0;&#x4F9B;&#x4E86;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5BF9;&#x4E8E;&#x6307;&#x660E;&#x7684;&#x51FD;&#x6570;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x7ACB;&#x5373;&#x68C0;&#x67E5;&#x5B83;&#x771F;&#x7684;&#x662F;&#x51FD;&#x6570;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5FFD;&#x7565;&#x5B9A;&#x4E49;&#x57DF;&#x548C;&#x503C;&#x57DF;&#x7684;&#x5951;&#x7EA6;&#xFF0C;&#x800C;&#x662F;<strong>&#x5EF6;&#x8FDF;</strong>&#x5904;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x51FD;&#x6570;&#xFF08;&#x6BCF;&#x6B21;&#xFF09;&#x5B9E;&#x9645;&#x4F5C;&#x7528;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#x65F6;&#x68C0;&#x67E5;&#x5B9A;&#x4E49;&#x57DF;&#x5951;&#x7EA6;&#xFF0C;&#x5E76;&#x5728;&#x51FD;&#x6570;&#x5B9E;&#x9645;&#x8FD4;&#x56DE;&#x503C;&#x65F6;&#x68C0;&#x67E5;&#x503C;&#x57DF;&#x5951;&#x7EA6;&#x3002;</p>
<p>&#x8FD9;&#x663E;&#x7136;&#x548C;<code>make-contract</code>&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x6A21;&#x5F0F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;<code>make-contract</code>&#x8D77;&#x4E2A;&#x66F4;&#x5177;&#x63CF;&#x8FF0;&#x6027;&#x7684;&#x540D;&#x79F0;&#xFF1A;&#x5B83;&#x68C0;&#x67E5;<strong>&#x5373;&#x65F6;&#x7684;</strong>&#xFF08;immediate&#xFF09;&#x5951;&#x7EA6;&#xFF08;&#x5373;&#x5F53;&#x524D;&#x53EF;&#x4EE5;&#x5B8C;&#x6574;&#x68C0;&#x67E5;&#x7684;&#x5951;&#x7EA6;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x5728;Racket&#x5951;&#x7EA6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6241;&#x5E73;&#x7684;</strong>&#xFF08;flat&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6709;&#x70B9;&#x8BEF;&#x5BFC;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4FDD;&#x62A4;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
</blockquote>
<pre><code class="lang-Racket">(define (immediate pred?)
  (lambda (val)
    (if (pred? val) val (blame val))))
</code></pre>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x8BFB;&#x5165;&#x4E24;&#x4E2A;&#x5951;&#x7EA6;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x2014;&#x2014;&#x5206;&#x522B;&#x8868;&#x793A;&#x5BF9;&#x5B9A;&#x4E49;&#x57DF;&#x548C;&#x503C;&#x57DF;&#x7684;&#x68C0;&#x67E5;&#x2014;&#x2014;&#x5E76;&#x8FD4;&#x56DE;&#x8C13;&#x8BCD;&#x3002;&#x8FD9;&#x4E2A;&#x8C13;&#x8BCD;&#x4F5C;&#x7528;&#x4E8E;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x5951;&#x7EA6;&#x7684;&#x503C;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x4F1A;&#x68C0;&#x67E5;&#x7ED9;&#x5B9A;&#x7684;&#x503C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x51FD;&#x6570;&#xFF1A;&#x8FD9;&#x90E8;&#x5206;&#x4ECD;&#x7136;&#x662F;&#x5373;&#x65F6;&#x7684;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;<strong>&#x4EE3;&#x7406;</strong>&#xFF08;surrogate&#xFF09;&#x51FD;&#x6570;&#xFF0C;&#x7531;&#x5B83;&#x6765;&#x5E94;&#x7528;&#x201C;&#x5269;&#x4F59;&#x7684;&#x201D;&#x5951;&#x7EA6;&#x2014;&#x2014;&#x68C0;&#x67E5;&#x5B9A;&#x4E49;&#x57DF;&#x548C;&#x503C;&#x57DF;&#x2014;&#x2014;&#x4F46;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x4E0E;&#x539F;&#x51FD;&#x6570;&#x884C;&#x4E3A;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x4EE3;&#x7406;&#x8FD9;&#x4E00;&#x884C;&#x4E3A;&#x80CC;&#x79BB;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x65AD;&#x8A00;&#x673A;&#x5236;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x68C0;&#x67E5;&#x800C;&#x4E0D;&#x6539;&#x53D8;&#x503C;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x68C0;&#x67E5;&#x5951;&#x7EA6;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x4EE3;&#x7406;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x5C01;&#x88C5;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x4F1A;&#x8BFB;&#x5165;&#x5951;&#x7EA6;&#x548C;&#x503C;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x8BE5;&#x503C;&#x7684;&#x4FDD;&#x62A4;&#x7248;&#x672C;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (guard ctc val) (ctc val))
</code></pre>
<p>&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x6570;&#x5951;&#x7EA6;&#x5305;&#x88C5;<code>add1</code>&#x51FD;&#x6570;&#xFF08;&#x4F7F;&#x7528;&#x7A0D;&#x540E;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;<code>function</code>&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">(define a1 (guard (function (immediate number?)
                            (immediate number?))
                  add1))
</code></pre>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;<code>a1</code>&#x672C;&#x8D28;&#x4E0A;&#x7ED1;&#x5B9A;&#x5230;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-Racket">(define a1
  (lambda (x)
    (num?-con (add1 (num?-con x)))))
</code></pre>
<p>&#x5176;&#x4E2D;<code>(lambda (x) ...)</code>&#x662F;&#x4EE3;&#x7406;&#xFF1B;&#x5B83;&#x4F1A;<code>add1</code>&#x7684;&#x8C03;&#x7528;&#x4E4B;&#x5904;&#x524D;&#x540E;&#x8C03;&#x7528;&#x6570;&#x503C;&#x5951;&#x7EA6;&#x3002;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x8FDD;&#x89C4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5951;&#x7EA6;&#x7684;&#x884C;&#x4E3A;&#x5C31;&#x662F;&#x6052;&#x7B49;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5728;&#x4E0D;&#x8FDD;&#x89C4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x884C;&#x4E3A;&#x4E8E;<code>add1</code>&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x6B64;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;<code>function</code>&#x5B9A;&#x4E49;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x7ED9;&#x5B9A;&#x7684;&#x503C;&#x771F;&#x7684;&#x662F;&#x51FD;&#x6570;&#xFF08;&#x8FD9;&#x91CC;&#x7684;<code>add1</code>&#x7684;&#x786E;&#x662F;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x68C0;&#x67E5;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x6211;&#x4EEC;&#x5C06;&#x4EE3;&#x7406;&#x7ED1;&#x5B9A;&#x5230;a1&#x65F6;&#x6B64;&#x9879;&#x68C0;&#x67E5;&#x5DF2;&#x7ECF;&#x6D88;&#x5931;&#x7684;&#x539F;&#x56E0;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (function dom rng)
  (lambda (val)
    (if (procedure? val)
        (lambda (x) (rng (val (dom x))))
        (blame val))))
</code></pre>
<blockquote>
<p>&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5047;&#x8BBE;&#x5355;&#x53C2;&#x6570;&#x51FD;&#x6570;&#xFF0C;&#x4E0D;&#x8FC7;&#x6269;&#x5C55;&#x5230;&#x591A;&#x53C2;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5951;&#x7EA6;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x53C2;&#x6570;<strong>&#x4E4B;&#x95F4;</strong>&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
</blockquote>
<p>&#x8981;&#x7406;&#x89E3;&#x8FD9;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x66FF;&#x6362;&#x53C2;&#x6570;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x4EE3;&#x7801;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6784;&#x9020;<code>number?</code>&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#x5668;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x547D;&#x540D;&#xFF1A;</p>
<pre><code class="lang-Racket">  (define num?-con (immediate number?))
= (define num?-con
    (lambda (val)
      (if (number? val) val (blame val))))
</code></pre>
<p>&#x56DE;&#x5230;<code>a1</code>&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x6211;&#x4EEC;&#x5148;&#x8C03;&#x7528;<code>guard</code>&#xFF1A;</p>
<pre><code class="lang-Racket">(define a1
  ((function num?-con num?-con)
   add1))
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define a1
  ((lambda (val)
     (if (procedure? val)
         (lambda (x) (num?-con (val (num?-con x))))
         (blame val)))
   add1))
</code></pre>
<p>&#x8C03;&#x7528;&#x5DE6;&#x62EC;&#x53F7;-&#x5DE6;&#x62EC;&#x53F7;-lambda&#x5F97;&#xFF1A;</p>
<pre><code class="lang-Racket">(define a1
  (if (procedure? add1)
      (lambda (x) (num?-con (add1 (num?-con x))))
      (blame add1)))
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E00;&#x6B65;&#x4F1A;&#x68C0;&#x67E5;&#x88AB;&#x4FDD;&#x62A4;&#x7684;&#x503C;&#x7684;&#x786E;&#x662F;&#x51FD;&#x6570;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5F97;&#x5230;</p>
<pre><code class="lang-Racket">(define a1
  (lambda (x)
    (num?-con (add1 (num?-con x)))))
</code></pre>
<p>&#x8FD9;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x83B7;&#x5F97;&#x7684;&#x4EE3;&#x7406;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x8FDD;&#x89C4;&#x7684;&#x8C03;&#x7528;&#xFF0C;&#x5176;&#x884C;&#x4E3A;&#x5C31;&#x662F;<code>add1</code>&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x6709;&#x591A;&#x5C11;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x8FDD;&#x80CC;&#x4E0A;&#x8FF0;&#x7684;<code>add1</code>&#x5951;&#x7EA6;&#xFF1F;</p>
</blockquote>
<p>&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x4E8E;&#x4E09;&#x4E2A;&#x5951;&#x7EA6;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<ol>
<li>&#x88AB;&#x5C01;&#x88C5;&#x7684;&#x503C;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#xFF1B;</li>
<li>&#x88AB;&#x5C01;&#x88C5;&#x7684;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x88AB;&#x4F5C;&#x7528;&#x4E8E;&#x4E0D;&#x4E3A;&#x6570;&#x7684;&#x503C;&#xFF1B;&#x6216;&#x8005;</li>
<li>&#x88AB;&#x5C01;&#x88C5;&#x7684;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x8F93;&#x5165;&#x4E5F;&#x662F;&#x6570;&#xFF0C;&#x4F46;&#x5176;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x662F;&#x6570;&#x7C7B;&#x578B;&#x3002;</li>
</ol>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x7F16;&#x5199;&#x793A;&#x4F8B;&#x5B9E;&#x73B0;&#x8FD9;&#x4E09;&#x79CD;&#x8FDD;&#x89C4;&#x884C;&#x4E3A;&#xFF0C;&#x5E76;&#x89C2;&#x5BDF;&#x5951;&#x7EA6;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4F60;&#x80FD;&#x6539;&#x8FDB;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x533A;&#x5206;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x540C;&#x6837;&#x7684;&#x5C01;&#x88C5;&#x6280;&#x672F;&#x4E5F;&#x9002;&#x7528;&#x4E8E;<code>d/dx</code>&#xFF1A;</p>
<pre><code class="lang-Racket">(define d/dx
  (guard (function (function (immediate number?) (immediate number?))
                   (function (immediate number?) (immediate number?)))
         (lambda (f)
           (lambda (x)
             (/ (- (f (+ x 0.001))
                   (f x))
                0.001)))))
</code></pre>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x8FDD;&#x53CD;&#x6B64;&#x5951;&#x7EA6;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x4E03;&#x79CD;&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x4E8E;&#x4E03;&#x4E2A;&#x5951;&#x7EA6;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x6839;&#x636E;&#x9700;&#x8981;&#xFF0C;&#x4F20;&#x5165;&#xFF08;&#x9519;&#x8BEF;&#x7684;&#xFF09;&#x53C2;&#x6570;&#x6216;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x8FDD;&#x53CD;&#x5B83;&#x4EEC;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x3002;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6539;&#x8FDB;&#x9519;&#x8BEF;&#x62A5;&#x544A;&#xFF0C;&#x4EE5;&#x6B63;&#x786E;&#x8BC6;&#x522B;&#x6BCF;&#x79CD;&#x8FDD;&#x89C4;&#x884C;&#x4E3A;&#xFF1F;</p>
</blockquote>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5D4C;&#x5957;&#x51FD;&#x6570;&#x7684;&#x5951;&#x7EA6;&#x63A8;&#x8FDF;&#x4E86;&#x4E24;&#x5904;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#x7684;&#x68C0;&#x67E5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x5904;&#x3002;&#x8FD9;&#x7B26;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x671F;&#x671B;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#x53EA;&#x80FD;&#x62A5;&#x544A;&#x5B9E;&#x9645;&#x503C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x4E8E;&#x5B9E;&#x9645;&#x503C;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x4EEC;&#x65E0;&#x6CD5;&#x62A5;&#x544A;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x786E;&#x5B9E;&#x610F;&#x5473;&#x7740;&#x201C;&#x8FDD;&#x89C4;&#x201D;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x5F88;&#x5FAE;&#x5999;&#xFF1A;&#x4F20;&#x9012;&#x7ED9;<code>d/dx</code>&#x7684;&#x51FD;&#x6570;&#x503C;&#x53EF;&#x80FD;&#x7684;&#x786E;&#x8FDD;&#x53CD;&#x4E86;&#x5951;&#x7EA6;&#xFF0C;&#x4F46;&#x8FD9;&#x7C7B;&#x8FDD;&#x89C4;&#x53EA;&#x6709;&#x5728;&#x4F20;&#x9012;&#x6216;&#x8FD4;&#x56DE;&#x6570;&#x503C;&#x4E4B;&#x540E;&#x624D;&#x4F1A;&#x88AB;<strong>&#x89C2;&#x6D4B;</strong>&#x5230;&#x3002;</p>
<h2 id="164-&#x4FBF;&#x6377;&#x8BED;&#x6CD5;">16.4 &#x4FBF;&#x6377;&#x8BED;&#x6CD5;</h2>
<p>&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x4E24;&#x79CD;&#x6241;&#x5E73;&#x5951;&#x7EA6;&#x7684;&#x4F7F;&#x7528;&#x98CE;&#x683C;&#xFF0C;&#x5206;&#x522B;&#x7531;<code>real-sqrt-1</code>&#x548C;<code>real-sqrt-2</code>&#x4F53;&#x73B0;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x98CE;&#x683C;&#x5404;&#x6709;&#x7F3A;&#x70B9;&#x3002;&#x540E;&#x8005;&#x8BA9;&#x4EBA;&#x8054;&#x60F3;&#x5230;&#x4F20;&#x7EDF;&#x7684;&#x65AD;&#x8A00;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x9AD8;&#x9636;&#x503C;&#xFF08;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x88AB;&#x5C01;&#x88C5;&#x7684;&#x503C;&#x624D;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x3002;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x65AD;&#x8A00;&#x7CFB;&#x7EDF;&#x53EA;&#x5904;&#x7406;&#x6241;&#x5E73;&#x5951;&#x7EA6;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#x8FD9;&#x4E2A;&#x7EC6;&#x5FAE;&#x7684;&#x5DEE;&#x522B;&#x3002;&#xFF09;&#x524D;&#x8005;&#x5C06;&#x503C;&#x7684;&#x4F7F;&#x7528;&#x653E;&#x4E0E;&#x5951;&#x7EA6;&#x4E4B;&#x4E2D;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x8FD9;&#x53EF;&#x884C;&#xFF0C;&#x4F46;&#x6709;&#x4E09;&#x4E2A;&#x7F3A;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x5FD8;&#x8BB0;&#x5C01;&#x88C5;&#x67D0;&#x4E9B;&#x4F7F;&#x7528;&#x3002;</li>
<li>&#x5951;&#x7EA6;&#x5728;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x4E2D;&#x90FD;&#x4F1A;&#x88AB;&#x68C0;&#x67E5;&#x4E00;&#x6B21;&#xFF0C;&#x5728;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#x65F6;&#x8FD9;&#x662F;&#x6D6A;&#x8D39;&#x3002;</li>
<li>&#x7A0B;&#x5E8F;&#x6DF7;&#x5408;&#x4E86;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#x548C;&#x5176;&#x529F;&#x80FD;&#x884C;&#x4E3A;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x53EF;&#x8BFB;&#x6027;&#x3002;</li>
</ol>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x660E;&#x667A;&#x5730;&#x4F7F;&#x7528;&#x8BED;&#x6CD5;&#x7CD6;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8981;&#x5C06;&#x5951;&#x7EA6;&#x9644;&#x52A0;&#x5230;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x7F16;&#x5199;&#xFF1A;</p>
<pre><code class="lang-Racket">(define/contract (real-sqrt (x :: (immediate positive?)))
  (sqrt x))
</code></pre>
<p>&#x610F;&#x56FE;&#x662F;&#x7528;<code>positive?</code>&#x6765;&#x4FDD;&#x62A4;<code>x</code>&#xFF0C;&#x4F46;&#x53EA;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x68C0;&#x67E5;&#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x8F6C;&#x5316;&#x4E3A;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (real-sqrt new-x)
  (let ([x (guard (immediate positive?) new-x)])
    (sqrt x)))
</code></pre>
<p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5B8F;&#x4E3A;&#x6BCF;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x751F;&#x6210;&#x65B0;&#x540D;&#x79F0;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7528;&#x6237;&#x7ED9;&#x51FA;&#x7684;&#x540D;&#x79F0;&#x5173;&#x8054;&#x5230;&#x65B0;&#x540D;&#x79F0;&#x7684;&#x5C01;&#x88C5;&#x7248;&#x672C;&#x3002;&#x8FD9;&#x4E2A;&#x5B8F;&#x7684;&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-syntax (define/contract stx)
  (syntax-case stx (::)
    [(_ (f (id :: c) ...) b)
     (with-syntax ([(new-id ...) (generate-temporaries #&apos;(id ...))])
       #&apos;(define f
           (lambda (new-id ...)
             (let ([id (guard c new-id)]
                   ...)
               b))))]))
</code></pre>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#xFF08;&#x8BED;&#x6CD5;&#x4E0A;&#x7684;&#xFF09;&#x4FBF;&#x5229;&#xFF0C;&#x5951;&#x7EA6;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x5951;&#x7EA6;&#x4F7F;&#x7528;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x3001;&#x6548;&#x7387;&#x548C;&#x5065;&#x58EE;&#x6027;&#x3002;</p>
<h2 id="165-&#x6269;&#x5C55;&#x5230;&#x590D;&#x5408;&#x6570;&#x636E;&#x7ED3;&#x6784;">16.5 &#x6269;&#x5C55;&#x5230;&#x590D;&#x5408;&#x6570;&#x636E;&#x7ED3;&#x6784;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#xFF0C;&#x5C06;&#x5951;&#x7EA6;&#x6269;&#x5C55;&#x5230;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;&#x5982;&#x94FE;&#x8868;&#x3001;&#x5411;&#x91CF;&#x548C;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x9012;&#x5F52;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF09;&#x4F3C;&#x4E4E;&#x5F88;&#x5BB9;&#x6613;&#x3002;&#x53EA;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x9002;&#x5F53;&#x7684;&#x5BF9;&#x8FD0;&#x884C;&#x65F6;&#x89C2;&#x6D4B;&#x96C6;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x7C7B;&#x578B;&#x7684;&#x7CBE;&#x5EA6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#xFF0C;&#x652F;&#x6301;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E0D;&#x9700;&#x8981;<strong>&#x7C7B;&#x578B;</strong>&#x8C13;&#x8BCD;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x4F1A;&#x63D0;&#x4F9B;&#x533A;&#x5206;<strong>&#x53D8;&#x4F53;</strong>&#x7684;&#x8C13;&#x8BCD;&#xFF1B;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7C7B;&#x578B;&#x7EA7;&#x522B;&#x7684;&#x201C;&#x5951;&#x7EA6;&#x201D;&#x68C0;&#x67E5;&#x6700;&#x597D;&#xFF08;&#x4E5F;&#x8BB8;&#x5FC5;&#x987B;&#xFF09;&#x7559;&#x7ED9;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x7531;&#x5951;&#x7EA6;&#x6765;&#x65AD;&#x8A00;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x7ED3;&#x6784;&#x7279;&#x6027;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x4E25;&#x91CD;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4E86;&#x5E73;&#x8861;&#x4E8C;&#x53C9;&#x641C;&#x7D22;&#x6811;&#xFF0C;&#x80FD;&#x4EE5;&#x5BF9;&#x6570;&#x6E10;&#x8FD1;&#x65F6;&#x95F4;&#xFF08;&#x76F8;&#x5BF9;&#x6811;&#x7684;&#x5927;&#x5C0F;&#xFF09;&#x5B9E;&#x73B0;&#x63D2;&#x5165;&#x548C;&#x67E5;&#x627E;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5C06;&#x6811;&#x5C01;&#x88C5;&#x5728;&#x5408;&#x9002;&#x7684;&#x5951;&#x7EA6;&#x4E2D;&#x3002;&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x4EC5;&#x68C0;&#x67E5;&#x5951;&#x7EA6;&#x5C31;&#x4F1A;&#x8BBF;&#x95EE;&#x6574;&#x4E2A;&#x6811;&#xFF0C;&#x4ECE;&#x800C;&#x7528;&#x53BB;&#x7EBF;&#x6027;&#x65F6;&#x95F4;&#xFF01;&#x56E0;&#x6B64;&#xFF0C;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#x66F4;&#x597D;&#x7684;&#x7B56;&#x7565;&#x662F;&#xFF0C;&#x6784;&#x5EFA;&#x6811;&#x7684;&#x65F6;&#x5019;&#x5C31;&#xFF08;&#x4EE5;&#x589E;&#x91CF;&#x65B9;&#x5F0F;&#xFF09;&#x5B8C;&#x6210;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#xFF0C;&#x67E5;&#x627E;&#x65F6;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x6B21;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x66F4;&#x7CDF;&#x7684;&#x662F;&#xFF0C;&#x5E73;&#x8861;&#x548C;&#x987A;&#x5E8F;&#x90FD;&#x662F;&#x641C;&#x7D22;&#x6811;&#x7684;&#x9012;&#x5F52;&#x5C5E;&#x6027;&#x3002;&#x56E0;&#x6B64;&#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x6811;&#x90FD;&#x5E94;&#x6EE1;&#x8DB3;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x6B21;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x90FD;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x3002;&#x5728;&#x63D2;&#x5165;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x63D2;&#x5165;&#x662F;&#x9012;&#x5F52;&#x7684;&#xFF0C;&#x5C06;&#x5728;&#x6BCF;&#x4E2A;&#x8BBF;&#x95EE;&#x7684;&#x5B50;&#x6811;&#x4E0A;&#x68C0;&#x67E5;&#x5951;&#x7EA6;&#x3002;&#x5728;&#x5927;&#x5C0F;&#x4E3A; <span class="katex"><span class="katex-mathml"><math><semantics><mrow><mi>t</mi></mrow><annotation encoding="application/x-tex">t</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.61508em;"></span><span class="strut bottom" style="height:0.61508em;vertical-align:0em;"></span><span class="base textstyle uncramped"><span class="mord mathit">t</span></span></span></span> &#x7684;&#x6811;&#x4E2D;&#xFF0C;&#x5951;&#x7EA6;&#x8C13;&#x8BCD;&#x5E94;&#x7528;&#x4E8E; <span class="katex"><span class="katex-mathml"><math><semantics><mrow><mfrac><mrow><mi>t</mi></mrow><mrow><mn>2</mn></mrow></mfrac></mrow><annotation encoding="application/x-tex">\frac{t}{2}</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.824556em;"></span><span class="strut bottom" style="height:1.169556em;vertical-align:-0.345em;"></span><span class="base textstyle uncramped"><span class="mord reset-textstyle textstyle uncramped"><span class="mopen sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span><span class="mfrac"><span class="vlist"><span style="top:0.345em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle cramped mtight"><span class="mord scriptstyle cramped mtight"><span class="mord mathrm mtight">2</span></span></span></span><span style="top:-0.22999999999999998em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle textstyle uncramped frac-line"></span></span><span style="top:-0.394em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle uncramped mtight"><span class="mord scriptstyle uncramped mtight"><span class="mord mathit mtight">t</span></span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span><span class="mclose sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span></span></span></span></span> &#x5143;&#x7D20;&#x7684;&#x5B50;&#x6811;&#xFF0C;&#x7136;&#x540E;&#x5E94;&#x7528;&#x4E8E; <span class="katex"><span class="katex-mathml"><math><semantics><mrow><mfrac><mrow><mi>t</mi></mrow><mrow><mn>4</mn></mrow></mfrac></mrow><annotation encoding="application/x-tex">\frac{t}{4}</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.824556em;"></span><span class="strut bottom" style="height:1.169556em;vertical-align:-0.345em;"></span><span class="base textstyle uncramped"><span class="mord reset-textstyle textstyle uncramped"><span class="mopen sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span><span class="mfrac"><span class="vlist"><span style="top:0.345em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle cramped mtight"><span class="mord scriptstyle cramped mtight"><span class="mord mathrm mtight">4</span></span></span></span><span style="top:-0.22999999999999998em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle textstyle uncramped frac-line"></span></span><span style="top:-0.394em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle uncramped mtight"><span class="mord scriptstyle uncramped mtight"><span class="mord mathit mtight">t</span></span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span><span class="mclose sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span></span></span></span></span> &#x5143;&#x7D20;&#x7684;&#x5B50;&#x5B50;&#x6811;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x5728;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x8BBF;&#x95EE;&#x603B;&#x6570;&#x4E3A; <span class="katex"><span class="katex-mathml"><math><semantics><mrow><mfrac><mrow><mi>t</mi></mrow><mrow><mn>2</mn></mrow></mfrac><mo>+</mo><mfrac><mrow><mi>t</mi></mrow><mrow><mn>4</mn></mrow></mfrac><mo>+</mo><mi mathvariant="normal">.</mi><mi mathvariant="normal">.</mi><mi mathvariant="normal">.</mi><mo>+</mo><mfrac><mrow><mi>t</mi></mrow><mrow><mi>t</mi></mrow></mfrac></mrow><annotation encoding="application/x-tex">\frac{t}{2}+\frac{t}{4}+...+\frac{t}{t}</annotation></semantics></math></span><span class="katex-html" aria-hidden="true"><span class="strut" style="height:0.824556em;"></span><span class="strut bottom" style="height:1.169556em;vertical-align:-0.345em;"></span><span class="base textstyle uncramped"><span class="mord reset-textstyle textstyle uncramped"><span class="mopen sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span><span class="mfrac"><span class="vlist"><span style="top:0.345em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle cramped mtight"><span class="mord scriptstyle cramped mtight"><span class="mord mathrm mtight">2</span></span></span></span><span style="top:-0.22999999999999998em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle textstyle uncramped frac-line"></span></span><span style="top:-0.394em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle uncramped mtight"><span class="mord scriptstyle uncramped mtight"><span class="mord mathit mtight">t</span></span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span><span class="mclose sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span></span><span class="mbin">+</span><span class="mord reset-textstyle textstyle uncramped"><span class="mopen sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span><span class="mfrac"><span class="vlist"><span style="top:0.345em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle cramped mtight"><span class="mord scriptstyle cramped mtight"><span class="mord mathrm mtight">4</span></span></span></span><span style="top:-0.22999999999999998em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle textstyle uncramped frac-line"></span></span><span style="top:-0.394em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle uncramped mtight"><span class="mord scriptstyle uncramped mtight"><span class="mord mathit mtight">t</span></span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span><span class="mclose sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span></span><span class="mbin">+</span><span class="mord mathrm">.</span><span class="mord mathrm">.</span><span class="mord mathrm">.</span><span class="mbin">+</span><span class="mord reset-textstyle textstyle uncramped"><span class="mopen sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span><span class="mfrac"><span class="vlist"><span style="top:0.345em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle cramped mtight"><span class="mord scriptstyle cramped mtight"><span class="mord mathit mtight">t</span></span></span></span><span style="top:-0.22999999999999998em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle textstyle uncramped frac-line"></span></span><span style="top:-0.394em;"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span><span class="reset-textstyle scriptstyle uncramped mtight"><span class="mord scriptstyle uncramped mtight"><span class="mord mathit mtight">t</span></span></span></span><span class="baseline-fix"><span class="fontsize-ensurer reset-size5 size5"><span style="font-size:0em;">&#x200B;</span></span>&#x200B;</span></span></span><span class="mclose sizing reset-size5 size5 reset-textstyle textstyle uncramped nulldelimiter"></span></span></span></span></span> &#x7684;&#x5143;&#x7D20;&#x2014;&#x2014;&#x4F7F;&#x6211;&#x4EEC;&#x9884;&#x671F;&#x7684;&#x5BF9;&#x6570;&#x65F6;&#x95F4;&#x63D2;&#x5165;&#x8FC7;&#x7A0B;&#x82B1;&#x8D39;&#x7EBF;&#x6027;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5BF9;&#x8FD9;&#x4E24;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x63AA;&#x65BD;&#x7F13;&#x89E3;&#x3002;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x9700;&#x8981;&#x4E0E;&#x5B83;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x7684;&#x4E00;&#x7EC4;&#x5951;&#x7EA6;&#x76F8;&#x5173;&#x8054;&#xFF08;&#x6216;&#x5185;&#x90E8;&#x5B58;&#x50A8;&#xFF0C;&#x6216;&#x5B58;&#x50A8;&#x4E8E;&#x6563;&#x5217;&#x8868;&#x4E2D;&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x8C03;&#x7528;&#x5951;&#x7EA6;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x5B83;&#x662F;&#x5426;&#x5DF2;&#x88AB;&#x68C0;&#x67E5;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x5219;&#x4E0D;&#x518D;&#x68C0;&#x67E5;&#x3002;&#x8FD9;&#x5B9E;&#x8D28;&#x4E0A;&#x662F;&#x5C06;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#x8BB0;&#x5FC6;&#x5316;&#xFF08;memoization&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x68C0;&#x67E5;&#x7684;&#x7B97;&#x6CD5;&#x590D;&#x6742;&#x6027;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x8BB0;&#x5FC6;&#x5316;&#x800C;&#x8A00;&#xFF0C;&#x6700;&#x597D;&#x503C;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x503C;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x5951;&#x7EA6;&#x6267;&#x884C;&#x4EFB;&#x610F;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;&#x6B64;&#x4F18;&#x5316;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x53EF;&#x9760;&#x3002;</p>
<p>&#x68C0;&#x67E5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5FAE;&#x5999;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F5C;&#x4E3A;&#x4F8B;&#x5B50;&#xFF0C;&#x8003;&#x8651;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x7F16;&#x5199;&#x7684;&#x68C0;&#x67E5;&#x6570;&#x94FE;&#x8868;&#x4E2D;&#x6240;&#x6709;&#x503C;&#x5747;&#x662F;&#x5076;&#x6570;&#x7684;&#x5951;&#x7EA6;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x7528;&#x5951;&#x7EA6;&#x5C01;&#x88C5;&#x4E86;&#x94FE;&#x8868;&#xFF0C;&#x4F46;&#x53EA;&#x5BF9;&#x94FE;&#x8868;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x68C0;&#x67E5;&#x4E86;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x503C;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x4F46;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x4E89;&#x8FA9;&#x8BF4;&#xFF0C;&#x62A5;&#x544A;&#x94FE;&#x8868;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x8FDD;&#x89C4;&#x7684;&#x884C;&#x4E3A;&#x672C;&#x8EAB;&#x8FDD;&#x53CD;&#x4E86;&#x6211;&#x4EEC;&#x5BF9;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#x7684;&#x671F;&#x671B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E76;&#x672A;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x8BE5;&#x5143;&#x7D20;&#x3002;</p>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x63A8;&#x8FDF;&#x68C0;&#x67E5;&#x67D0;&#x4E9B;&#x503C;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5373;&#x65F6;&#x88AB;&#x68C0;&#x67E5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x6574;&#x4E2A;&#x94FE;&#x8868;&#x8F6C;&#x6362;&#x4E3A;&#x5305;&#x542B;&#x5EF6;&#x65F6;&#x68C0;&#x67E5;&#x7684;&#x5C01;&#x88C5;&#x503C;&#xFF0C;&#x6BCF;&#x4E2A;&#x503C;&#x4EC5;&#x5728;&#x8BBF;&#x95EE;&#x65F6;&#x88AB;&#x68C0;&#x67E5;&#x3002;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x53EF;&#x80FD;&#x5F88;&#x6709;&#x5438;&#x5F15;&#x529B;&#xFF0C;&#x4F46;&#x7F16;&#x7801;&#x8BE5;&#x7B56;&#x7565;&#x5E76;&#x4E0D;&#x7B80;&#x5355;&#xFF0C;&#x5C24;&#x5176;&#x5F53;&#x5B58;&#x5728;<strong>&#x522B;&#x540D;</strong>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x5F15;&#x7528;&#x540C;&#x4E00;&#x94FE;&#x8868;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x5951;&#x7EA6;&#x4FDD;&#x62A4;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x90FD;&#x6309;&#x9884;&#x671F;&#x8FD0;&#x884C;&#xFF08;&#x8FD9;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5728;&#x94FE;&#x8868;&#x4E2D;&#x5B58;&#x50A8;&#x4EFB;&#x4F55;&#x53EF;&#x53D8;&#x72B6;&#x6001;&#xFF09;&#x3002;</p>
<h2 id="166-&#x518D;&#x8BBA;&#x5951;&#x7EA6;&#x548C;&#x89C2;&#x6D4B;">16.6 &#x518D;&#x8BBA;&#x5951;&#x7EA6;&#x548C;&#x89C2;&#x6D4B;</h2>
<p>&#x5951;&#x7EA6;&#x5B9E;&#x73B0;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5947;&#x602A;&#x7684;&#x666E;&#x904D;&#x95EE;&#x9898;&#x2014;&#x2014;&#x9047;&#x5230;&#x590D;&#x6742;&#x6570;&#x636E;&#x65F6;&#x66F4;&#x751A;&#x3002;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x62B1;&#x6028;&#x8BF4;&#x68C0;&#x67E5;&#x51FD;&#x6570;&#x7684;&#x5951;&#x7EA6;&#x5F88;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x89C2;&#x6D4B;&#x80FD;&#x529B;&#x53D7;&#x9650;&#xFF1A;&#x6211;&#x4EEC;&#x80FD;&#x68C0;&#x67E5;&#x7684;&#x53EA;&#x6709;&#x503C;&#x662F;&#x5426;&#x662F;&#x51FD;&#x6570;&#x3002;&#x5728;&#x771F;&#x5B9E;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x95EE;&#x9898;&#x5176;&#x5B9E;&#x662F;&#x76F8;&#x53CD;&#x7684;&#xFF1A;&#x6211;&#x4EEC;&#x7684;&#x89C2;&#x6D4B;&#x80FD;&#x529B;&#x8FC7;&#x5269;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5B9E;&#x65BD;&#x5EF6;&#x8FDF;&#x68C0;&#x67E5;&#x94FE;&#x8868;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x5219;&#x5F88;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x6765;&#x4FDD;&#x5B58;&#x5B9E;&#x9645;&#x94FE;&#x8868;&#xFF0C;&#x5E76;&#x4FEE;&#x6539;<code>first</code>&#x548C;<code>rest</code>&#xFF0C;&#x4EE5;&#x6B64;&#xFF08;&#x68C0;&#x67E5;&#x5951;&#x7EA6;&#x540E;&#xFF09;&#x83B7;&#x53D6;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x7684;&#x503C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x50CF;<code>list?</code>&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x73B0;&#x5728;&#x53EF;&#x80FD;&#x8FD4;&#x56DE;<code>false</code>&#x800C;&#x4E0D;&#x662F;<code>true</code>&#xFF0C;&#x56E0;&#x4E3A;&#x7ED3;&#x6784;&#x4F53;&#x4E0D;&#x662F;&#x94FE;&#x8868;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;<code>list?</code>&#x9700;&#x8981;&#x7ED1;&#x5B9A;&#x5230;&#x65B0;&#x51FD;&#x6570;&#x4E0A;&#xFF0C;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x8868;&#x793A;&#x94FE;&#x8868;&#x7684;&#x5EF6;&#x8FDF;&#x5951;&#x7EA6;&#x7ED3;&#x6784;&#x4F53;&#x4E5F;&#x8FD4;&#x56DE;<code>true</code>&#x3002;&#x4F46;&#x5951;&#x7EA6;&#x7CFB;&#x7EDF;&#x4F5C;&#x8005;&#x8FD8;&#x9700;&#x8981;&#x8BB0;&#x5F97;&#x89E3;&#x51B3;<code>cons?</code>&#x3001;<code>pair?</code>&#xFF0C;&#x5929;&#x77E5;&#x9053;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x89C2;&#x6D4B;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x89C2;&#x6D4B;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x201C;&#x4FEE;&#x590D;&#x201D;&#xFF1A;<code>eq?</code>&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x503C;<code>eq?</code>&#x5B83;&#x81EA;&#x5DF1;&#xFF0C;&#x5373;&#x4F7F;&#x51FD;&#x6570;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x51FD;&#x6570;&#x5C01;&#x88C5;&#x4EE5;&#x540E;&#x5C31;&#x662F;&#x65B0;&#x7684;&#x51FD;&#x6570;&#x4E86;&#xFF0C;&#x4E0D;&#x4F46;<strong>&#x4E0D;</strong><code>eq?</code>&#x81EA;&#x5DF1;&#xFF0C;&#x4E5F;<strong>&#x4E0D;&#x5E94;&#x8BE5;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x884C;&#x4E3A;&#x771F;&#x7684;&#x4E0D;&#x540C;&#x4E86;&#xFF08;&#x5C3D;&#x7BA1;&#x53EA;&#x662F;&#x5728;&#x8FDD;&#x53CD;&#x5951;&#x7EA6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x5728;&#x63D0;&#x4F9B;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8F93;&#x5165;&#x503C;&#x5F97;&#x4EE5;&#x89C2;&#x6D4B;&#x5230;&#x8FDD;&#x89C4;&#x884C;&#x4E3A;&#x540E;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x6697;&#x4E2D;&#x4FDD;&#x62A4;&#x81EA;&#x5DF1;&#xFF0C;&#x56E0;&#x4E3A;&#x5B88;&#x62A4;&#x884C;&#x4E3A;&#x53EF;&#x4EE5;&#x88AB;&#x89C2;&#x6D4B;&#x5230;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6076;&#x610F;&#x6A21;&#x5757;&#x6709;&#x65F6;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x5B83;&#x6536;&#x5230;&#x7684;&#x662F;&#x5426;&#x662F;&#x53D7;&#x4FDD;&#x62A4;&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5C31;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x4E0D;&#xFF01;</p>
<h2 id="167-&#x5951;&#x7EA6;&#x548C;&#x8D4B;&#x503C;">16.7 &#x5951;&#x7EA6;&#x548C;&#x8D4B;&#x503C;</h2>
<p>&#x6211;&#x4EEC;&#x65E0;&#x7591;&#x5E94;&#x8BE5;&#x5173;&#x6CE8;&#x5951;&#x7EA6;&#x4E0E;&#x8D4B;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x5F53;&#x5951;&#x7EA6;&#x5EF6;&#x8FDF;&#x68C0;&#x67E5;&#x2014;&#x2014;&#x56FA;&#x6709;&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x4EE5;&#x5EF6;&#x8FDF;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x2014;&#x2014;&#x65F6;&#x66F4;&#x662F;&#x5982;&#x6B64;&#x3002;&#x6709;&#x4E24;&#x4EF6;&#x4E8B;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x3002;&#x4E00;&#x662F;&#x5C06;&#x5951;&#x7EA6;&#x503C;&#x5B58;&#x50A8;&#x5728;&#x53EF;&#x53D8;&#x72B6;&#x6001;&#x4E2D;&#xFF1B;&#x4E8C;&#x662F;<strong>&#x4E3A;</strong>&#x53EF;&#x53D8;&#x72B6;&#x6001;&#x7F16;&#x5199;&#x7684;&#x5951;&#x7EA6;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5B58;&#x50A8;&#x5951;&#x7EA6;&#x503C;&#x65F6;&#xFF0C;&#x5C01;&#x88C5;&#x7B56;&#x7565;&#x786E;&#x4FDD;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#x6B63;&#x5E38;&#x8FDB;&#x884C;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#xFF0C;&#x5951;&#x7EA6;&#x90FD;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x68C0;&#x67E5;&#x73B0;&#x6709;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x5305;&#x542B;&#x5176;&#x4F59;&#x68C0;&#x67E5;&#x7684;&#x5C01;&#x88C5;&#x503C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x5C01;&#x88C5;&#x503C;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x53EF;&#x53D8;&#x72B6;&#x6001;&#x5E76;&#x5728;&#x7A0D;&#x540E;&#x68C0;&#x7D22;&#x4EE5;&#x4F9B;&#x4F7F;&#x7528;&#xFF0C;&#x5B83;&#x4ECD;&#x7136;&#x5305;&#x542B;&#x8FD9;&#x4E9B;&#x68C0;&#x67E5;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x503C;&#x6700;&#x7EC8;&#x88AB;&#x4F7F;&#x7528;&#x65F6;&#x5B83;&#x4EEC;&#x5C06;&#x88AB;&#x6267;&#x884C;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x7F16;&#x5199;&#x53EF;&#x53D8;&#x6570;&#x636E;&#x7684;&#x5951;&#x7EA6;&#xFF0C;&#x5982;box&#x548C;&#x5411;&#x91CF;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x4E3A;&#x5305;&#x542B;&#x5951;&#x7EA6;&#x7684;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x521B;&#x5EFA;&#x5C01;&#x88C5;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5F53;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x503C;&#x88AB;&#x66FF;&#x6362;&#x4E3A;&#x65B0;&#x503C;&#x65F6;&#xFF0C;&#x6267;&#x884C;&#x66F4;&#x65B0;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;<code>set-box!</code>&#xFF09;&#x9700;&#x8981;&#x4ECE;&#x5C01;&#x88C5;&#x4E2D;&#x68C0;&#x7D22;&#x5951;&#x7EA6;&#xFF0C;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x4E8E;&#x65B0;&#x503C;&#x5E76;&#x5B58;&#x50A8;&#x65B0;&#x5C01;&#x88C5;&#x7684;&#x503C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x7B26;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F7F;&#x5176;&#x5BF9;&#x5951;&#x7EA6;&#x503C;&#x654F;&#x611F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8D4B;&#x503C;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x8FDD;&#x89C4;&#x884C;&#x4E3A;&#x7684;&#x53D1;&#x751F;&#x70B9;&#xFF1A;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#x5373;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x5EF6;&#x65F6;&#x5951;&#x7EA6;&#x9047;&#x5230;&#xFF08;&#x975E;&#x6CD5;&#xFF09;&#x8F93;&#x5165;&#x503C;&#x65F6;&#x53D1;&#x751F;&#x3002;</p>
<h2 id="168-&#x5951;&#x7EA6;&#x7684;&#x7EC4;&#x5408;">16.8 &#x5951;&#x7EA6;&#x7684;&#x7EC4;&#x5408;</h2>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x6240;&#x6709;&#x57FA;&#x672C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x672C;&#x8282;&#x5F88;&#x81EA;&#x7136;&#x8981;&#x5951;&#x7EA6;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x6B63;&#x5982;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x7684;<a href="chap15.html#1533-&#x8054;&#x5408;&#x7C7B;&#x578B;">&#x8054;&#x5408;</a>&#x548C;<a href="chap15.html#1535-&#x4EA4;&#x53C9;&#x7C7B;&#x578B;">&#x4EA4;&#x53C9;</a>&#x7C7B;&#x578B;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x5951;&#x7EA6;&#x7684;&#x8054;&#x5408;&#x548C;&#x4EA4;&#x53C9;&#xFF08;&#x5206;&#x522B;&#x662F;&#x201C;&#x6216;&#x201D;&#x4E0E;&#x201C;&#x548C;&#x201D;&#xFF09;&#xFF1B;&#x8FD8;&#x5E94;&#x5F53;&#x8003;&#x8651;&#x53D6;&#x53CD;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5951;&#x7EA6;&#x53EA;&#x662F;&#x8868;&#x9762;&#x4E0A;&#x7C7B;&#x4F3C;&#x4E8E;&#x7C7B;&#x578B;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x6839;&#x636E;&#x5951;&#x7EA6;&#x6765;&#x8003;&#x8651;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BD5;&#x56FE;&#x5C06;&#x6211;&#x4EEC;&#x4ECE;&#x7C7B;&#x578B;&#x5B66;&#x5230;&#x7684;&#x610F;&#x4E49;&#x6620;&#x5C04;&#x5230;&#x5951;&#x7EA6;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x76F4;&#x63A5;&#x7684;&#x4F8B;&#x5B50;&#x603B;&#x662F;&#x7B80;&#x5355;&#x7684;&#x3002;&#x8054;&#x5408;&#x5951;&#x7EA6;&#x901A;&#x8FC7;&#x6790;&#x53D6;&#x7EC4;&#x5408;&#x2014;&#x2014;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x8C13;&#x8BCD;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x53EF;&#x4EE5;&#x5B57;&#x9762;&#x4E0A;&#x7528;<code>or</code>&#x7EC4;&#x5408;&#x2014;&#x2014;&#x800C;&#x4EA4;&#x53C9;&#x5951;&#x7EA6;&#x901A;&#x8FC7;&#x5408;&#x53D6;&#x7EC4;&#x5408;&#x3002;&#x6211;&#x4EEC;&#x4F9D;&#x6B21;&#x8C03;&#x7528;&#x8C13;&#x8BCD;&#xFF0C;&#x8FDB;&#x884C;&#x77ED;&#x8DEF;&#x6C42;&#x503C;&#xFF08;&#x8BD1;&#x6CE8;&#xFF0C;&#x53C2;&#x89C1;<a href="chap17.html#1731-&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x83B7;&#x5F97;&#x6EE1;&#x8DB3;">&#x540E;&#x6587;</a>&#xFF09;&#xFF0C;&#x6700;&#x540E;&#x4EA7;&#x751F;&#x9519;&#x8BEF;&#x6216;&#x8FD4;&#x56DE;&#x5951;&#x7EA6;&#x7684;&#x503C;&#x3002;&#x4EA4;&#x53C9;&#x5951;&#x7EA6;&#x901A;&#x8FC7;&#x5408;&#x53D6;&#xFF08;<code>and</code>&#xFF09;&#x7EC4;&#x5408;&#x3002;&#x800C;&#x53D6;&#x53CD;&#x5951;&#x7EA6;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x539F;&#x59CB;&#x7684;&#x5951;&#x7EA6;&#xFF0C;&#x4F46;&#x5BF9;&#x8C13;&#x8BCD;&#x53D6;&#x53CD;&#xFF08;&#x901A;&#x8FC7;<code>not</code>&#xFF09;&#x3002;</p>
<p>&#x5728;&#x5EF6;&#x8FDF;&#x3001;&#x9AD8;&#x9636;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5951;&#x7EA6;&#x7EC4;&#x5408;&#x8981;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x5BF9;&#x6570;&#x5230;&#x6570;&#x7684;&#x51FD;&#x6570;&#x7684;&#x5951;&#x7EA6;&#x8FDB;&#x884C;&#x53D6;&#x53CD;&#x3002;&#x8FD9;&#x91CC;&#x53D6;&#x53CD;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x662F;&#x5426;&#x8868;&#x793A;&#x8BE5;&#x51FD;&#x6570;<strong>&#x4E0D;</strong>&#x5E94;&#x63A5;&#x53D7;&#x6570;&#xFF1F;&#x6216;&#x8005;&#x5982;&#x679C;&#x63A5;&#x53D7;&#x4E86;&#x6570;&#xFF0C;&#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x8FD4;&#x56DE;&#x6570;&#xFF1F;&#x6216;&#x4E24;&#x8005;&#x90FD;&#x8981;&#xFF1F;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x6267;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x5951;&#x7EA6;&#xFF1F;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x4F55;&#x68C0;&#x67E5;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x4E0D;&#x63A5;&#x53D7;&#x6570;&#x2014;&#x2014;&#x662F;&#x5426;&#x671F;&#x671B;&#x5728;&#x7ED9;&#x4E88;&#x6570;&#x65F6;&#x4F1A;&#x4EA7;&#x751F;&#x9519;&#x8BEF;&#xFF1F;&#x4F46;&#x8BF7;&#x8003;&#x8651;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x5951;&#x7EA6;&#x5C01;&#x88C5;&#x7684;&#x6052;&#x7B49;&#x51FD;&#x6570;&#xFF1B;&#x56E0;&#x4E3A;&#x5F53;&#x7ED9;&#x4E88;&#x6570;&#xFF08;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x503C;&#xFF09;&#x65F6;&#xFF0C;&#x5B83;&#x663E;&#x7136;&#x4E0D;&#x4F1A;&#x51FA;&#x9519;&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x610F;&#x5473;&#x7740;&#x5E94;&#x8BE5;&#x7B49;&#x5230;&#x5B83;&#x4EA7;&#x751F;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x786E;&#x5B9E;&#x4EA7;&#x751F;&#x4E86;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x62D2;&#x7EDD;&#x5B83;&#xFF1F;&#x4F46;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x5C06;&#x5728;<strong>&#x672A;</strong>&#x5B9A;&#x4E49;&#x7684;&#x5B9A;&#x4E49;&#x57DF;&#x4E2D;&#x8FD0;&#x884C;&#x51FD;&#x6570;&#xFF1A;&#x663E;&#x7136;&#x8FD9;&#x4F1A;&#x7834;&#x574F;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#x3001;&#x6C61;&#x67D3;&#x5806;&#x6808;&#x3001;&#x6216;&#x4F7F;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x3002;</p>
<p>&#x4EA4;&#x53C9;&#x5951;&#x7EA6;&#x8981;&#x6C42;&#x503C;&#x901A;&#x8FC7;&#x6240;&#x6709;&#x5B50;&#x5951;&#x7EA6;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9AD8;&#x9636;&#x503C;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x5C01;&#x88C5;&#xFF0C;&#x68C0;&#x67E5;&#x6240;&#x6709;&#x5B9A;&#x4E49;&#x57DF;&#x5B50;&#x5951;&#x7EA6;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x503C;&#x57DF;&#x5B50;&#x5951;&#x7EA6;&#x3002;&#x53EA;&#x8981;&#x4E00;&#x4E2A;&#x5B50;&#x5951;&#x7EA6;&#x6CA1;&#x6709;&#x6EE1;&#x8DB3;&#xFF0C;&#x6574;&#x4E2A;&#x4EA4;&#x53C9;&#xFF08;&#x5951;&#x7EA6;&#xFF09;&#x90FD;&#x4F1A;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x8054;&#x5408;&#x5951;&#x7EA6;&#x66F4;&#x52A0;&#x5FAE;&#x5999;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5B50;&#x5951;&#x7EA6;&#x5931;&#x8D25;&#x90FD;&#x4E0D;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x503C;&#x88AB;&#x62D2;&#x7EDD;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E2A;&#x5B50;&#x5951;&#x7EA6;&#x4E0D;&#x518D;&#x662F;&#x6240;&#x5C01;&#x88C5;&#x503C;&#x6240;&#x9075;&#x5B88;&#x7684;&#x5951;&#x7EA6;&#xFF1B;&#x5176;&#x4ED6;&#x5B50;&#x5951;&#x7EA6;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x88AB;&#x9075;&#x5B88;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5B50;&#x5951;&#x7EA6;&#x5019;&#x9009;&#x65F6;&#x624D;&#x62D2;&#x7EDD;&#x503C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8054;&#x5408;&#x5951;&#x7EA6;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x5FC5;&#x987B;&#x8BB0;&#x5F55;&#x54EA;&#x4E9B;&#x5B50;&#x5951;&#x7EA6;&#x901A;&#x8FC7;&#x6216;&#x5931;&#x8D25;&#x2014;&#x2014;&#x8FD9;&#x91CC;&#xFF0C;&#x8BB0;&#x5F55;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8D4B;&#x503C;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x7531;&#x4E8E;&#x6BCF;&#x6761;&#x5B50;&#x5305;&#x5951;&#x7EA6;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x4ECE;&#x5019;&#x9009;&#x540D;&#x5355;&#x5220;&#x9664;&#xFF0C;&#x800C;&#x5269;&#x4E0B;&#x7684;&#x4F1A;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x5F53;&#x6CA1;&#x6709;&#x5019;&#x9009;&#x5B50;&#x5951;&#x7EA6;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x62A5;&#x544A;&#x8FDD;&#x89C4;&#x884C;&#x4E3A;&#x3002;&#x9519;&#x8BEF;&#x62A5;&#x544A;&#x6700;&#x597D;&#x8981;&#x63D0;&#x4F9B;&#x5BFC;&#x81F4;&#x6BCF;&#x4E2A;&#x5B50;&#x5951;&#x7EA6;&#x5931;&#x8D25;&#x7684;&#x5B9E;&#x9645;&#x503C;&#xFF08;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x53EF;&#x80FD;&#x5D4C;&#x5957;&#x5728;&#x591A;&#x5C42;&#x51FD;&#x6570;&#x4E2D;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x5728;&#x7C7B;&#x4F3C;Racket&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x52A0;&#x9501;&#x4EE5;&#x907F;&#x514D;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x3002;</p>
</blockquote>
<p>Racket&#x6240;&#x5B9E;&#x73B0;&#x7684;&#x5951;&#x7EA6;&#x6784;&#x9020;&#x5668;&#x548C;&#x7EC4;&#x5408;&#x5668;&#x5BF9;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x5B50;&#x5951;&#x7EA6;&#x5F62;&#x5F0F;&#x63D0;&#x51FA;&#x4E86;&#x9650;&#x5236;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5B9E;&#x73B0;&#x65E2;&#x6709;&#x6548;&#x7387;&#x53C8;&#x80FD;&#x63D0;&#x4F9B;&#x6709;&#x7528;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E0A;&#x9762;&#x8BA8;&#x8BBA;&#x7684;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x5F88;&#x5C11;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x51FA;&#x73B0;&#x2014;&#x2014;&#x5F53;&#x7136;&#x73B0;&#x5728;&#x5982;&#x679C;&#x9700;&#x8981;&#x4F60;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#x3002;</p>
<h2 id="169-&#x95EE;&#x8D23;">16.9 &#x95EE;&#x8D23;</h2>
<p>&#x672C;&#x8282;&#x56DE;&#x8FC7;&#x5934;&#x8BA8;&#x8BBA;&#x62A5;&#x544A;&#x5951;&#x7EA6;&#x8FDD;&#x53CD;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x6307;&#x7684;&#x4E0D;&#x662F;&#x6253;&#x5370;&#x4EC0;&#x4E48;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x800C;&#x662F;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x62A5;&#x544A;<strong>&#x4EC0;&#x4E48;</strong>&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#xFF0C;&#x6B64;&#x95EE;&#x9898;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8BED;&#x4E49;&#x4E0A;&#x7684;&#x8003;&#x8651;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x4E0A;&#x9762;<code>d/dx</code>&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FD0;&#x884C;&#x3002;&#x5148;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x5B8C;&#x5168;&#x4E0D;&#x5408;&#x9002;&#x7684;<code>string-append</code>&#xFF08;&#x5B83;&#x65E2;&#x4E0D;&#x8BFB;&#x5165;&#x4E5F;&#x4E0D;&#x4EA7;&#x751F;&#x6570;&#xFF09;&#x3002;&#x8FD9;&#x4E48;&#x505A;&#x53EA;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#xFF1A;</p>
<pre><code class="lang-Racket">&gt; (define d/dx-sa (d/dx string-append))
</code></pre>
<p>&#xFF08;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5373;&#x4F7F;&#x6709;&#x5951;&#x7EA6;&#x68C0;&#x67E5;&#xFF0C;&#x8FD9;&#x4E5F;&#x4F1A;&#x901A;&#x8FC7;&#xFF0C;&#x56E0;&#x4E3A;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x7684;&#x5373;&#x65F6;&#x90E8;&#x5206;&#x8BA4;&#x53EF;<code>string-append</code>&#x662F;&#x51FD;&#x6570;&#x3002;&#xFF09;&#x63A5;&#x4E0B;&#x6765;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5C06;<code>d/dx-sa</code>&#x5E94;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x6570;&#xFF0C;&#x8FD9;&#x5E94;&#x662F;&#x6B63;&#x5E38;&#x884C;&#x4E3A;&#xFF1A;</p>
<pre><code class="lang-Racket">&gt; (d/dx-sa 10)
string-append: contract violation
  expected: string?
  given: 10.001
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x9519;&#x8BEF;&#x62A5;&#x544A;&#x4F4D;&#x4E8E;<code>d/dx</code>&#x51FD;&#x6570;&#x4F53;&#x7684;&#x5185;&#x90E8;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x5B8C;&#x5168;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF1A;&#x8FD9;&#x662F;<code>string-append</code>&#x4E0D;&#x6B63;&#x786E;&#x8C03;&#x7528;&#x53D1;&#x751F;&#x7684;&#x5730;&#x65B9;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;<strong>&#x9519;&#x8BEF;</strong>&#x5E76;&#x975E;&#x6765;&#x81EA;<code>d/dx</code>&#xFF0C;&#x800C;&#x6765;&#x81EA;&#x58F0;&#x79F0;<code>string-append</code>&#x662F;&#x5408;&#x6CD5;&#x7684;&#x6570;&#x5230;&#x6570;&#x7684;&#x51FD;&#x6570;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4F46;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x4EE3;&#x7801;&#x65E9;&#x5DF2;&#x9003;&#x4E4B;&#x592D;&#x592D;&#xFF1B;&#x5B83;&#x5DF2;&#x7ECF;&#x4E0D;&#x5728;&#x5806;&#x6808;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x4E0D;&#x5728;&#x4F20;&#x7EDF;&#x9519;&#x8BEF;&#x62A5;&#x544A;&#x673A;&#x5236;&#x7684;&#x8303;&#x56F4;&#x5185;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x662F;<code>d/dx</code>&#x6240;&#x7279;&#x6709;&#x7684;&#xFF1B;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B83;&#x5F88;&#x5E38;&#x89C1;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x2014;&#x2014;&#x5C24;&#x5176;&#x662F;&#x542B;&#x6709;&#x56FE;&#x5F62;&#x3001;&#x7F51;&#x7EDC;&#x548C;&#x5176;&#x4ED6;&#x5916;&#x90E8;&#x63A5;&#x53E3;&#x7684;&#x7CFB;&#x7EDF;&#x2014;&#x2014;&#x4E2D;&#x5927;&#x91CF;&#x4F7F;&#x7528;<strong>&#x56DE;&#x8C03;</strong>&#xFF08;callback&#xFF09;&#xFF1A;&#x5BF9;&#x67D0;&#x4E2A;&#x5B9E;&#x4F53;&#x611F;&#x5174;&#x8DA3;&#x800C;&#x88AB;&#x6CE8;&#x518C;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x6216;&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x8981;&#x53D1;&#x67D0;&#x79CD;&#x72B6;&#x6001;&#x6216;&#x503C;&#x7684;&#x4FE1;&#x53F7;&#x65F6;&#x88AB;&#x8C03;&#x7528;&#x3002;&#xFF08;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;<code>d/dx</code>&#x7B49;&#x4EF7;&#x4E8E;&#x56FE;&#x5F62;&#x5C42;&#xFF0C;&#x800C;<code>string-append</code>&#x7B49;&#x4EF7;&#x4E8E;&#x4F20;&#x7ED9;&#x5B83;&#xFF08;&#x5E76;&#x7531;&#x5B83;&#x5B58;&#x50A8;&#xFF09;&#x7684;&#x56DE;&#x8C03;&#x3002;&#xFF09;&#x6700;&#x7EC8;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C42;&#x4F1A;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#xFF0C;&#x90A3;<strong>&#x65E2;&#x4E0D;&#x662F;</strong>&#x7CFB;&#x7EDF;&#x5C42;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x6536;&#x5230;&#x7684;&#x56DE;&#x8C03;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x7684;&#x5951;&#x7EA6;&#xFF0C;<strong>&#x4E5F;&#x4E0D;&#x662F;</strong>&#x56DE;&#x8C03;&#x672C;&#x8EAB;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x6709;&#x5408;&#x7406;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x53EA;&#x662F;&#x88AB;&#x9519;&#x8BEF;&#x5730;&#x63D0;&#x4F9B;&#x7ED9;&#x51FD;&#x6570;&#x3002;&#x76F8;&#x53CD;&#xFF0C;<strong>&#x9519;&#x8BEF;&#x6765;&#x6E90;&#x4E8E;&#x5F15;&#x5165;&#x8FD9;&#x4E24;&#x8005;&#x7684;&#x5B9E;&#x4F53;</strong>&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6B64;&#x65F6;&#x8C03;&#x7528;&#x6808;&#x53EA;&#x5305;&#x542B;&#x56DE;&#x8C03;&#xFF08;&#x4F4D;&#x4E8E;&#x6808;&#x9876;&#xFF09;&#x548C;&#x7CFB;&#x7EDF;&#xFF08;&#x4F4D;&#x4E8E;&#x5176;&#x4E0B;&#xFF09;&#x2014;&#x2014;&#x552F;&#x4E00;&#x6709;&#x9519;&#x7684;&#x4E00;&#x65B9;&#x4E0D;&#x5728;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x9519;&#x8BEF;&#x56E0;&#x6B64;&#x975E;&#x5E38;&#x96BE;&#x8C03;&#x8BD5;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x662F;&#x6269;&#x5C55;&#x5951;&#x7EA6;&#x7CFB;&#x7EDF;&#xFF0C;&#x7EB3;&#x5165;<strong>&#x95EE;&#x8D23;</strong>&#xFF08;blame&#xFF09;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x60F3;&#x6CD5;&#x662F;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x8BB0;&#x5F55;&#x5C06;&#x4E00;&#x5BF9;&#x7EC4;&#x4EF6;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x90A3;&#x4E2A;&#x5B9E;&#x4F53;&#xFF0C;&#x4EE5;&#x4FBF;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5951;&#x7EA6;&#x8FDD;&#x89C4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5931;&#x8D25;&#x5F52;&#x56E0;&#x4E8E;&#x8BE5;&#x5B9E;&#x4F53;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x53EA;&#x5728;&#x51FD;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x81EA;&#x7136;&#x7684;&#x65B9;&#x5F0F;&#x4E5F;&#x5C06;&#x95EE;&#x8D23;&#x6269;&#x5C55;&#x5230;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#x4E2D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x6709;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x5931;&#x8D25;&#x70B9;&#xFF1A;&#x8981;&#x4E48;&#x5B83;&#x88AB;<strong>&#x7ED9;&#x4E88;&#x4E86;</strong>&#x662F;&#x9519;&#x8BEF;&#x7684;&#x503C;&#xFF08;&#x5148;&#x9A8C;&#x6761;&#x4EF6;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x5B83;<strong>&#x751F;&#x6210;&#x4E86;</strong>&#x9519;&#x8BEF;&#x7684;&#x503C;&#xFF08;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#xFF09;&#x3002;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x524D;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C06;&#x9519;&#x8BEF;&#x5F52;&#x548E;&#x4E8E;&#x73AF;&#x5883;&#x2014;&#x2014;&#x8FD9;&#x91CC;&#xFF0C;&#x4E5F;&#x5373;&#x5B9E;&#x53C2;&#x8868;&#x8FBE;&#x5F0F;&#x2014;&#x2014;&#x800C;&#x5728;&#x540E;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x5047;&#x8BBE;&#x53C2;&#x6570;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#xFF09;&#xFF0C;&#x5219;&#x5E94;&#x5F52;&#x548E;&#x4E8E;&#x51FD;&#x6570;&#x672C;&#x8EAB;&#x3002;&#xFF08;&#x5BF9;&#x5373;&#x65F6;&#x503C;&#x7684;&#x81EA;&#x7136;&#x6269;&#x5C55;&#x662F;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x5BF9;&#x503C;&#x503C;&#x672C;&#x8EAB;&#x4E0D;&#x6EE1;&#x8DB3;&#x5951;&#x7EA6;&#x8FDB;&#x884C;&#x95EE;&#x8D23;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x201C;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#x201D;&#xFF09;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5951;&#x7EA6;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x672F;&#x8BED;<strong>&#x6B63;</strong>&#xFF08;positive&#xFF09;&#x548C;<strong>&#x8D1F;</strong>&#xFF08;negative&#xFF09;&#x4F4D;&#x7F6E;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x9636;&#x51FD;&#x6570;&#xFF0C;&#x8D1F;&#x4F4D;&#x7F6E;&#x662F;&#x5148;&#x9A8C;&#x6761;&#x4EF6;&#xFF0C;&#x6B63;&#x4F4D;&#x7F6E;&#x662F;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#x3002;&#x8FD9;&#x4E48;&#x770B;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x989D;&#x5916;&#x672F;&#x8BED;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x672F;&#x8BED;&#x5177;&#x6709;&#x66F4;&#x4E00;&#x822C;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5C06;&#x60C5;&#x51B5;&#x63A8;&#x5E7F;&#x5230;&#x5951;&#x7EA6;&#x7684;&#x53C2;&#x6570;&#x3002;&#x4E4B;&#x524D;&#xFF0C;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#x8BFB;&#x5165;&#x4E00;&#x4E2A;&#x8C13;&#x8BCD;&#xFF0C;&#x800C;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x8BFB;&#x5165;&#x5B9A;&#x4E49;&#x57DF;&#x548C;&#x503C;&#x57DF;&#x7684;&#x5951;&#x7EA6;&#x3002;&#x8FD9;&#x70B9;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x4E0D;&#x8FC7;&#x5B83;&#x4EEC;&#x8FD4;&#x56DE;&#x7684;&#x5C06;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x6B64;&#x51FD;&#x6570;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x6B63;&#x8D1F;&#x4F4D;&#x7F6E;&#x7684;&#x6807;&#x7B7E;&#x3002;&#xFF08;&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x5408;&#x7406;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x8282;&#x70B9;&#x3001;&#x7F13;&#x51B2;&#x533A;&#x504F;&#x79FB;&#x91CF;&#x3001;&#x6216;&#x5176;&#x4ED6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#xFF09;&#x8FD9;&#x6837;&#xFF0C;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x5C06;&#x95ED;&#x5305;&#x4E8E;&#x7A0B;&#x5E8F;&#x4F4D;&#x7F6E;&#x6807;&#x7B7E;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x6765;&#x5BF9;&#x975E;&#x6CD5;&#x51FD;&#x6570;&#x7684;&#x63D0;&#x4F9B;&#x65B9;&#x8FDB;&#x884C;&#x95EE;&#x8D23;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x7531;<code>guard</code>&#x51FD;&#x6570;&#x8D1F;&#x8D23;&#x4F20;&#x5165;&#x5951;&#x7EA6;&#x8C03;&#x7528;&#x4F4D;&#x7F6E;&#x7684;&#x6807;&#x7B7E;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (guard ctc val pos neg) ((ctc pos neg) val))
</code></pre>
<p>&#x7531;<code>blame</code>&#x663E;&#x793A;&#x5408;&#x9002;&#x7684;&#x6807;&#x7B7E;&#xFF08;&#x7531;&#x5951;&#x7EA6;&#x5B9E;&#x73B0;&#x4F20;&#x7ED9;&#x5B83;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (blame s) (error &apos;contract s))
</code></pre>
<p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#xFF0C;&#x4FDD;&#x62A4;<code>add1</code>&#x7684;&#x4F7F;&#x7528;&#x3002;&#x6B63;&#x8D1F;&#x4F4D;&#x7F6E;&#x7528;&#x4EC0;&#x4E48;&#x540D;&#x5B57;&#x6709;&#x610F;&#x4E49;&#x5462;&#xFF1F;&#x6B63;&#x4F4D;&#x7F6E;&#x662F;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#xFF1A;&#x8FD9;&#x91CC;&#x7684;&#x4EFB;&#x4F55;&#x5931;&#x8D25;&#x90FD;&#x5FC5;&#x987B;&#x5F52;&#x548E;&#x4E8E;<code>add1</code>&#x7684;&#x51FD;&#x6570;&#x4F53;&#x3002;&#x8D1F;&#x4F4D;&#x7F6E;&#x662F;&#x5148;&#x9A8C;&#x6761;&#x4EF6;&#xFF1A;&#x8FD9;&#x91CC;&#x7684;&#x4EFB;&#x4F55;&#x5931;&#x8D25;&#x90FD;&#x5FC5;&#x987B;&#x5F52;&#x548E;&#x4E8E;<code>add1</code>&#x7684;&#x53C2;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF1A;</p>
<pre><code class="lang-Racket">(define a1 (guard (function (immediate number?)
                            (immediate number?))
                  add1
                  &quot;add1 body&quot; ;add1&#x51FD;&#x6570;&#x4F53;
                  &quot;add1 input&quot;)) ;add1&#x7684;&#x8F93;&#x5165;
</code></pre>
<p>&#x5047;&#x8BBE;&#x4F20;&#x7ED9;<code>guard</code>&#x7684;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x671F;&#x671B;&#x5728;&#x201C;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#x201D;&#x4F4D;&#x7F6E;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF1A;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x8C03;&#x7528;&#x7684;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x4E0D;&#x80FD;&#x53BB;&#x6307;&#x8D23;&#x53C2;&#x6570;&#x3002;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x8868;&#x660E;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x6269;&#x5C55;&#x4E86;&#x672F;&#x8BED;&#x201C;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#x201D;&#xFF0C;&#x66F4;&#x5408;&#x7406;&#x5730;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x672F;&#x8BED;&#x201C;&#x6B63;&#xFF08;&#x4F4D;&#x7F6E;&#xFF09;&#x201D;&#x3002;&#xFF09;&#x56E0;&#x4E3A;&#x76F8;&#x4FE1;<code>add1</code>&#x7684;&#x5B9E;&#x73B0;&#x53EA;&#x4F1A;&#x8FD4;&#x56DE;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9884;&#x8BA1;&#x5B83;&#x4E0D;&#x53EF;&#x80FD;&#x8BA9;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#x5931;&#x8D25;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x50CF;<code>(a1 &quot;x&quot;)</code>&#x8FD9;&#x6837;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x89E6;&#x53D1;&#x5148;&#x9A8C;&#x6761;&#x4EF6;&#x9519;&#x8BEF;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;<code>&quot;add1 input&quot;</code>&#x4F4D;&#x7F6E;&#x5904;&#x53D1;&#x51FA;&#x5951;&#x7EA6;&#x9519;&#x8BEF;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4FDD;&#x62A4;&#x7684;&#x51FD;&#x6570;&#x8FDD;&#x53CD;&#x4E86;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x6837;&#xFF0C;</p>
<pre><code class="lang-Racket">(define bad-a1 (guard (function (immediate number?)
                                (immediate number?))
                      number-&gt;string
                      &quot;bad-add1 body&quot;
                      &quot;bad-add1 input&quot;))
</code></pre>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5C06;&#x8D23;&#x4EFB;&#x88AB;&#x5F52;&#x548E;&#x4E8E;<code>&quot;bad-add1 body&quot;</code>&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x5951;&#x7EA6;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#x5E94;&#x95EE;&#x8D23;&#x6B63;&#x4F4D;&#x7F6E;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (immediate pred?)
  (lambda (pos neg)
    (lambda (val)
      (if (pred? val) val (blame pos)))))
</code></pre>
<p>&#x5BF9;&#x4E8E;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x60F3;&#x8FD9;&#x4E48;&#x5199;</p>
<pre><code class="lang-Racket">(define (function dom rng)
  (lambda (pos neg)
    (lambda (val)
      (if (procedure? val)
          (lambda (x) (dom (val (rng x))))
          (blame pos)))))
</code></pre>
<p>&#x4F46;&#x662F;&#x8FD9;&#x6839;&#x672C;&#x4E0D;&#x80FD;&#x8FD0;&#x4F5C;&#xFF1A;&#x5B83;&#x8FDD;&#x53CD;&#x4E86;&#x5951;&#x7EA6;&#x6240;&#x9884;&#x671F;&#x7684;&#x7B7E;&#x540D;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x73B0;&#x5728;&#x6240;&#x6709;&#x5951;&#x7EA6;&#x90FD;&#x671F;&#x671B;&#x8F93;&#x5165;&#x6B63;&#x8D1F;&#x4F4D;&#x7F6E;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;<code>dom</code>&#x548C;<code>rng</code>&#x4E0D;&#x80FD;&#x50CF;&#x4E0A;&#x9762;&#x90A3;&#x6837;&#x4F7F;&#x7528;&#x3002;&#xFF08;&#x53E6;&#x4E00;&#x4E2A;&#x7406;&#x7531;&#xFF0C;&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#x7528;&#x5230;&#x4E86;<code>pos</code>&#xFF0C;&#x4F46;&#x5B8C;&#x5168;&#x4E0D;&#x542B;<code>neg</code>&#xFF0C;&#x5C3D;&#x7BA1;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x8FC7;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8D23;&#x4EFB;&#x5FC5;&#x987B;&#x5F52;&#x548E;&#x4E8E;<code>neg</code>&#x6240;&#x7ED1;&#x5B9A;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#xFF09;&#x6240;&#x4EE5;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;<code>pos</code>&#x548C;<code>neg</code>&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x503C;&#x57DF;&#x548C;&#x5B9A;&#x4E49;&#x57DF;&#x5951;&#x7EA6;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x4EEC;&#x201C;&#x77E5;&#x9053;&#x201D;&#x548C;&#x201C;&#x8BB0;&#x4F4F;&#x201D;&#x53EF;&#x80FD;&#x8C03;&#x7528;&#x975E;&#x6CD5;&#x51FD;&#x6570;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x6700;&#x663E;&#x7136;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x7528;&#x76F8;&#x540C;&#x7684;<code>dom</code>&#x548C;<code>rng</code>&#x503C;&#x5B9E;&#x4F8B;&#x5316;&#x8FD9;&#x4E9B;&#x5951;&#x7EA6;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (function dom rng)
  (lambda (pos neg)
    (let ([dom-c (dom pos neg)]
          [rng-c (rng pos neg)])
      (lambda (val)
        (if (procedure? val)
            (lambda (x) (rng-c (val (dom-c x))))
            (blame pos))))))
</code></pre>
<p>&#x73B0;&#x5728;&#x6240;&#x6709;&#x7B7E;&#x540D;&#x90FD;&#x5339;&#x914D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5951;&#x7EA6;&#x4E86;&#x3002;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x65F6;&#xFF0C;&#x8FD4;&#x56DE;&#x4E0D;&#x592A;&#x5BF9;&#x52B2;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x6700;&#x7B80;&#x5355;&#x7684;&#x8FDD;&#x53CD;&#x5951;&#x7EA6;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD4;&#x56DE;&#x662F;</p>
<pre><code class="lang-Racket">&gt; (a1 &quot;x&quot;)
contract: add1 body
</code></pre>
<p>&#x54A6;&#xFF1F;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C55;&#x5F00;<code>a1</code>&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6765;&#x770B;&#x770B;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x3002;</p>
<pre><code class="lang-Racket">  (a1 &quot;x&quot;)
= (guard (function (immediate number?)
                   (immediate number?))
         add1
         &quot;add1 body&quot;
         &quot;add1 input&quot;)
= (((function (immediate number?) (immediate number?))
    &quot;add1 body&quot; &quot;add1 input&quot;)
   add1)
= (let ([dom-c ((immediate number?) &quot;add1 body&quot; &quot;add1 input&quot;)]
        [rng-c ((immediate number?) &quot;add1 body&quot; &quot;add1 input&quot;)])
    (lambda (x) (rng-c (add1 (dom-c x)))))
= (let ([dom-c (lambda (val)
                 (if (number? val) val (blame &quot;add1 body&quot;)))]
        [rng-c (lambda (val)
                 (if (number? val) val (blame &quot;add1 body&quot;)))])
    (lambda (x) (rng-c (add1 (dom-c x)))))
</code></pre>
<p>&#x53EF;&#x601C;&#x7684;<code>add1</code>&#xFF1A;&#x5B83;&#x90FD;&#x6CA1;&#x6709;&#x83B7;&#x5F97;&#x673A;&#x4F1A;&#xFF01;&#x5269;&#x4E0B;&#x7684;&#x552F;&#x4E00;&#x95EE;&#x8D23;&#x6807;&#x7B7E;&#x662F;<code>&quot;add1 body&quot;</code>&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x5F52;&#x548E;&#x4E8E;&#x5B83;&#x4E86;&#x3002;</p>
<p>&#x7B49;&#x4E0B;&#x4F1A;&#x8BA8;&#x8BBA;&#x6B64;&#x95EE;&#x9898;&#xFF0C;&#x5148;&#x6765;&#x89C2;&#x5BDF;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5176;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x7684;&#x8E2A;&#x8FF9;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x7684;&#x53EA;&#x662F;&#x5373;&#x65F6;&#x5951;&#x7EA6;&#xFF0C;&#x5F53;&#x5B9E;&#x9645;&#x503C;&#xFF08;&#x5982;&#x679C;&#xFF09;&#x53D1;&#x751F;&#x65F6;&#x8FDB;&#x884C;&#x95EE;&#x8D23;&#x3002;&#x8FD9;&#x4E0E;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x6240;&#x8BF4;<a href="chap16.html#163-&#x9AD8;&#x9636;&#x5951;&#x7EA6;">&#x53EA;&#x80FD;&#x89C2;&#x6D4B;&#x5230;&#x5373;&#x65F6;&#x503C;</a>&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x53EA;&#x9002;&#x7528;&#x4E8E;&#x4E00;&#x9636;&#x51FD;&#x6570;&#xFF1B;&#x5F53;&#x9047;&#x5230;&#x9AD8;&#x9636;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x8FD9;&#x4E0D;&#x518D;&#x6210;&#x7ACB;&#x3002;</p>
<p>&#x9519;&#x5728;&#x54EA;&#x91CC;&#xFF1F;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5728;<code>add1</code>&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#x53EA;&#x6709;&#x7ED1;&#x5B9A;&#x5230;<code>rng-c</code>&#x7684;&#x5951;&#x7EA6;&#x5E94;&#x8BE5;&#x88AB;&#x95EE;&#x8D23;&#x3002;&#x76F8;&#x53CD;&#xFF0C;<code>add1</code>&#x7684;&#x8F93;&#x5165;&#x4E2D;&#x5E94;&#x8BE5;&#x88AB;&#x95EE;&#x8D23;&#x7684;&#x662F;&#x7ED1;&#x5B9A;&#x5230;<code>dom-c</code>&#x7684;&#x5951;&#x7EA6;&#x3002;&#x770B;&#x8D77;&#x6765;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x7684;&#x5B9A;&#x4E49;&#x57DF;&#x4F4D;&#x7F6E;&#xFF0C;&#x6B63;&#x8D1F;&#x6807;&#x7B7E;&#x9700;&#x8981;&#x2026;&#x2026;&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5951;&#x7EA6;&#x4FDD;&#x62A4;&#x7684;<code>d/dx</code>&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x60C5;&#x51B5;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#x3002;&#x5173;&#x952E;&#x7684;&#x89C1;&#x89E3;&#x662F;&#xFF0C;&#x5F53;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x201C;&#x5916;&#x90E8;&#x201D;&#x6210;&#x4E3A;&#x201C;&#x5185;&#x90E8;&#x201D;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;<code>d/dx</code>&#x7684;&#x51FD;&#x6570;&#x4F53;&#x2014;&#x2014;&#x5904;&#x4E8E;&#x6B63;&#x4F4D;&#x7F6E;&#x2014;&#x2014;&#x8C03;&#x7528;&#x4E86;&#x88AB;&#x6C42;&#x5FAE;&#x5206;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x51FD;&#x6570;&#x4F53;&#x7F6E;&#x4E8E;&#x6B63;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x5C06;&#x8C03;&#x7528;&#x8005;&#x2014;&#x2014;<code>d/dx</code>&#x7684;&#x51FD;&#x6570;&#x4F53;&#x2014;&#x2014;&#x7F6E;&#x4E8E;&#x8D1F;&#x4F4D;&#x7F6E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5951;&#x7EA6;&#x7684;&#x5B9A;&#x4E49;&#x57DF;&#x4E00;&#x4FA7;&#xFF0C;&#x6BCF;&#x6B21;&#x5D4C;&#x5957;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6B63;&#x8D1F;&#x4F4D;&#x7F6E;&#x4EA4;&#x6362;&#x3002;</p>
<p>&#x503C;&#x57DF;&#x4E00;&#x4FA7;&#x65E0;&#x9700;&#x4EA4;&#x6362;&#x3002;&#x7EE7;&#x7EED;&#x8003;&#x8651;<code>d/dx</code>&#x3002;&#x5B83;&#x8FD4;&#x56DE;&#x7684;&#x51FD;&#x6570;&#x4EE3;&#x8868;&#x5BFC;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x662F;&#x6570;&#xFF08;&#x4EE3;&#x8868;&#x8BA1;&#x7B97;&#x5BFC;&#x6570;&#x7684;&#x70B9;&#xFF09;&#xFF0C;&#x8FD4;&#x56DE;&#x4E5F;&#x662F;&#x6570;&#xFF08;&#x8BE5;&#x70B9;&#x7684;&#x5BFC;&#x6570;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x8D1F;&#x4F4D;&#x7F6E;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x5FAE;&#x5206;&#x51FD;&#x6570;&#x7684;&#x5BA2;&#x6237;&#x2014;&#x2014;&#x5373;&#x5148;&#x9A8C;&#x6761;&#x4EF6;&#x2014;&#x2014;&#x6B63;&#x4F4D;&#x7F6E;&#x5C31;&#x662F;<code>d/dx</code>&#x672C;&#x8EAB;&#x2014;&#x2014;&#x5373;&#x540E;&#x9A8C;&#x6761;&#x4EF6;&#x2014;&#x2014;&#x56E0;&#x4E3A;&#x5B83;&#x8D1F;&#x8D23;&#x751F;&#x6210;&#x5BFC;&#x6570;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x66F4;&#x6B63;&#x7684;&#x3001;&#x6B63;&#x786E;&#x7684;&#x51FD;&#x6570;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (function dom rng)
  (lambda (pos neg)
    (let ([dom-c (dom neg pos)]
          [rng-c (rng pos neg)])
      (lambda (val)
        (if (procedure? val)
            (lambda (x) (rng-c (val (dom-c x))))
            (blame pos))))))
</code></pre>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x5C06;&#x6B64;&#x5E94;&#x7528;&#x4E8E;&#x4E4B;&#x524D;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x786E;&#x8BA4;&#x5F97;&#x5230;&#x7684;&#x95EE;&#x8D23;&#x7B26;&#x5408;&#x9884;&#x671F;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x624B;&#x52A8;&#x5C55;&#x5F00;&#x4EE3;&#x7801;&#x4EE5;&#x4E86;&#x89E3;&#x4E3A;&#x4F55;&#x3002;</p>
</blockquote>
<p>&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;<code>d/dx</code>&#x7684;&#x6B63;&#x4F4D;&#x7F6E;&#x6807;&#x7B7E;&#x4E3A;<code>&quot;d/dx body&quot;</code>&#xFF0C;&#x8D1F;&#x4F4D;&#x7F6E;&#x6807;&#x7B7E;&#x4E3A;<code>&quot;d/dx input&quot;</code>&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x4F20;&#x7ED9;&#x5B83;&#x51FD;&#x6570;<code>number-&gt;string</code>&#xFF08;&#x6B64;&#x51FD;&#x6570;&#x660E;&#x663E;&#x65E0;&#x6CD5;&#x8BA1;&#x7B97;&#x5BFC;&#x6570;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7ED3;&#x679C;&#x5E94;&#x7528;&#x4E8E;<code>10</code>&#xFF1A;</p>
<pre><code class="lang-Racket">((d/dx (guard (function (immediate number?)
                        (immediate string?))
              number-&gt;string
              &quot;n-&gt;s body&quot;
              &quot;n-&gt;s input&quot;))
 10)
</code></pre>
<p>&#x8FD9;&#x6B63;&#x786E;&#x5730;&#x8868;&#x660E;&#xFF0C;&#x5E94;&#x8BE5;&#x5F52;&#x548E;&#x4E8E;&#x5C06;<code>number-&gt;string</code>&#x5047;&#x5B9A;&#x4E3A;&#x6570;&#x51FD;&#x6570;&#x63D0;&#x4F9B;&#x7ED9;<code>d/dx</code>&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x2014;&#x2014;&#x800C;&#x4E0D;&#x662F;<code>d/dx</code>&#x672C;&#x8EAB;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x624B;&#x5DE5;&#x8BA1;&#x7B97;<code>d/dx</code>&#xFF0C;&#x5C06;&#x5176;&#x4F5C;&#x7528;&#x4E8E;<strong>&#x6240;&#x6709;</strong>&#x76F8;&#x5173;&#x7684;&#x8FDD;&#x89C4;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x786E;&#x8BA4;&#x7531;&#x6B64;&#x4EA7;&#x751F;&#x7684;&#x95EE;&#x8D23;&#x662F;&#x51C6;&#x786E;&#x7684;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;<code>string-&gt;number</code>&#x4F20;&#x7ED9;<code>d/dx</code>&#xFF0C;&#x9644;&#x5E26;&#x51FD;&#x6570;&#x5951;&#x7EA6;&#x6307;&#x660E;&#x5B83;&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x6620;&#x5C04;&#x5230;&#x6570;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x5728;&#x6CA1;&#x6709;&#x5951;&#x7EA6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F20;&#x5165;&#x76F8;&#x540C;&#x7684;&#x51FD;&#x6570;&#x5462;&#xFF1F;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap15.html" class="navigation navigation-prev " aria-label="Previous page: 15. 静态地检查程序中的不变量：类型">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap17.html" class="navigation navigation-next " aria-label="Next page: 17. 其他调用语义">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"16. 动态地检查程序中的不变量：契约","level":"1.17","depth":1,"next":{"title":"17. 其他调用语义","level":"1.18","depth":1,"path":"chap17.md","ref":"chap17.md","articles":[]},"previous":{"title":"15. 静态地检查程序中的不变量：类型","level":"1.16","depth":1,"path":"chap15.md","ref":"chap15.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-76420995-1"},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc; MrMathematica","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap16.md","mtime":"2018-09-28T07:36:04.700Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-28T07:36:08.800Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

