
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3. 解释器初窥 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="lotuc">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap4.html" />
    
    
    <link rel="prev" href="chap2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                    1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                    2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                    3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                    4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                    5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                    6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                    7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                    8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                    9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >3. 解释器初窥</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="3-&#x89E3;&#x91CA;&#x5668;&#x521D;&#x7AA5;">3 &#x89E3;&#x91CA;&#x5668;&#x521D;&#x7AA5;</h1>
<p>&#x73B0;&#x5728;&#x6709;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x64CD;&#x7EB5;&#x5B83;&#x4EEC;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x60F3;&#x628A;&#x7A0B;&#x5E8F;&#x6253;&#x5370;&#x7684;&#x6F02;&#x4EAE;&#x70B9;&#xFF08;pretty-print&#xFF09;&#xFF0C;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x6210;&#x5176;&#x5B83;&#x683C;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x7F16;&#x8BD1;&#xFF09;&#xFF0C;&#x67E5;&#x770B;&#x5176;&#x662F;&#x5426;&#x7B26;&#x5408;&#x7279;&#x5B9A;&#x5C5E;&#x6027;&#xFF08;&#x6821;&#x9A8C;&#xFF09;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x4E13;&#x6CE8;&#x4E8E;&#x8003;&#x8651;&#x5F97;&#x5230;&#x5176;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x2014;&#x2014;&#x8BA1;&#x7B97;&#xFF08;evaluation&#xFF09;&#x2014;&#x2014;&#x5C06;&#x7A0B;&#x5E8F;&#x89C4;&#x7EA6;&#x6210;&#x503C;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x7B97;&#x672F;&#x8BED;&#x8A00;&#x5199;&#x4E2A;<strong>&#x89E3;&#x91CA;&#x5668;</strong>&#x5F62;&#x5F0F;&#x7684;&#x6C42;&#x503C;&#x5668;&#x3002;&#x9009;&#x62E9;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x662F;&#x51FA;&#x4E8E;&#x4E0B;&#x9762;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF1A;&#xFF08;a&#xFF09;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x8BA1;&#x7B97;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x5176;&#x5B9E;&#x73B0;&#xFF1B;&#xFF08;b&#xFF09;&#x57FA;&#x672C;&#x4E0A;&#x6BCF;&#x95E8;&#x8BED;&#x8A00;&#x90FD;&#x4F1A;&#x5305;&#x542B;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x5B83;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x8BED;&#x8A00;&#x7684;&#x6269;&#x5C55;&#xFF1B;&#xFF08;c&#xFF09;&#x8BE5;&#x95EE;&#x9898;&#x5927;&#x5C0F;&#x5408;&#x9002;&#xFF0C;&#x8DB3;&#x4EE5;&#x5C55;&#x793A;&#x6211;&#x4EEC;&#x8981;&#x5B66;&#x4E60;&#x7684;&#x5F88;&#x591A;&#x8981;&#x70B9;&#x3002;</p>
<h2 id="31-&#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8868;&#x793A;">3.1 &#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8868;&#x793A;</h2>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x9700;&#x8981;&#x7EDF;&#x4E00;&#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8868;&#x793A;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x53EA;&#x6253;&#x7B97;&#x652F;&#x6301;&#x4E24;&#x4E2A;&#x8FD0;&#x7B97;&#x7B26;&#x2014;&#x2014;&#x52A0;&#x6CD5;&#x548C;&#x4E58;&#x6CD5;&#x2014;&#x2014;&#x4EE5;&#x53CA;&#x57FA;&#x672C;&#x7684;&#x6570;&#x3002;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x4E1C;&#x897F;&#x6765;&#x8868;&#x8FBE;&#x7B97;&#x672F;<strong>&#x8868;&#x8FBE;&#x5F0F;</strong>&#x3002;&#x7B97;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5D4C;&#x5957;&#x89C4;&#x5219;&#x662F;&#x5565;&#x5462;&#xFF1F;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x5730;&#x5D4C;&#x5957;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x628A;&#x9664;&#x6CD5;&#x4E5F;&#x5305;&#x62EC;&#x8FDB;&#x6765;&#x5462;&#xFF1F;&#x8FD9;&#x4E48;&#x505A;&#x5BF9;&#x524D;&#x6587;&#x603B;&#x7ED3;&#x4F1A;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#xFF1F;</p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#x4E0D;&#x5305;&#x62EC;&#x9664;&#x6CD5;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x4E0D;&#x6253;&#x7B97;&#x8BA8;&#x8BBA;&#x4EC0;&#x4E48;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x5408;&#x6CD5;&#x7684;&#x3002;&#x663E;&#x7136;1&#x9664;&#x4EE5;2&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x4F46;&#x662F;1&#x9664;&#x4EE5;0&#x5C31;&#x6709;&#x4E89;&#x8BAE;&#x4E86;&#x3002;1&#x9664;&#x4EE5;&#xFF08;1&#x51CF;&#x53BB;1&#xFF09;&#x5C31;&#x66F4;&#x6709;&#x4E89;&#x8BAE;&#x4E86;&#x3002;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x9677;&#x5165;&#x8FD9;&#x79CD;&#x77DB;&#x76FE;&#xFF0C;&#x4EE5;&#x540E;&#x518D;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF1A;</p>
<pre><code class="lang-racket">(define-type ArithC  ;&#x5177;&#x4F53;&#x7B97;&#x672F;
  [numC (n : number)]
  [plusC (l : ArithC) (r : ArithC)]
  [multC (l : ArithC) (r : ArithC)])
</code></pre>
<h2 id="32-&#x5199;&#x4E2A;&#x89E3;&#x91CA;&#x5668;">3.2 &#x5199;&#x4E2A;&#x89E3;&#x91CA;&#x5668;</h2>
<p>&#x4E0B;&#x9762;&#x5F00;&#x59CB;&#x5199;&#x8BE5;&#x7B97;&#x672F;&#x8BED;&#x8A00;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x8BE5;&#x89E3;&#x91CA;&#x5668;&#x7684;&#x7C7B;&#x578B;&#xFF1A;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x663E;&#x7136;&#x662F;<code>ArithC</code>&#x503C;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5462;&#xFF1F;&#x5F53;&#x7136;&#x662F;&#x6570;&#x5566;&#x3002;&#x5373;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x662F;&#x8F93;&#x5165;&#x4E3A;<code>ArithC</code>&#x8F93;&#x51FA;&#x4E3A;&#x6570;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x4E3A;&#x8BE5;&#x89E3;&#x91CA;&#x5668;&#x5199;&#x4E00;&#x4E9B;&#x6D4B;&#x8BD5;&#x6848;&#x4F8B;&#x3002;</p>
</blockquote>
<p>&#x7531;&#x4E8E;&#x8F93;&#x5165;&#x7C7B;&#x578B;&#x662F;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x4E5F;&#x5E94;&#x8BE5;&#x9012;&#x5F52;&#x5730;&#x5904;&#x7406;&#x8F93;&#x5165;&#x3002;&#x7A0B;&#x5E8F;&#x6A21;&#x677F;&#x5982;&#x4E0B;&#xFF1A;&#x3010;&#x6CE8;&#x91CA;&#x3011;</p>
<pre><code class="lang-racket">(define (interp [a : ArithC]) : number
  (type-case ArithC a
             [numC (n) n]
             [plusC (l r) ...]
             [multC (l r) ...]))
</code></pre>
<blockquote>
<p>&#x300A;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x300B;&#x4E00;&#x4E66;&#xFF08;&#x53C8;&#x8BD1;&#x300A;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x7A0B;&#x5E8F;&#x300B;&#xFF09;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x6A21;&#x677F;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x3002;</p>
</blockquote>
<p>&#x4F60;&#x5F88;&#x53EF;&#x80FD;&#x60F3;&#x5F53;&#x7136;&#x7684;&#x76F4;&#x63A5;&#x5199;&#x51FA;&#x5982;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-racket">(define (interp [a : ArithC]) : number
  (type-case ArithC a
             [numC (n) n]
             [plusC (l r) (+ l r)]
             [multC (l r) (* l r)]))
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x4F60;&#x80FD;&#x627E;&#x5230;&#x5176;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x8865;&#x5145;&#x6A21;&#x677F;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-racket">(define (interp [a : ArithC]) : number
  (type-case ArithC a
             [numC (n) n]
             [plusC (l r) ... (interp l) ... (interp r) ...]
             [multC (l r) ... (interp l) ... (interp r) ...]))
</code></pre>
<p>&#x586B;&#x5145;&#x5FC5;&#x8981;&#x90E8;&#x5206;&#x5F97;&#x5230;&#x89E3;&#x91CA;&#x5668;&#xFF1A;</p>
<pre><code class="lang-racket">(define (interp [a : ArithC]) : number
  (type-case ArithC a
             [numC (n) n]
             [plusC (l r) (+ (interp l) (interp r))]
             [multC (l r) (* (interp l) (interp r))]))
</code></pre>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#xFF01;&#x6211;&#x77E5;&#x9053;&#x6709;&#x70B9;&#x864E;&#x5934;&#x86C7;&#x5C3E;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4FDD;&#x8BC1;&#xFF0C;&#x5B83;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x3002;</p>
<h2 id="33-&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x5417;&#xFF1F;">3.3 &#x4F60;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x5417;&#xFF1F;</h2>
<p>&#x6709;&#x4EF6;&#x4E8B;&#x60C5;&#x6211;&#x6CA1;&#x548C;&#x4F60;&#x8BB2;&#x6E05;&#x695A;&#xFF1A;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x52A0;&#x6CD5;&#x548C;&#x4E58;&#x6CD5;&#x7684;&#x201C;&#x610F;&#x4E49;&#x201D;&#x662F;&#x5565;&#xFF1F;</p>
</blockquote>
<p>&#x592A;&#x62BD;&#x8C61;&#x4E86;&#xFF0C;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x8BA9;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x53D8;&#x5F97;&#x66F4;&#x5177;&#x4F53;&#x4E00;&#x4E9B;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x52A0;&#x6CD5;&#xFF1A;</p>
<ul>
<li><p>&#x9996;&#x5148;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6570;&#xFF1A;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;32&#x4F4D;&#xFF09;&#x6574;&#x6570;&#xFF0C;&#x5E26;&#x7B26;&#x53F7;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;31&#x4F4D;&#x5916;&#x52A0;1&#x4E2A;&#x7B26;&#x53F7;&#x4F4D;&#xFF09;&#x6574;&#x6570;&#xFF0C;&#x4EFB;&#x610F;&#x7CBE;&#x5EA6;&#x6574;&#x6570;&#xFF1B;&#x5728;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6709;&#x7406;&#x6570;&#xFF1B;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#x7684;&#x56FA;&#x5B9A;&#x4F4D;&#x6570;&#x6D6E;&#x70B9;&#x6570;&#xFF1B;&#x5728;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x590D;&#x6570;&#xFF1B;&#x5982;&#x6B64;&#x7B49;&#x7B49;&#x3002;&#x5728;&#x786E;&#x5B9A;&#x6570;&#x7C7B;&#x578B;&#x4E4B;&#x540E;&#xFF0C;&#x52A0;&#x6CD5;&#x53EF;&#x80FD;&#x53EA;&#x652F;&#x6301;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7EC4;&#x5408;&#x3002;</p>
</li>
<li><p>&#x5176;&#x6B21;&#xFF0C;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x67D0;&#x4E9B;&#xFF08;&#x5176;&#x4ED6;&#xFF09;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x52A0;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x77E9;&#x9635;&#x52A0;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x518D;&#x6B21;&#xFF0C;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x5B57;&#x7B26;&#x4E32;&#x201C;&#x76F8;&#x52A0;&#x201D;&#x3002;&#x8FD9;&#x91CC;&#x5F15;&#x53F7;&#x8868;&#x793A;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x6570;&#x5B66;&#x4E0A;&#x76F8;&#x52A0;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x8BED;&#x6CD5;&#x4E0A;&#x7528;+&#x7B26;&#x53F7;&#x8868;&#x793A;&#x64CD;&#x4F5C;&#x3002;&#x6709;&#x7684;&#x8BED;&#x8A00;&#x7528;&#x8FD9;&#x8868;&#x793A;&#x5B57;&#x7B26;&#x4E32;&#x62FC;&#x63A5;&#xFF1B;&#x4E5F;&#x6709;&#x8BED;&#x8A00;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x8FD4;&#x56DE;&#x6570;&#xFF08;&#x6BD4;&#x5982;&#x628A;&#x5B57;&#x7B26;&#x4E32;&#x6240;&#x8868;&#x793A;&#x7684;&#x6570;&#x76F8;&#x52A0;&#xFF09;&#x3002;</p>
</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x52A0;&#x6CD5;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x4E0D;&#x540C;&#x542B;&#x4E49;&#x3002;<strong>&#x8BED;&#x4E49;</strong>&#x662F;&#x628A;&#x8BED;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;+&#xFF09;&#x6620;&#x5C04;&#x5230;&#x542B;&#x4E49;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0A;&#x5217;&#x4E3E;&#x7684;&#x90E8;&#x5206;&#x6216;&#x8005;&#x6240;&#x6709;&#xFF09;&#x3002;</p>
<p><strong>&#x4E8E;&#x662F;&#x6E38;&#x620F;&#x6765;&#x4E86;&#xFF1A;&#x4EE5;&#x4E0B;&#x54EA;&#x4E9B;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF1F;</strong></p>
<ul>
<li><p>1 + 2</p>
</li>
<li><p>1 + 2</p>
</li>
<li><p>&#x2019;1&#x2019; + &#x2019;2&#x2019;</p>
</li>
<li><p>&#x2019;1&#x2019; + &#x2019;2&#x2019;</p>
</li>
</ul>
<p>&#x56DE;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x8BED;&#x4E49;&#x662F;&#x5565;&#xFF1F;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x4E86;Racket&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x76F4;&#x63A5;&#x628A;+&#x6620;&#x5C04;&#x5230;&#x4E86;Racket&#x7684;+&#x4E0A;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x5BF9;&#x7684;&#xFF1A;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5982;&#x679C;Racket&#x7684;<code>+</code>&#x4E5F;&#x652F;&#x6301;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x63D0;&#x4F9B;&#x7684;&#x64CD;&#x4F5C;&#x5C31;&#x9650;&#x5236;+&#x53EA;&#x80FD;&#x7528;&#x5728;&#x6570;&#x4E0A;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;Racket&#x7684;<code>+</code>&#x5E76;&#x4E0D;&#x652F;&#x6301;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x4FEE;&#x6539;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x52A0;&#x6CD5;&#x80FD;&#x652F;&#x6301;&#x5E26;&#x7B26;&#x53F7;32&#x4F4D;&#x6570;&#x7684;&#x7B97;&#x672F;?</p>
</blockquote>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x907F;&#x514D;&#x7B80;&#x5355;&#x7684;&#x501F;&#x7528;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x4E49;&#x3002;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x3002;</p>
<h2 id="34-&#x6269;&#x5C55;&#x6B64;&#x8BED;&#x8A00;">3.4 &#x6269;&#x5C55;&#x6B64;&#x8BED;&#x8A00;</h2>
<p>&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x529F;&#x80FD;&#x975E;&#x5E38;&#x6709;&#x9650;&#xFF0C;&#x4E8E;&#x662F;&#x6709;&#x5F88;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x6269;&#x5C55;&#x3002;&#x6709;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x6BD4;&#x5982;&#x6DFB;&#x52A0;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x8981;&#x589E;&#x52A0;&#x89E3;&#x91CA;&#x5668;&#x6240;&#x652F;&#x6301;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x6253;&#x7B97;&#x91C7;&#x7528;&#x54E5;&#x5FB7;&#x5C14;&#x8BA1;&#x6570;&#x6CD5;&#xFF09;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x6BD4;&#x5982;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7B97;&#x672F;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x4E0D;&#x5FC5;&#x4FEE;&#x6539;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x53CA;&#x5176;&#x89E3;&#x91CA;&#x5668;&#x3002;&#x6211;&#x4EEC;&#x4E0B;&#x4E00;&#x7AE0;&#x5C31;&#x8BA8;&#x8BBA;&#x6B64;&#x95EE;&#x9898;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap2.html" class="navigation navigation-prev " aria-label="Previous page: 2. 本书有关语法解析的一切">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap4.html" class="navigation navigation-next " aria-label="Next page: 4. 初试去语法糖">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3. 解释器初窥","level":"1.4","depth":1,"next":{"title":"4. 初试去语法糖","level":"1.5","depth":1,"path":"chap4.md","ref":"chap4.md","articles":[]},"previous":{"title":"2. 本书有关语法解析的一切","level":"1.3","depth":1,"path":"chap2.md","ref":"chap2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap3.md","mtime":"2017-11-27T05:14:35.623Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-11-27T11:51:52.513Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

