
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>12. 表示层抉择 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        <meta name="author" content="lotuc">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap13.html" />
    
    
    <link rel="prev" href="chap11.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                    1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                    2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                    3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                    4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                    5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                    6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                    7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                    8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                    9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >12. 表示层抉择</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="12-&#x8868;&#x793A;&#x5C42;&#x6289;&#x62E9;">12 &#x8868;&#x793A;&#x5C42;&#x6289;&#x62E9;</h1>
<p>&#x56DE;&#x53BB;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x503C;&#x7684;&#x90A3;&#x4E2A;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x4F60;&#x80FD;&#x627E;&#x5230;&#x5176;&#x4E2D;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x5730;&#x65B9;&#x5417;&#xFF1F;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x627E;&#x5230;&#x4E86;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x662F;&#x600E;&#x4E48;&#x8868;&#x793A;&#x8FD9;&#x4E24;&#x79CD;&#x503C;&#x7684;&#xFF1A;&#x6570;&#x548C;&#x51FD;&#x6570;&#x3002;&#x5FFD;&#x7565;&#x5176;&#x5916;&#x9762;<code>numV</code>&#x548C;<code>closV</code>&#x8FD9;&#x4E00;&#x5C42;&#xFF0C;&#x6CE8;&#x610F;&#x5B83;&#x4EEC;&#x5E95;&#x5C42;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;Racket&#x4E2D;&#x7684;&#x6570;&#x6765;&#x8868;&#x793A;&#x8981;&#x89E3;&#x91CA;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4F7F;&#x7528;Racket&#x4E2D;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x95ED;&#x5305;&#xFF09;&#x6765;&#x8868;&#x793A;&#x8981;&#x89E3;&#x91CA;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#xFF08;&#x95ED;&#x5305;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x5730;&#x65B9;&#x3002;&#x66F4;&#x4E00;&#x81F4;&#x7684;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x8981;&#x4E48;&#x90FD;&#x7528;Racket&#x4E2D;&#x7684;&#x503C;&#x8868;&#x793A;&#xFF0C;&#x8981;&#x4E48;&#x90FD;<strong>&#x4E0D;</strong>&#x7528;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x505A;&#x51FA;&#x8FD9;&#x79CD;&#x51B3;&#x5B9A;&#x5462;&#xFF1F;</p>
<p>&#x8FD9;&#x4E48;&#x505A;&#x662F;&#x8981;&#x8BF4;&#x660E;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x672C;&#x7AE0;&#x6211;&#x4EEC;&#x5C31;&#x8BA8;&#x8BBA;&#x6B64;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="121-&#x6539;&#x53D8;&#x8868;&#x793A;">12.1 &#x6539;&#x53D8;&#x8868;&#x793A;</h2>
<p>&#x6211;&#x4EEC;&#x6682;&#x4E14;&#x63A2;&#x7A76;&#x4E00;&#x4E0B;&#x6570;&#x3002;Racket&#x4E2D;&#x6570;&#x5F88;&#x5F3A;&#x5927;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x91CD;&#x7528;&#x5B83;&#xFF1A;&#x5B83;&#x652F;&#x6301;&#x4EFB;&#x610F;&#x5927;&#x5C0F;&#x7684;&#x6574;&#x6570;&#xFF08;<strong>bignum</strong>&#xFF09;&#x3001;&#x6709;&#x7406;&#x6570;&#xFF08;&#x8FD9;&#x70B9;&#x53D7;&#x76CA;&#x4E8E;&#x6574;&#x6570;&#x7684;bignum&#x8868;&#x793A;&#xFF09;&#x3001;&#x590D;&#x6570;&#x7B49;&#x7B49;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x80FD;&#x8868;&#x793A;&#x51FA;&#x5927;&#x90E8;&#x5206;&#x5E38;&#x89C4;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6570;&#x7CFB;&#x7EDF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B83;&#x5C31;&#x662F;&#x6211;&#x4EEC;<strong>&#x60F3;&#x8981;&#x7684;</strong>&#xFF1A;&#x5B83;&#x53EF;&#x80FD;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#x6216;&#x8005;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x67D0;&#x79CD;&#x53D7;&#x9650;&#x7684;&#x6570;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x5C31;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x4E86;&#x3002;&#x4F8B;&#x5982;Java&#x4E2D;&#x89C4;&#x5B9A;&#x4E86;&#x4E00;&#x7EC4;&#x5B9A;&#x957F;&#x7684;&#x6570;&#x7684;&#x8868;&#x793A;&#xFF08;&#x5982;&#xFF1A;int&#x88AB;&#x6307;&#x5B9A;&#x4E3A;32&#x4F4D;&#x7684;&#xFF09;&#x3002;&#x8D85;&#x51FA;&#x8FD9;&#x4E2A;&#x89C4;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x6570;&#x5728;Java&#x4E2D;&#x5C06;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x88AB;&#x8868;&#x793A;&#xFF0C;&#x540C;&#x65F6;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x4E5F;&#x9075;&#x5FAA;&#x6B64;&#x8303;&#x56F4;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x7531;&#x4E8E;&#x6EA2;&#x51FA;&#xFF0C;1&#x52A0;2147483647&#x5C06;<strong>&#x4E0D;&#x80FD;</strong>&#x5F97;&#x5230;2147483648&#xFF09;&#x3002;</li>
<li>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x4E3A;&#x4E30;&#x5BCC;&#x7684;&#x6570;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x53C8;&#x4F1A;&#x6349;&#x895F;&#x89C1;&#x8098;&#xFF0C;&#x6BD4;&#x5982;&#x5305;&#x542B;&#x56DB;&#x5143;&#x6570;&#x6216;&#x8005;&#x548C;&#x6982;&#x7387;&#x76F8;&#x5173;&#x7684;&#x6570;&#x3002;</li>
</ul>
<p>&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x8F7B;&#x7387;&#x7684;&#x4F7F;&#x7528;Racket&#x4E2D;&#x7684;&#x6570;&#x4F5C;&#x4E3A;&#x6211;&#x4EEC;&#x8BED;&#x8A00;&#x4E2D;&#x6570;&#x7684;&#x8868;&#x793A;&#x3002;</p>
<p>&#x4E4B;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x5173;&#x5FC3;&#x6570;&#x672C;&#x8EAB;&#xFF1B;&#x6211;&#x4EEC;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x8BF8;&#x5982;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x503C;&#x8FD9;&#x6837;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4F5C;&#x4E3A;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x8005;&#xFF0C;&#x4F60;&#x5E94;&#x5F53;&#x5728;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x8BA8;&#x8BBA;&#x95ED;&#x5305;&#x7684;&#x8868;&#x793A;&#x3002;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x5229;&#x7528;Racket&#x7684;&#x95ED;&#x5305;&#x6765;&#x8868;&#x793A;&#x76EE;&#x6807;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x6982;&#x5FF5;&#xFF0C;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x7528;Racket&#x4E2D;&#x6700;&#x57FA;&#x672C;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x76EE;&#x6807;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x4F7F;&#x7528;Racket&#x51FD;&#x6570;&#x66FF;&#x6362;&#x4E4B;&#x524D;&#x95ED;&#x5305;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
</blockquote>
<p>&#x7B54;&#x6848;&#x5728;&#x6B64;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type Value
  [numV (n : number)]
  [closV (f : (Value -&gt; Value))])

(define (interp [expr : ExprC] [env : Env]) : Value
  (type-case ExprC expr
    [numC (n) (numV n)]
    [idC (n) (lookup n env)]
    [appC (f a) (local ([define f-value (interp f env)]
                        [define a-value (interp a env)])
                  ((closV-f f-value) a-value))]
    [plusC (l r) (num+ (interp l env) (interp r env))]
    [multC (l r) (num* (interp l env) (interp r env))]
    [lamC (a b) (closV (lambda (arg-val)
                         (interp b
                                 (extend-env (bind a arg-val)
                                             env))))]))
</code></pre>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x53D8;&#x5316;&#x3002;&#x4E4B;&#x524D;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x73AF;&#x5883;&#x662F;&#x5728;&#x89E3;&#x91CA;appC&#x65F6;&#x88AB;&#x6269;&#x5C55;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x5B83;&#x662F;&#x5728;lamC&#x7684;&#x89E3;&#x91CA;&#x8FC7;&#x7A0B;&#x4E2D;&#x88AB;&#x6269;&#x5C55;&#x7684;&#x3002;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x51FA;&#x9519;&#x4E86;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x7684;&#x8BDD;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1F;</p>
</blockquote>
<p>&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x663E;&#x7136;&#x66F4;&#x4E3A;&#x7B80;&#x6D01;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5931;&#x53BB;&#x4E86;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#xFF1A;<strong>&#x7406;&#x89E3;</strong>&#x3002;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#x6E90;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x5BF9;&#x5E94;&#x4E8E;lambda&#x7B49;&#x4E8E;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x8BF4;&#xFF1A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;lambda&#x662F;&#x5E72;&#x561B;&#x7684;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5C31;&#x4E0D;&#x4F1A;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x7814;&#x7A76;&#x5B83;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x79CD;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4E5F;&#x4E0D;&#x4F1A;&#x6559;&#x7ED9;&#x6211;&#x4EEC;&#x5565;&#xFF08;&#x800C;&#x4E14;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x672C;&#x6765;&#x5C31;&#x5BF9;&#x8BE5;&#x6982;&#x5FF5;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x7684;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x56F0;&#x60D1;&#xFF09;&#x3002;&#x51FA;&#x4E8E;&#x540C;&#x6837;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x4F7F;&#x7528;Racket&#x4E2D;&#x7684;&#x72B6;&#x6001;&#x53BB;&#x7406;&#x89E3;&#x5404;&#x79CD;&#x5BF9;&#x72B6;&#x6001;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x4E86;&#x67D0;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x8868;&#x793A;&#x5C06;&#x4E0D;&#x518D;&#x662F;&#x95EE;&#x9898;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x66F4;&#x4E3A;&#x7B80;&#x6D01;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x624B;&#x5DE5;&#x5B9E;&#x73B0;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x89E3;&#x91CA;&#x5668;&#x4F1A;&#x53D8;&#x5F97;&#x6BEB;&#x65E0;&#x53EF;&#x8BFB;&#x6027;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x9632;&#x8303;&#x8FC7;&#x5EA6;&#x4F7F;&#x7528;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;&#x53EF;&#x80FD;&#x62DB;&#x81F4;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<blockquote>
<p>&#x6709;&#x70B9;&#x50CF;&#x662F;&#xFF0C;&#x201C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x52A0;&#x4E00;&#x6765;&#x7406;&#x89E3;&#x52A0;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x52A0;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x4E58;&#x6CD5;&#xFF1A;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x52A0;&#x4E00;&#x6765;&#x5B9A;&#x4E49;&#x4E58;&#x6CD5;&#x3002;&#x201D;</p>
</blockquote>
<h2 id="122-&#x9519;&#x8BEF;">12.2 &#x9519;&#x8BEF;</h2>
<p>&#x5F53;&#x7A0B;&#x5E8F;&#x51FA;&#x9519;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x9700;&#x8981;&#x5F97;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7528;&#x6237;&#x6536;&#x5230;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x4E2D;&#x629B;&#x51FA;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x5C06;&#x65E0;&#x6CD5;&#x88AB;&#x7406;&#x89E3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8C28;&#x614E;&#x7684;&#x5C06;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x9519;&#x8BEF;&#x7FFB;&#x8BD1;&#x6210;&#x6211;&#x4EEC;&#x8BED;&#x8A00;&#x7684;&#x7528;&#x6237;&#x6240;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x4E14;&#x4E0D;&#x8BA9;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x201C;&#x6CC4;&#x6F0F;&#x8FC7;&#x6765;&#x201D;&#x3002;</p>
<p>&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x60C5;&#x5F62;&#x662F;&#xFF0C;&#x90A3;&#x4E9B;&#x672C;&#x5E94;&#x51FA;&#x9519;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#xFF01;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x65F6;&#x51B3;&#x5B9A;&#x8BA9;&#x51FD;&#x6570;&#x53EA;&#x51FA;&#x73B0;&#x5728;&#x9876;&#x5C42;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x7279;&#x610F;&#x5730;&#x68C0;&#x6D4B;&#x8FD9;&#x70B9;&#xFF0C;&#x5176;&#x88AB;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x540E;&#x5F97;&#x5230;lambda&#xFF0C;&#x6700;&#x540E;&#x53EF;&#x80FD;&#x5728;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x88AB;&#x89E3;&#x91CA;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x5B83;&#x672C;&#x6765;&#x5E94;&#x8BE5;&#x4F7F;&#x89E3;&#x91CA;&#x5668;&#x51FA;&#x9519;&#x505C;&#x6B62;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x6781;&#x5176;&#x6CE8;&#x610F;&#xFF0C;<strong>&#x4EC5;&#x5141;&#x8BB8;&#x7B26;&#x5408;&#x671F;&#x671B;&#x7684;&#x8868;&#x5C42;&#x8BED;&#x8A00;&#x88AB;&#x6620;&#x5C04;&#x5230;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x4E2D;</strong>&#x3002;</p>
<p>&#x518D;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8003;&#x8651;&#x4E0D;&#x540C;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7ED9;&#x672A;&#x7ED1;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;&#x4F46;&#x662F;&#x5728;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x4F1A;&#x5BFC;&#x81F4;&#x8BE5;&#x53D8;&#x91CF;&#x88AB;&#x5B9A;&#x4E49;&#x3002;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x8005;&#x5E38;&#x72AF;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x786E;&#x5B9A;&#x60F3;&#x8981;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x63A8;&#x8131;&#x8BF4;&#x201C;&#x5B83;&#x5C31;&#x662F;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#x7684;&#x90A3;&#x4E2A;&#x6837;&#x5B50;&#x201D;&#x3002;&#x8FD9;&#x79CD;&#x6001;&#x5EA6;&#xFF08;a&#xFF09;&#x662F;&#x61D2;&#x60F0;&#x3001;&#x9A6C;&#x864E;&#x7684;&#xFF0C;&#xFF08;b&#xFF09;&#x53EF;&#x80FD;&#x62DB;&#x81F4;&#x4E0D;&#x53EF;&#x9884;&#x6599;&#x3001;&#x8D1F;&#x9762;&#x7684;&#x540E;&#x679C;&#xFF0C;&#xFF08;c&#xFF09;&#x5B83;&#x4F7F;&#x5F97;&#x5C06;&#x8BED;&#x8A00;&#x4ECE;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x5E73;&#x53F0;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x5E73;&#x53F0;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x3002;&#x4E0D;&#x8981;&#x72AF;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#xFF01;</p>
<h2 id="123-&#x6539;&#x53D8;&#x542B;&#x4E49;">12.3 &#x6539;&#x53D8;&#x542B;&#x4E49;</h2>
<p>&#x5C06;&#x4F5C;&#x4E3A;&#x503C;&#x7684;&#x51FD;&#x6570;&#x6620;&#x5C04;&#x4E3A;lambda&#x4E4B;&#x6240;&#x4EE5;&#x53EF;&#x884C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x672C;&#x6765;&#x5C31;&#x5E0C;&#x671B;&#x5B83;&#x4EEC;<strong>&#x62E5;&#x6709;&#x76F8;&#x540C;&#x7684;&#x542B;&#x4E49;</strong>&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x4F7F;&#x5F97;&#x6539;&#x53D8;&#x51FD;&#x6570;&#x7684;&#x542B;&#x4E49;&#x53D8;&#x5F97;&#x6781;&#x4E3A;&#x56F0;&#x96BE;&#x3002;&#x8BA9;&#x6211;&#x7ED9;&#x4F60;&#x8BBE;&#x60F3;&#x4E00;&#x4E2A;&#x60C5;&#x5F62;&#xFF1A;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x5728;&#x6211;&#x4EEC;&#x539F;&#x6765;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#xFF0C;&#x8FD9;&#x5F88;&#x7B80;&#x5355;&#xFF08;&#x5386;&#x53F2;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x7B80;&#x76F4;&#x592A;&#x7B80;&#x5355;&#x4E86;&#xFF09;&#x3002;&#x8BD5;&#x7740;&#x5728;&#x4F7F;&#x7528;&#x4E86;lambda&#x7684;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x5C06;&#x53CA;&#x65E9;&#x6C42;&#x503C;&#xFF08;eager evaluation&#xFF09;&#x7279;&#x6027;&#x6620;&#x5C04;&#x5230;&#x60F0;&#x6027;&#x6C42;&#x503C;&#xFF08;lazy application&#xFF09;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF08;&#x8BD1;&#x6CE8;&#xFF0C;&#x7B2C;17&#x7AE0;&#xFF09;&#x4E5F;&#x662F;&#x633A;&#x6709;&#x96BE;&#x5EA6;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x81F3;&#x5C11;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x3002;</p>
<blockquote>
<p>&#x53EA;&#x662F;&#x5047;&#x8BBE;&#x800C;&#x5DF2;&#x3002;</p>
</blockquote>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x5C06;&#x4E0A;&#x9762;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x6539;&#x6210;&#x52A8;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x91CD;&#x70B9;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x6784;&#x9020;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5E76;&#x4E0D;&#x4F1A;&#x4F7F;&#x4E8B;&#x60C5;&#x66F4;&#x4E3A;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x4E5F;&#x4E0D;&#x4F1A;&#x4F7F;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#xFF1B;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#xFF0C;&#x6620;&#x5C04;&#x6210;&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x7279;&#x6027;&#x7684;&#x65B9;&#x5F0F;&#x4F1A;&#x4F7F;&#x67D0;&#x4E9B;&#x7279;&#x6027;&#x2014;&#x2014;&#x901A;&#x5E38;&#x662F;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x4E2D;&#x5DF2;&#x6709;&#x7684;&#x7279;&#x6027;&#x2014;&#x2014;&#x7684;&#x5B9E;&#x73B0;&#x6781;&#x4E3A;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x5176;&#x4ED6;&#x7279;&#x6027;&#x7684;&#x5B9E;&#x73B0;&#x53D8;&#x5F97;&#x5FAE;&#x5999;&#x6216;&#x56F0;&#x96BE;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x98CE;&#x9669;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x5341;&#x5206;&#x6E05;&#x695A;&#x5BBF;&#x4E3B;&#x8BED;&#x8A00;&#x7684;&#x67D0;&#x4E2A;&#x7279;&#x6027;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x201C;lambda&#x201D;&#x662F;&#x5426;&#x771F;&#x7684;&#x5B9E;&#x73B0;&#x4E86;&#x9759;&#x6001;&#x4F5C;&#x7528;&#x57DF;&#xFF1F;&#xFF09;&#x3002;</p>
<p>&#x6559;&#x8BAD;&#x662F;&#xFF0C;&#x4EC5;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x201C;&#x4FDD;&#x7559;&#x201D;&#x5E95;&#x5C42;&#x8BED;&#x8A00;&#x7684;&#x610F;&#x4E49;&#x65F6;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x597D;&#x7528;&#x7684;&#x2014;&#x2014;&#x751A;&#x81F3;&#x662F;&#x7279;&#x522B;&#x660E;&#x667A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x786E;&#x4FDD;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x610F;&#x5916;&#x5730;&#x6539;&#x53D8;&#x5176;&#x610F;&#x4E49;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x5229;&#x7528;&#x57FA;&#x7840;&#x8BED;&#x8A00;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x6269;&#x5C55;&#x5B83;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4ED6;&#x7684;&#x5B9E;&#x73B0;&#x7B56;&#x7565;&#x53EF;&#x80FD;&#x4E5F;&#x4E0D;&#x9519;&#xFF08;&#x8BD1;&#x6CE8;&#xFF0C;&#x7B2C;13&#x7AE0;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F16;&#x5199;&#x89E3;&#x91CA;&#x5668;&#x3002;</p>
<h2 id="124-&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;">12.4 &#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;</h2>
<p>&#x6211;&#x4EEC;&#x518D;&#x8003;&#x8651;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#x7684;&#x8868;&#x793A;&#x65B9;&#x5F0F;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;&#x73AF;&#x5883;&#x662F;&#x4EC0;&#x4E48;&#x5417;&#xFF1F;</p>
<p>&#x73AF;&#x5883;&#x662F;&#x540D;&#x5B57;&#x5230;&#x503C;&#xFF08;&#x5982;&#x679C;&#x6709;&#x8D4B;&#x503C;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x540D;&#x5B57;&#x5230;&#x5730;&#x5740;&#xFF09;&#x7684;<strong>&#x6620;&#x5C04;</strong>&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x81EA;&#x5EFA;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x79CD;&#x6620;&#x5C04;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x6620;&#x5C04;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#xFF0C;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x5C31;&#x884C;&#xFF01;&#x8FD9;&#x6837;&#xFF0C;&#x73AF;&#x5883;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x8BFB;&#x5165;&#x540D;&#x5B57;&#x4E3A;&#x53C2;&#x6570;&#x3001;&#x8FD4;&#x56DE;&#x5176;&#x7ED1;&#x5B9A;&#x503C;&#xFF08;&#x6216;&#x8005;&#x62A5;&#x9519;&#xFF09;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type-alias Env (symbol -&gt; Value))
</code></pre>
<p>&#x7A7A;&#x7684;&#x73AF;&#x5883;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x540D;&#x5B57;&#x7684;&#x67E5;&#x8BE2;&#x90FD;&#x629B;&#x51FA;&#x9519;&#x8BEF;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (mt-env [name : symbol])
  (error &apos;lookup &quot;name not found&quot;))
</code></pre>
<p>&#xFF08;&#x539F;&#x5219;&#x4E0A;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x7ED9;&#x5B83;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;Value&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x6CA1;&#x5565;&#x610F;&#x4E49;&#xFF09;&#x3002;&#x7ED9;&#x73AF;&#x5883;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x7ED1;&#x5B9A;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x65B0;&#x51FD;&#x6570;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x68C0;&#x67E5;&#x8BE5;&#x540D;&#x5B57;&#x662F;&#x4E0D;&#x662F;&#x6B63;&#x5728;&#x6269;&#x5C55;&#x7684;&#x90A3;&#x4E2A;&#x7ED1;&#x5B9A;&#xFF1B;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x76F4;&#x63A5;&#x653E;&#x56DE;&#x5BF9;&#x5E94;&#x7684;&#x7ED1;&#x5B9A;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x5F80;&#x88AB;&#x6269;&#x5C55;&#x7684;&#x73AF;&#x5883;&#x4F20;&#x5C31;&#x884C;&#x3002;</p>
<pre><code class="lang-Racket">(define (extend-env [b : Binding] [e : Env])
  (lambda ([name : symbol]) : Value
    (if (symbol=? name (bind-name b))
        (bind-val b)
        (lookup name e))))
</code></pre>
<p>&#x6700;&#x540E;&#xFF0C;&#x600E;&#x4E48;&#x518D;&#x73AF;&#x5883;&#x4E2D;&#x67E5;&#x8BE2;&#x67D0;&#x4E2A;&#x540D;&#x79F0;&#x5462;&#xFF1F;<strong>&#x8C03;&#x7528;</strong>&#x8BE5;&#x73AF;&#x5883;&#x5373;&#x53EF;&#x3002;</p>
<pre><code class="lang-Racket">(define (lookup [n : symbol] [e : Env]) : Value
  (e n))
</code></pre>
<p>&#x5927;&#x529F;&#x544A;&#x6210;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap11.html" class="navigation navigation-prev " aria-label="Previous page: 11. 内存管理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap13.html" class="navigation navigation-next " aria-label="Next page: 13. 语言中支持去语法糖">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"12. 表示层抉择","level":"1.13","depth":1,"next":{"title":"13. 语言中支持去语法糖","level":"1.14","depth":1,"path":"chap13.md","ref":"chap13.md","articles":[]},"previous":{"title":"11. 内存管理","level":"1.12","depth":1,"path":"chap11.md","ref":"chap11.md","articles":[]},"dir":"ltr"},"config":{"plugins":["livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap12.md","mtime":"2017-11-27T05:14:35.620Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-11-27T11:51:52.513Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

