
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title> 2. 本书有关语法解析的一切 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lotuc; MrMathematica">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap3.html" />
    
    
    <link rel="prev" href="chap1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                     1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                     2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                     3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                     4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                     5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                     6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                     7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                     8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                     9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="chap15.html">
            
                <a href="chap15.html">
            
                    
                    15. 静态地检查程序中的不变量：类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="chap16.html">
            
                <a href="chap16.html">
            
                    
                    16. 动态地检查程序中的不变量：契约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chap17.html">
            
                <a href="chap17.html">
            
                    
                    17. 其他调用语义
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." > 2. 本书有关语法解析的一切</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2-&#x672C;&#x4E66;&#x6709;&#x5173;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x7684;&#x4E00;&#x5207;">2 &#x672C;&#x4E66;&#x6709;&#x5173;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x7684;&#x4E00;&#x5207;</h1>
<p>&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#xFF08;parsing&#xFF09;&#x662F;&#x5C06;&#x8F93;&#x5165;&#x5B57;&#x7B26;&#x6D41;&#x8F6C;&#x6362;&#x6210;&#x7ED3;&#x6784;&#x5316;&#x5185;&#x90E8;&#x8868;&#x793A;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x662F;&#x6811; &#xFF0C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x9012;&#x5F52;&#x5730;&#x5904;&#x7406;&#x6811;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7ED9;&#x5B9A;&#x8F93;&#x5165;&#x6D41;&#xFF1A;</p>
<pre><code class="lang-text">23 + 5 - 6
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x6210;&#x6839;&#x8282;&#x70B9;&#x4E3A;&#x52A0;&#x6CD5;&#xFF0C;&#x5DE6;&#x8FB9;&#x8282;&#x70B9;&#x8868;&#x793A;&#x6570;<code>23</code>&#xFF0C;&#x53F3;&#x8FB9;&#x8282;&#x70B9;&#x662F;&#x7528;&#x6811;&#x8868;&#x793A;<code>5-6</code>&#x7684;&#x6811;&#x3002;<strong>&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;&#xFF08;parser&#xFF09;</strong>&#x662F;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x8F6C;&#x6362;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x672C;&#x8EAB;&#x662F;&#x4E2A;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x4E14;&#x7531;&#x4E8E;&#x6B67;&#x4E49;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x8FD8;&#x8FDC;&#x6CA1;&#x6709;&#x88AB;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F8B;&#x5982;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x6210;&#x6839;&#x8282;&#x70B9;&#x4E3A;&#x51CF;&#x6CD5;&#xFF0C;&#x5B50;&#x6811;&#x4E3A;&#x52A0;&#x6CD5;&#x7684;&#x6811;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x7B26;&#x7684;&#x662F;&#x5426;&#x7B26;&#x5408;&#x4EA4;&#x6362;&#x6027;&#xFF08;&#x5DE6;&#x53F3;&#x53C2;&#x6570;&#x662F;&#x5426;&#x80FD;&#x4E92;&#x6362;&#xFF09;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x8981;&#x89E3;&#x6790;&#x529F;&#x80FD;&#x5B8C;&#x6574;&#x7684;&#x8BED;&#x8A00;&#xFF08;&#x6682;&#x4E14;&#x4E0D;&#x63D0;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#xFF09;&#xFF0C;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#x53EA;&#x4F1A;&#x66F4;&#x591A;&#x66F4;&#x590D;&#x6742;&#x3002;</p>
<h2 id="21-&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#xFF0C;&#x5185;&#x5EFA;&#x7684;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;&#x7684;&#x524D;&#x534A;&#x90E8;&#x5206;">2.1 &#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#xFF0C;&#x5185;&#x5EFA;&#x7684;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;&#x7684;&#x524D;&#x534A;&#x90E8;&#x5206;</h2>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4F7F;&#x5F97;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x672C;&#x8EAB;&#x9002;&#x5408;&#x5F53;&#x4F5C;&#x5355;&#x72EC;&#x7684;&#x4E3B;&#x9898;&#x6765;&#x8BB2;&#xFF0C;&#x4E5F;&#x786E;&#x5B9E;&#x6709;&#x5F88;&#x591A;&#x4E66;&#x672C;&#x3001;&#x8BFE;&#x7A0B;&#x548C;&#x5DE5;&#x5177;&#x4E13;&#x6CE8;&#x4E8E;&#x8BE5;&#x65B9;&#x9762;&#x3002;&#x4ECE;&#x6211;&#x4EEC;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x662F;&#x79CD;&#x4EE4;&#x4EBA;&#x5206;&#x5FC3;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x60F3;&#x5B66;&#x4E60;&#x7684;&#x662F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;<strong>&#x9664;&#x53BB;</strong>&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;Racket&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#x6765;&#x5C06;&#x8F93;&#x5165;&#x6D41;&#x8F6C;&#x6362;&#x6210;&#x6811;&#xFF1A;<code>read</code>&#x3002;<code>read</code>&#x548C;&#x8BE5;&#x8BED;&#x8A00;&#x7684;&#x62EC;&#x53F7;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;&#x7D27;&#x5BC6;&#x5173;&#x8054;&#xFF0C;&#x5B83;&#x5C06;&#x62EC;&#x53F7;&#x5F62;&#x5F0F;&#x7684;&#x5B57;&#x7B26;&#x6D41;&#x8F6C;&#x6362;&#x6210;&#x5185;&#x90E8;&#x6811;&#x5F62;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8FD0;&#x884C;<code>(read)</code>&#x7136;&#x540E;&#x8F93;&#x5165;&#x2014;&#x2014;</p>
<pre><code class="lang-text">(+ 23 (- 5 6))
</code></pre>
<p>&#x2014;&#x2014;&#x4F1A;&#x4EA7;&#x51FA;&#x4E00;&#x94FE;&#x8868;&#xFF0C;&#x5176;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x7B26;&#x53F7;<code>&apos;+</code>&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x6570;<code>23</code>&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x94FE;&#x8868;&#xFF1B;&#x8BE5;&#x94FE;&#x8868;&#x5176;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x7B26;&#x53F7;<code>&apos;-</code>&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x6570;<code>5</code>&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x6570;<code>6</code>&#x3002;</p>
<h2 id="22-&#x5FEB;&#x6377;&#x65B9;&#x5F0F;">2.2 &#x5FEB;&#x6377;&#x65B9;&#x5F0F;</h2>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#xFF0C;&#x7A0B;&#x5E8F;&#x90FD;&#x4F1A;&#x9700;&#x8981;&#x8BE6;&#x5C3D;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x800C;&#x6BCF;&#x6B21;&#x6D4B;&#x8BD5;&#x90FD;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x8F93;&#x5165;&#x4F1A;&#x5F88;&#x9EBB;&#x70E6;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x731C;&#x5F97;&#x5230;&#xFF0C;&#x62EC;&#x53F7;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x5728;Racket&#x4E2D;&#x7528;<strong>&#x5F15;&#x53F7;</strong>&#x6765;&#x8868;&#x8FBE;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4F60;&#x521A;&#x624D;&#x770B;&#x5230;&#x7684;<code>&apos;&lt;expr&gt;</code>&#x5F62;&#x5F0F;&#x2014;&#x2014;&#x5176;&#x6548;&#x679C;&#x548C;&#x8FD0;&#x884C;<code>(read)</code>&#x7136;&#x540E;&#x8F93;&#x5165;<code>&lt;expr&gt;</code>&#x4E00;&#x6837;&#x3002;</p>
<h2 id="23-&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5F97;&#x5230;&#x7684;&#x7C7B;&#x578B;">2.3 &#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5F97;&#x5230;&#x7684;&#x7C7B;&#x578B;</h2>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x521A;&#x624D;&#x7684;&#x63CF;&#x8FF0;&#x5E76;&#x4E0D;&#x51C6;&#x786E;&#x3002;&#x4E4B;&#x524D;&#x8BF4;<code>(read)</code>&#x4F1A;&#x8FD4;&#x56DE;&#x94FE;&#x8868;&#x7B49;&#x7C7B;&#x578B;&#x3002;&#x5728;Racket&#x4E2D;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#xFF0C;&#x4F46;&#x5728;Typed PLAI&#x4E2D;&#xFF0C;&#x4E8B;&#x60C5;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF0C;<code>(read)</code>&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x4E3A;<code>s-expression</code>&#xFF08;&#x7B26;&#x53F7;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7B80;&#x5199;&#xFF09;&#x3002;</p>
<pre><code class="lang-racket">&gt; (read)
- s-expression
[type in (+ 23 (- 5 6))]
&apos;(+ 23 (- 5 6))
</code></pre>
<p>Racket&#x5305;&#x542B;&#x4E86;&#x5F3A;&#x5927;&#x7684;s-expression&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x8BED;&#x6CD5;&#x8FD8;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8868;&#x8FBE;&#x5E26;&#x5FAA;&#x73AF;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x53EA;&#x4F1A;&#x7528;&#x5230;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;s-expression&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x548C;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982;&#x6570;&#x3001;&#x94FE;&#x8868;&#xFF09;&#x90FD;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x90E8;&#xFF0C;s-expression&#x662F;&#x4E00;&#x79CD;&#x9012;&#x5F52;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x57FA;&#x672C;&#x6784;&#x9020;&#x662F;&#x539F;&#x5B50;&#x503C;&#x2014;&#x2014;&#x4F8B;&#x5982;&#x6570;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x7B26;&#x53F7;&#xFF0C;&#x7EC4;&#x5408;&#x5F62;&#x5F0F;&#x53EF;&#x4EE5;&#x662F;&#x8868;&#x3001;&#x5411;&#x91CF;&#x7B49;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x539F;&#x5B50;&#x503C;&#xFF08;&#x6570;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x7B26;&#x53F7;&#x7B49;&#xFF09;&#x5373;&#x662F;&#x5176;&#x81EA;&#x7531;&#x7C7B;&#x578B;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;s-expression&#x3002;&#x8FD9;&#x5C31;&#x9020;&#x6210;&#x4E86;&#x8F93;&#x5165;&#x7684;&#x6B67;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x540E;&#x6587;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>Typed PLAI&#x91C7;&#x53D6;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x6B67;&#x4E49;&#xFF1A;&#x5F53;&#x76F4;&#x63A5;&#x8F93;&#x5165;&#x65F6;&#xFF0C;&#x539F;&#x5B50;&#x7ED3;&#x6784;&#x5C31;&#x662F;&#x5B83;&#x672C;&#x8EAB;&#x7684;&#x7C7B;&#x578B;&#xFF1B;&#x5F53;&#x8F93;&#x5165;&#x4E3A;&#x5927;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x65F6;&#x2014;&#x2014;&#x5305;&#x62EC;read&#x6216;&#x8005;&#x5F15;&#x7528;&#x2014;&#x2014;&#x5B83;&#x4EEC;&#x5C31;&#x662F;s-expression&#x7C7B;&#x578B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-racket">&gt; &apos;+
- symbol
&apos;+
&gt; (define l &apos;(+ 1 2))
&gt; l
- s-expression
&apos;(+ 1 2)
&gt; (first l)
. typecheck failed: (listof &apos;_a) vs s-expression in:
  first
  (quote (+ 1 2))
  l
  first
&gt; (define f (first (s-exp-&gt;list l)))
&gt; f
- s-expression
&apos;+
</code></pre>
<p>&#x8FD9;&#x65B9;&#x9762;&#x548C;Java&#x7A0B;&#x5E8F;&#x7684;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7C7B;&#x4F3C;&#x3002;&#x6211;&#x4EEC;&#x540E;&#x6587;&#x518D;&#x5B66;&#x4E60;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8868;&#x7ED3;&#x6784;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x7C7B;&#x578B;&#x5E76;&#x4E0D;&#x662F;&#x7B26;&#x53F7;&#xFF1A;&#x8868;&#x5F62;&#x5F0F;&#x7684;s-expression&#x662F;&#x7531;s-expressions&#x7EC4;&#x6210;&#x7684;&#x8868;&#x3002;&#x56E0;&#x6B64;&#xFF0C;</p>
<pre><code class="lang-racket">&gt; (symbol-&gt;string f)
. typecheck failed: symbol vs s-expression in:
  symbol-&gt;string
  f
  symbol-&gt;string
  f
  first
  (first (s-exp-&gt;list l))
  s-exp-&gt;list
</code></pre>
<p>&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#xFF1A;</p>
<pre><code class="lang-racket">&gt; (symbol-&gt;string (s-exp-&gt;symbol f))
- string
&quot;+&quot;
</code></pre>
<p>&#x5FC5;&#x987B;&#x5BF9;s-expressions&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x786E;&#x5B9E;&#x662F;&#x4E2A;&#x9EBB;&#x70E6;&#x4E8B;&#xFF0C;&#x4F46;&#x662F;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x7684;&#x9EBB;&#x70E6;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF1A;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x662F;&#x628A;<strong>&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x7684;</strong>&#x8F93;&#x5165;&#xFF0C;&#x901A;&#x8FC7;&#x4E25;&#x8C28;&#x7684;<strong>&#x7C7B;&#x578B;</strong>&#x5206;&#x6790;&#xFF0C;&#x8F6C;&#x5316;&#x4E3A;<strong>&#x6709;&#x7C7B;&#x578B;</strong>&#x7684;&#x3002;&#x6240;&#x4EE5;&#x6709;&#x4E9B;&#x5173;&#x4E8E;&#x8F93;&#x5165;&#x7684;&#x5047;&#x8BBE;&#x5FC5;&#x987B;&#x660E;&#x6587;&#x7ED9;&#x51FA;&#x3002;</p>
<p>&#x597D;&#x5728;&#x6211;&#x4EEC;&#x53EA;&#x5728;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x4E2D;&#x4F7F;&#x7528;s-expressions&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x662F;<strong>&#x5C3D;&#x5FEB;&#x5904;&#x7406;&#x5B8C;&#x8BED;&#x6CD5;&#x89E3;&#x6790;</strong>&#xFF01;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x53EA;&#x4F1A;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5C3D;&#x5FEB;&#x6446;&#x8131;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x3002;</p>
<h2 id="24-&#x5B8C;&#x6574;&#x7684;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;">2.4 &#x5B8C;&#x6574;&#x7684;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;</h2>
<p>&#x539F;&#x5219;&#x4E0A;<code>read</code>&#x5C31;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;&#x3002;&#x4E0D;&#x8FC7;&#x5176;&#x8F93;&#x51FA;&#x8FC7;&#x4E8E;&#x4E00;&#x822C;&#x5316;&#xFF1A;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x5176;&#x610F;&#x5411;&#x7684;&#x6CE8;&#x91CA;&#x4FE1;&#x606F;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x7528;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x524D;&#x6587;&#x4E2D;&#x201C;&#x8868;&#x8FBE;&#x52A0;&#x6CD5;&#x201D;&#x548C;&#x201C;&#x8868;&#x8FBE;&#x6570;&#x201D;&#x7684;&#x90A3;&#x79CD;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5F15;&#x5165;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x7C7B;&#x5173;&#x7CFB;&#x3002;&#x540E;&#x6587;&#xFF08;<a href="chap3.html#31-&#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8868;&#x793A;">3.1&#x8282;</a>&#xFF09;&#x4F1A;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x4E3A;&#x5565;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x8FD8;&#x6709;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5F97;&#x51FA;&#x8BE5;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x73B0;&#x5728;&#x8BF7;&#x5148;&#x5047;&#x8BBE;&#x5B83;&#x662F;&#x7ED9;&#x5B9A;&#x7684;&#xFF1A;</p>
<pre><code>(define-type ArithC
  [numC (n : number)]
  [plusC (l : ArithC) (r : ArithC)]
  [multC (l : ArithC) (r : ArithC)])
</code></pre><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x80FD;&#x5C06;s-expression&#x89E3;&#x6790;&#x6210;&#x8BE5;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;&#x7684;&#x53E6;&#x4E00;&#x534A;&#xFF1A;</p>
<pre><code class="lang-racket">(define (parse [s : s-expression])
  (cond
    [(s-exp-number? s) (numC (s-exp-&gt;number s))]
    [(s-exp-list? s)
     (let ([sl (s-exp-&gt;list s)])
       (case (s-exp-&gt;symbol (first sl))
         [(+) (plusC (parse (second sl)) (parse (third sl)))]
         [(*) (multC (parse (second sl)) (parse (third sl)))]
         [else (error &apos;parse &quot;invalid list input&quot;)]))]  ;&#x65E0;&#x6548;&#x7684;&#x8868;&#x8F93;&#x5165;
    [else (error &apos;parse &quot;invalid input&quot;)]))  ;&#x65E0;&#x6548;&#x7684;&#x8F93;&#x5165;
</code></pre>
<p>&#x7B80;&#x5355;&#x8FD0;&#x884C;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-racket">&gt; (parse &apos;(+ (* 1 2) (+ 2 3)))
- ArithC
(plusC
 (multC (numC 1) (numC 2))
 (plusC (numC 2) (numC 3)))
</code></pre>
<p>&#x606D;&#x559C;&#xFF01;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x9996;&#x4E2A;<strong>&#x7A0B;&#x5E8F;&#x7684;&#x8868;&#x793A;</strong>&#x3002;&#x4ECE;&#x4ECA;&#x5F80;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x53EA;&#x9700;&#x8981;&#x5904;&#x7406;&#x7528;&#x9012;&#x5F52;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x8868;&#x793A;&#x7684;&#x7A0B;&#x5E8F;&#x4E86;&#xFF0C;&#x518D;&#x4E5F;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x5982;&#x4F55;&#x628A;&#x8BED;&#x6CD5;&#x8F6C;&#x6362;&#x4E3A;&#x6811;&#x5F62;&#x7ED3;&#x6784;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7EC8;&#x4E8E;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E86;&#xFF01;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x5982;&#x679C;&#x4F20;&#x7ED9;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x5668;&#x7684;&#x53C2;&#x6570;&#x5FD8;&#x4E86;&#x52A0;&#x5F15;&#x53F7;&#xFF0C;&#x540E;&#x679C;&#x662F;&#x5565;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p>
</blockquote>
<h2 id="25-&#x5C3E;&#x58F0;">2.5 &#x5C3E;&#x58F0;</h2>
<p>Racket&#x7684;&#x8BED;&#x6CD5;&#x7EE7;&#x627F;&#x81EA;Scheme&#x548C;Lisp&#xFF0C;&#x4E0D;&#x4E4F;&#x4E89;&#x8BAE;&#x3002;&#x4E0D;&#x8FC7;&#x8BF7;&#x89C2;&#x5BDF;&#x5B83;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x7684;&#x6DF1;&#x5C42;&#x6B21;&#x597D;&#x5904;&#xFF1A;&#x5BF9;&#x4F20;&#x7EDF;&#x8BED;&#x6CD5;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x4F1A;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x89E3;&#x6790;&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x5219;&#x7B80;&#x5355;&#x660E;&#x4E86;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4ECE;&#x5B57;&#x7B26;&#x6D41;&#x5230;s-expressions&#x7684;&#x89E3;&#x6790;&#xFF0C;&#x8FD8;&#x662F;&#x4ECE;s-expressions&#x8FDB;&#x4E00;&#x6B65;&#x5230;&#x8BED;&#x6CD5;&#x6811;&#x7684;&#x89E3;&#x6790;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x5176;&#x591A;&#x7528;&#x9014;&#x6027;&#x3002;&#x9700;&#x8981;&#x7684;&#x4EE3;&#x7801;&#x5C11;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x7684;&#x63D2;&#x5165;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3002;&#x6240;&#x4EE5;&#x5F88;&#x591A;&#x57FA;&#x4E8E;Lisp&#x7684;&#x8BED;&#x8A00;&#x5176;&#x8BED;&#x4E49;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x90FD;&#x4FDD;&#x7559;&#x4E86;&#x5386;&#x53F2;&#x7EE7;&#x627F;&#x800C;&#x6765;&#x7684;&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x91C7;&#x7528;XML&#xFF0C;&#x5B83;&#x66F4;&#x597D;&#x7528;&#xFF1B;&#x6216;&#x8005;JSON&#xFF0C;&#x5B83;&#x548C;s-expression&#x6709;&#x7740;&#x672C;&#x8D28;&#x7684;&#x4E0D;&#x540C;&#xFF01;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap1.html" class="navigation navigation-prev " aria-label="Previous page:  1. 引言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap3.html" class="navigation navigation-next " aria-label="Next page:  3. 解释器初窥">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":" 2. 本书有关语法解析的一切","level":"1.3","depth":1,"next":{"title":" 3. 解释器初窥","level":"1.4","depth":1,"path":"chap3.md","ref":"chap3.md","articles":[]},"previous":{"title":" 1. 引言","level":"1.2","depth":1,"path":"chap1.md","ref":"chap1.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-76420995-1"},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc; MrMathematica","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap2.md","mtime":"2018-09-28T07:36:04.701Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-28T07:36:08.800Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

