
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title> 9. 递归和循环：子程序与数据 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lotuc; MrMathematica">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap10.html" />
    
    
    <link rel="prev" href="chap8.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                     1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                     2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                     3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                     4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                     5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                     6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                     7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                     8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                     9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="chap15.html">
            
                <a href="chap15.html">
            
                    
                    15. 静态地检查程序中的不变量：类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="chap16.html">
            
                <a href="chap16.html">
            
                    
                    16. 动态地检查程序中的不变量：契约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chap17.html">
            
                <a href="chap17.html">
            
                    
                    17. 其他调用语义
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." > 9. 递归和循环：子程序与数据</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="9-&#x9012;&#x5F52;&#x548C;&#x5FAA;&#x73AF;&#xFF1A;&#x5B50;&#x7A0B;&#x5E8F;&#x4E0E;&#x6570;&#x636E;">9 &#x9012;&#x5F52;&#x548C;&#x5FAA;&#x73AF;&#xFF1A;&#x5B50;&#x7A0B;&#x5E8F;&#x4E0E;&#x6570;&#x636E;</h1>
<p><strong>&#x9012;&#x5F52;</strong>&#x6307;&#x7684;&#x662F;&#x81EA;&#x6211;&#x5F15;&#x7528;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x5B58;&#x5728;&#xFF08;&#x81F3;&#x5C11;&#xFF09;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x9012;&#x5F52;&#xFF1A;&#x6570;&#x636E;&#x7684;&#x9012;&#x5F52;&#x548C;&#x63A7;&#x5236;&#x7684;&#x9012;&#x5F52;&#xFF08;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x7684;&#x9012;&#x5F52;&#xFF09;&#x3002;</p>
<h2 id="91-&#x9012;&#x5F52;&#x4E0E;&#x5FAA;&#x73AF;&#x6570;&#x636E;">9.1 &#x9012;&#x5F52;&#x4E0E;&#x5FAA;&#x73AF;&#x6570;&#x636E;</h2>
<p>&#x6570;&#x636E;&#x4E2D;&#x7684;&#x9012;&#x5F52;&#x8FD8;&#x53EF;&#x4EE5;&#x5206;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;&#x5F15;&#x7528;&#x4E0E;&#x81EA;&#x8EAB;&#x76F8;&#x540C;<strong>&#x7C7B;&#x578B;</strong>&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x6216;&#x8005;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x5F15;&#x7528;<strong>&#x81EA;&#x8EAB;</strong>&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x5373;&#x6211;&#x4EEC;&#x4F20;&#x7EDF;&#x79F0;&#x4E3A;<strong>&#x9012;&#x5F52;&#x6570;&#x636E;</strong>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6811;&#x662F;&#x4E00;&#x79CD;&#x9012;&#x5F52;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;&#x4EFB;&#x4E00;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x6709;&#x82E5;&#x5E72;&#x5B50;&#x8282;&#x70B9;&#xFF1B;&#x6BCF;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x81EA;&#x8EAB;&#x4E5F;&#x662F;&#x6811;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x904D;&#x5386;&#x6811;&#xFF0C;&#x65E0;&#x9700;&#x8BB0;&#x5F55;&#x54EA;&#x4E9B;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x88AB;&#x8BBF;&#x95EE;&#x3002;&#x6811;&#x662F;&#x6709;&#x7A77;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x56FE;&#x8FD9;&#x79CD;<strong>&#x5FAA;&#x73AF;</strong>&#xFF08;cyclic&#xFF09;&#x6570;&#x636E;&#xFF1A;&#x8282;&#x70B9;&#x5F15;&#x7528;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x94FE;&#x5F15;&#x7528;&#x56DE;&#x81EA;&#x8EAB;&#x3002;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x8282;&#x70B9;&#x8FD8;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x81EA;&#x8EAB;&#x3002;&#xFF09;&#x904D;&#x5386;&#x56FE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x8BB0;&#x5F55;&#x5DF2;&#x8BBF;&#x95EE;&#x8FC7;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x5C31;&#x53EF;&#x80FD;<strong>&#x53D1;&#x6563;</strong>&#xFF0C;&#x5373;&#x4E0D;&#x4F1A;&#x7EC8;&#x6B62;&#x3002;&#x56FE;&#x7684;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x5DF2;&#x8BBF;&#x95EE;&#x8FC7;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x91CD;&#x590D;&#x904D;&#x5386;&#x3002;</p>
<p>&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x6DFB;&#x52A0;&#x9012;&#x5F52;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x94FE;&#x8868;&#x6216;&#x6811;&#xFF0C;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#x3002;&#x4E3B;&#x8981;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E24;&#x70B9;&#xFF1A;</p>
<ol>
<li>&#x521B;&#x5EFA;&#x590D;&#x5408;&#x7ED3;&#x6784;&#xFF08;compound structure&#xFF09;&#x7684;&#x80FD;&#x529B;&#xFF08;&#x4F8B;&#x5982;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x5B50;&#x6811;&#xFF09;&#xFF1B;</li>
<li>&#x7ED3;&#x675F;&#x9012;&#x5F52;&#x7684;&#x80FD;&#x529B;&#xFF08;&#x5982;&#x6811;&#x7ED3;&#x6784;&#x7684;&#x53F6;&#x8282;&#x70B9;&#xFF09;</li>
</ol>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x7ED9;&#x8BED;&#x8A00;&#x6DFB;&#x52A0;&#x5185;&#x5EFA;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;&#x94FE;&#x8868;&#x3001;&#x4E8C;&#x53C9;&#x6811;</p>
</blockquote>
<p>&#x6DFB;&#x52A0;&#x5FAA;&#x73AF;&#x6570;&#x636E;&#x66F4;&#x4E3A;&#x5FAE;&#x5999;&#x3002;&#x8003;&#x8651;&#x5FAA;&#x73AF;&#x6570;&#x636E;&#x7684;&#x6700;&#x7B80;&#x5355;&#x5F62;&#x5F0F;&#xFF0C;&#x6307;&#x5411;&#x81EA;&#x8EAB;&#x7684;&#x5355;&#x5143;&#x683C;&#xFF1A;</p>
<center><img src="imgs/pict.png"></center>

<p>&#x8BD5;&#x8BD5;&#x5728;Racket&#x4E2D;&#x5B9A;&#x4E49;&#x5B83;&#x3002;&#x5C1D;&#x8BD5;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([b b])
  b)
</code></pre>
<p>&#x4F46;&#x8FD9;&#x884C;&#x4E0D;&#x901A;&#xFF1A;let&#x4E2D;&#x53F3;&#x8FB9;&#x90A3;&#x4E2A;<code>b</code>&#x672A;&#x7ED1;&#x5B9A;&#x3002;&#x628A;&#x8BED;&#x6CD5;&#x7CD6;&#x89E3;&#x5F00;&#x53EF;&#x4EE5;&#x770B;&#x7684;&#x66F4;&#x6E05;&#x695A;&#xFF1A;</p>
<pre><code class="lang-Racket">((lambda (b)
   b)
  b)
</code></pre>
<p>&#x4E3A;&#x4E86;&#x6E05;&#x695A;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91CD;&#x547D;&#x540D;&#x51FD;&#x6570;&#x4E2D;&#x7684;<code>b</code>&#xFF1A;</p>
<pre><code class="lang-Racket">((lambda (x)
  x)
 b)
</code></pre>
<p>&#x660E;&#x663E;<code>b</code>&#x672A;&#x7ED1;&#x5B9A;&#x3002;</p>
<p>&#x4E0D;&#x4F7F;&#x7528;&#x989D;&#x5916;&#x7684;Racket&#x6784;&#x9020;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#xFF0C;&#x663E;&#x7136;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x5FAA;&#x73AF;&#x6570;&#x636E;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7ED9;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x201C;&#x5730;&#x5740;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8BE5;&#x5730;&#x5740;&#x4E2D;&#x5F15;&#x7528;&#x81EA;&#x5DF1;&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x662F;&#x7528;&#x4E86;&#x201C;&#x7136;&#x540E;&#x201D;&#xFF0C;&#x5B83;&#x6697;&#x793A;&#x65F6;&#x95F4;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#x7528;<code>box</code>&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<blockquote>
<p>&#x6307;<code>shared</code>&#x6784;&#x9020;&#xFF0C;&#x4E0D;&#x8FC7;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x673A;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x6DF1;&#x7A76;&#x5B83;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5B66;&#x4E60;&#x7684;&#x4E1C;&#x897F;&#x6B63;&#x662F;<code>shared</code>&#x5E55;&#x540E;&#x5B9E;&#x73B0;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x3002;</p>
</blockquote>
<p>&#x8BA1;&#x5212;&#x5982;&#x4E0B;&#xFF1A;&#x9996;&#x5148;&#xFF0C;&#x521B;&#x5EFA;box&#x5E76;&#x5C06;&#x5176;&#x7ED1;&#x5B9A;&#x5230;&#x67D0;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x8BBE;&#x4E3A;<code>b</code>&#xFF1B;&#x7136;&#x540E;&#x6539;&#x53D8;box&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5176;&#x4E2D;&#x5B58;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5F53;&#x7136;&#x662F;&#x5BF9;&#x81EA;&#x8EAB;&#x7684;&#x5F15;&#x7528;&#x3002;&#x600E;&#x4E48;&#x83B7;&#x5F97;&#x8BE5;&#x5F15;&#x7528;&#x5462;&#xFF1F;&#x901A;&#x8FC7;&#x540D;&#x5B57;<code>b</code>&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x73AF;&#x72B6;&#x6570;&#x636E;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([b (box &apos;dummy)])
  (begin
    (set-box! b b)
    b))
</code></pre>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x5728;Typed PLAI&#x4E2D;<strong>&#x65E0;&#x6CD5;</strong>&#x8FD0;&#x884C;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x8C08;&#x5230;&#x5982;&#x4F55;&#x7ED9;&#x8BE5;&#x7A0B;&#x5E8F;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8981;&#x8FD0;&#x884C;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7684;&#xFF08;<code>#lang plai</code>&#xFF09;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x8FD0;&#x884C;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;Racket&#x663E;&#x793A;<code>#0=&#x2019;#&amp;#0#</code>&#x3002;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x3002;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;<code>#&amp;</code>&#x662F;Racket&#x4E2D;box&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x3002;<code>#0=</code>&#xFF08;&#x5176;&#x4E2D;0&#x6362;&#x6210;&#x5176;&#x4ED6;&#x6570;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF09;&#x662F;Racket&#x4E2D;&#x5BF9;&#x4E8E;&#x5FAA;&#x73AF;&#x6570;&#x636E;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0A;&#x9762;&#x7ED3;&#x679C;&#x5B57;&#x9762;&#x610F;&#x601D;&#x5C31;&#x662F;&#x201C;<code>#0</code>&#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x4E86;&#x4E00;&#x4E2A;box&#xFF0C;&#x5176;&#x5185;&#x5BB9;&#x4E3A;<code>#0#</code>&#xFF0C;&#x5373;&#x7ED1;&#x5B9A;&#x5230;<code>#0</code>&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5373;&#x5B83;&#x81EA;&#x5DF1;&#x201D;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x5728;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x4E0E;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x786E;&#x4FDD;&#x5176;&#x4EA7;&#x751F;<strong>&#x5FAA;&#x73AF;&#x7684;</strong>&#x6570;&#x636E;&#x503C;&#x3002;&#x600E;&#x4E48;&#x68C0;&#x6D4B;&#x8FD9;&#x4E00;&#x70B9;&#x5462;&#xFF1F;</p>
</blockquote>
<p>&#x4E0A;&#x8FF0;&#x601D;&#x60F3;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5176;&#x5B83;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x5FAA;&#x73AF;&#x7684;&#x94FE;&#x8868;&#x3001;&#x56FE;&#x7B49;&#x7B49;&#x3002;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x5C31;&#x662F;&#x5206;&#x4E24;&#x6B65;&#x505A;&#xFF1A;&#x5148;&#x547D;&#x540D;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x5360;&#x4F4D;&#x7B26;&#xFF1B;&#x7136;&#x540E;&#x4FEE;&#x6539;&#x5360;&#x4F4D;&#x7B26;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x4E3A;&#x5176;&#x81EA;&#x8EAB;&#xFF1B;&#x8981;&#x83B7;&#x53D6;&#x201C;&#x81EA;&#x8EAB;&#x201D;&#xFF0C;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x6B65;&#x4E2D;&#x7ED1;&#x5B9A;&#x7684;&#x540D;&#x5B57;&#x5373;&#x53EF;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x9650;&#x4E8E;&#x201C;&#x81EA;&#x5FAA;&#x73AF;&#x201D;&#xFF1A;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x76F8;&#x4E92;&#x5FAA;&#x73AF;&#x7684;&#x6570;&#x636E;&#xFF08;&#x6CA1;&#x6709;&#x67D0;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x5FAA;&#x73AF;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7684;&#x7EC4;&#x5408;&#x662F;&#x5FAA;&#x73AF;&#x7684;&#xFF09;&#x3002;</p>
<h2 id="92-&#x9012;&#x5F52;&#x51FD;&#x6570;">9.2 &#x9012;&#x5F52;&#x51FD;&#x6570;</h2>
<p>&#x6F84;&#x6E05;&#x4E00;&#x4E0B;&#x540D;&#x8BCD;&#xFF0C;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x4E0D;&#x662F;&#x5F15;&#x7528;&#x4E0E;&#x81EA;&#x8EAB;&#x76F8;&#x540C;<strong>&#x7C7B;&#x578B;</strong>&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x5F15;&#x7528;<strong>&#x81EA;&#x8EAB;</strong>&#x7684;&#x51FD;&#x6570;&#x3002;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x9700;&#x8981;&#x5DF2;&#x7ECF;&#x6DFB;&#x52A0;&#x4E86;&#x6761;&#x4EF6;&#x5206;&#x652F;&#x7684;&#x7279;&#x6027;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;&#x524D;&#x9762;<a href="chap5.html">&#x7B2C;&#x4E94;&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6DFB;&#x52A0;&#x4E86;&#x6761;&#x4EF6;&#x6307;&#x4EE4;&#x5224;&#x65AD;&#x662F;&#x5426;&#x662F;0&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x5199;&#x51FA;&#x6709;&#x610F;&#x601D;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x7528;&#x9012;&#x5F52;&#x5B9E;&#x73B0;&#x9636;&#x4E58;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([fact (lambda (n)
              (if0 n
                   1
                   (* n (fact (- n 1)))))])
  (fact 10))
</code></pre>
<p>&#x8FD9;&#x6839;&#x672C;&#x884C;&#x4E0D;&#x901A;&#xFF01;&#x5B83;&#x5C06;&#x62A5;&#x9519;&#x5185;&#x5C42;&#x7684;<code>fact</code>&#x672A;&#x7ED1;&#x5B9A;&#xFF0C;&#x548C;&#x524D;&#x9762;&#x5FAA;&#x73AF;&#x6570;&#x636E;&#x7684;&#x4F8B;&#x5B50;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x611F;&#x5230;&#x5947;&#x602A;&#x3002;&#x6BD5;&#x7ADF;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x7684;&#x7ED1;&#x5B9A;&#x673A;&#x5236;&#x5E76;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x4F7F;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x652F;&#x6301;&#x5FAA;&#x73AF;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x65E9;&#x671F;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x4E5F;&#x4E0D;&#x81EA;&#x52A8;&#x652F;&#x6301;&#x5FAA;&#x73AF;&#xFF1A;&#x9012;&#x5F52;&#x88AB;&#x5F53;&#x4F5C;&#x7279;&#x6B8A;&#x7684;<strong>&#x7279;&#x6027;</strong>&#xFF09;&#x3002;&#x60F3;&#x8981;&#x9012;&#x5F52;&#x7684;&#x8BDD;&#x2014;&#x2014;&#x5373;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x53EF;&#x4EE5;&#x5FAA;&#x73AF;&#x7684;&#x5F15;&#x7528;&#x81EA;&#x5DF1;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x624B;&#x5DE5;&#x5B9E;&#x73B0;&#x8FD9;&#x70B9;&#x3002;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x6309;&#x60EF;&#x4F8B;&#x5728;<strong>&#x9876;&#x5C42;</strong>&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x4F1A;&#x9047;&#x5230;&#x95EE;&#x9898;&#x3002;&#x9876;&#x5C42;&#x7684;&#x7ED1;&#x5B9A;&#x610F;&#x5473;&#x7740;&#x5B83;&#x8981;&#x4E48;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x8981;&#x4E48;&#x662F;box&#x3002;&#x6240;&#x4EE5;&#x4E0B;&#x9762;&#x8BF4;&#x7684;&#x6A21;&#x5F0F;&#x57FA;&#x672C;&#x4E0A;&#x81EA;&#x52A8;&#x5C31;&#x5E2E;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5C40;&#x90E8;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;<code>letrec</code>&#x6216;&#x8005;<code>local</code>&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>let</code>&#x7684;&#x539F;&#x56E0;&#x3002;</p>
</blockquote>
<p>&#x90A3;&#x4E48;&#x89E3;&#x51B3;&#x624B;&#x6BB5;&#x4E5F;&#x5F88;&#x660E;&#x4E86;&#xFF1A;&#x95EE;&#x9898;&#x548C;&#x4E0A;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#xFF0C;&#x65B9;&#x6848;&#x5C31;&#x4E5F;&#x7528;&#x4E00;&#x6837;&#x7684;&#x3002;&#x8FD8;&#x662F;&#x4E09;&#x6B65;&#x8D70;&#xFF1A;&#x5148;&#x521B;&#x5EFA;&#x5360;&#x4F4D;&#x7B26;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9700;&#x8981;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x8BE5;&#x5360;&#x4F4D;&#x7B26;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x8981;&#x5BF9;&#x5360;&#x4F4D;&#x7B26;&#x8D4B;&#x503C;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([fact (box &apos;dummy)])
  (let ([fact-fun
         (lambda (n)
           (if (zero? n)
               1
               (* n ((unbox fact) (- n 1)))))])
    (begin
      (set-box! fact fact-fun)
      ((unbox fact) 10))))
</code></pre>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9700;&#x8981;<code>fact-fun</code>&#xFF1A;&#x8FD9;&#x6837;&#x5199;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x6E05;&#x6670;&#x8D77;&#x89C1;&#x3002;&#x6CE8;&#x610F;&#x5230;<code>fact-fun</code>&#x4E0D;&#x662F;&#x9012;&#x5F52;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5B83;&#x662F;&#x6807;&#x8BC6;&#x7B26;&#x800C;&#x4E0D;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x503C;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([fact (box &apos;dummy)])
  (begin
    (set-box! fact
              (lambda (n)
                (if (zero? n)
                    1
                    (* n ((unbox fact) (- n 1))))))
    ((unbox fact) 10)))
</code></pre>
<p>&#x8FD9;&#x91CC;&#x6709;&#x70B9;&#x5C0F;&#x7455;&#x75B5;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>fact</code>&#x7684;&#x65F6;&#x5019;&#x603B;&#x5F97;<code>unbox</code>&#x3002;&#x5982;&#x679C;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E48;&#x5B9E;&#x73B0;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x5B8C;&#x7F8E;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([fact &apos;dummy])
    (begin
      (set! fact
            (lambda (n)
              (if (zero? n)
                  1
                  (* n (fact (- n 1))))))
      (fact 10)))
</code></pre>
<blockquote>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x4E00;&#x4E2A;&#x7528;&#x9014;&#x5C31;&#x662F;&#x7B80;&#x5316;&#x4E0A;&#x8FF0;&#x6A21;&#x5F0F;&#x7684;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x7ED1;&#x5B9A;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x65F6;&#x90FD;&#x5F97;unbox&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x8FC7;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x628A;unbox&#x5E26;&#x6389;&#x3002;</p>
</blockquote>
<h2 id="93-&#x8349;&#x7387;&#x7684;&#x89C2;&#x5BDF;">9.3 &#x8349;&#x7387;&#x7684;&#x89C2;&#x5BDF;</h2>
<p>&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x9075;&#x4ECE;&#x540C;&#x6837;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;&#x521B;&#x5EFA;&#x3001;&#x66F4;&#x65B0;&#x3001;&#x4F7F;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x88F9;&#x5728;&#x8BED;&#x6CD5;&#x7CD6;&#x4E2D;&#x3002;&#x8003;&#x8651;&#x5B9E;&#x73B0;&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x6CD5;&#xFF1A;</p>
<pre><code class="lang-Racket">(rec name value body)
</code></pre>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-Racket">(rec fact
     (lambda (n) (if (= n 0) 1 (* n (fact (- n 1)))))
     (fact 10))
</code></pre>
<p>&#x5B83;&#x5C06;&#x8BA1;&#x7B97;&#x5F97;&#x5230;10&#x7684;&#x9636;&#x4E58;&#x3002;&#x8BE5;&#x8BED;&#x6CD5;&#x7CD6;&#x89E3;&#x5F00;&#x4F1A;&#x5F97;&#x5230;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([name (box &apos;dummy)])
  (begin
    (set-box! name value)
     body))
</code></pre>
<p>&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;<code>value</code>&#x548C;<code>body</code>&#x4E2D;&#x6240;&#x6709;&#x5BF9;<code>name</code>&#x7684;&#x5F15;&#x7528;&#x90FD;&#x88AB;&#x6539;&#x5199;&#x4E3A;<code>(unbox name)</code>&#xFF1B;&#x6216;&#x8005;&#x6362;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([name &apos;dummy])
  (begin
    (set! name value)
    body))
</code></pre>
<p>&#x8FD9;&#x81EA;&#x7136;&#x5C31;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x641E;&#x7838;&#x4E86;&#x987A;&#x5E8F;&#x5462;&#xFF1F;&#x6700;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x66F4;&#x65B0;<code>name</code>&#x5230;&#x5B9E;&#x9645;&#x503C;&#x4E4B;&#x524D;&#x4F7F;&#x7528;&#x5B83;&#x5462;&#xFF1F;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x7CFB;&#x7EDF;&#x7ED9;&#x8BE5;&#x7ED3;&#x6784;&#x7684;&#x65E0;&#x610F;&#x4E49;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x539F;&#x59CB;&#x5F62;&#x5F0F;&#x7684;&#x5360;&#x4F4D;&#x7B26;&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x53EF;&#x4EE5;&#x63CF;&#x8FF0;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">(letrec ([x x])
  x)
</code></pre>
<p>&#x6216;&#x8005;&#x7B49;&#x4EF7;&#x7684;&#xFF1A;</p>
<pre><code class="lang-Racket">(local ([define x x])
  x)
</code></pre>
<p>&#x5728;&#x5927;&#x591A;&#x6570;Racket&#x53D8;&#x4F53;&#x4E2D;&#xFF0C;&#x8FD9;&#x4F1A;&#x6CC4;&#x9732;&#x5360;&#x4F4D;&#x7B26;&#x7684;&#x521D;&#x59CB;&#x503C;&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x503C;&#x5E76;&#x6CA1;&#x6253;&#x7B97;&#x7ED9;&#x5927;&#x5BB6;&#x4F7F;&#x7528;&#x3002;&#x9EBB;&#x70E6;&#x7684;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x8FD9;&#x53C8;&#x662F;&#x4E2A;&#x5408;&#x6CD5;&#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x81F3;&#x5C11;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x4E8E;&#x4E00;&#x4E9B;&#x8BA1;&#x7B97;&#x4E2D;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x65E0;&#x610F;&#x4E2D;&#x8BBF;&#x95EE;&#x548C;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x90A3;&#x4E48;&#x540E;&#x7EED;&#x7684;&#x8BA1;&#x7B97;&#x5C31;&#x662F;&#x778E;&#x626F;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x6709;&#x4E09;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;</p>
<ol>
<li>&#x786E;&#x4FDD;&#x8BE5;&#x503C;&#x8DB3;&#x591F;&#x6A21;&#x7CCA;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x65E0;&#x6CD5;&#x5728;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x4F7F;&#x7528;&#x8BE5;&#x503C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x50CF;<code>0</code>&#x8FD9;&#x79CD;&#x503C;&#x5C31;&#x4E0D;&#x80FD;&#x7528;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x8BED;&#x8A00;&#x4E2D;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x90FD;&#x4E0D;&#x8BE5;&#x7528;&#x3002;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#xFF0C;&#x8BED;&#x8A00;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x4E00;&#x79CD;&#x65B0;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x4E13;&#x4F5C;&#x6B64;&#x7528;&#x3002;&#x5C06;&#x8BE5;&#x503C;&#x4F20;&#x5165;&#x5176;&#x5B83;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x90FD;&#x5C06;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x7684;&#x629B;&#x51FA;&#x3002;
2.
&#x5BF9;&#x4E8E;&#x4EFB;&#x610F;&#x4E00;&#x5904;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x660E;&#x786E;&#x5730;&#x68C0;&#x67E5;&#x5176;&#x503C;&#x662F;&#x5426;&#x662F;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x201C;&#x8FC7;&#x65E9;&#x201D;&#x503C;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4F1A;&#x5BF9;&#x7A0B;&#x5E8F;&#x9020;&#x6210;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x6027;&#x80FD;&#x635F;&#x5931;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x6559;&#x5B66;&#x8BED;&#x8A00;&#x8FD9;&#x4E48;&#x505A;&#x3002;</li>
<li>&#x53EA;&#x5141;&#x8BB8;&#x9012;&#x5F52;&#x6784;&#x9020;&#x7528;&#x4E8E;&#x7ED1;&#x5B9A;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x6C42;&#x8BE5;&#x7ED1;&#x5B9A;&#x7684;&#x53F3;&#x9879;&#x5FC5;&#x987B;<strong>&#x5728;&#x8BED;&#x6CD5;&#x4E0A;</strong>&#x662F;&#x51FD;&#x6570;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x8FC7;&#x4E8E;&#x6FC0;&#x8FDB;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x5B83;&#x4E0D;&#x5141;&#x8BB8;&#x4E86;&#x6211;&#x4EEC;&#x5199;&#x51FA;&#x56FE;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x6784;&#x3002;</li>
</ol>
<h2 id="94-&#x4E0D;&#x7528;&#x5230;&#x663E;&#x5F0F;&#x7684;&#x72B6;&#x6001;">9.4 &#x4E0D;&#x7528;&#x5230;&#x663E;&#x5F0F;&#x7684;&#x72B6;&#x6001;</h2>
<p>&#x806A;&#x660E;&#x7684;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x5230;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x9012;&#x5F52;&#x51FD;&#x6570;&#xFF08;&#x9012;&#x5F52;&#x6570;&#x636E;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF09;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7528;&#x5230;&#x663E;&#x5F0F;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x660E;&#x767D;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>let</code>&#x6765;&#x5B9A;&#x4E49;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x65F6;&#x51FA;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;&#x8BF7;&#x518D;&#x8BD5;&#x8BD5;&#x3002;&#x63D0;&#x793A;&#xFF1A;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x66FF;&#x6362;&#x3002;&#x4E0D;&#x591F;&#x518D;&#x52A0;&#xFF0C;&#x52A0;&#x6EE1;&#xFF01;</p>
</blockquote>
<p>&#x4EC5;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#xFF08;&#x5B57;&#x9762;&#x610F;&#x601D;&#x4E0A;&#xFF09;&#x83B7;&#x5F97;&#x9012;&#x5F52;&#x662F;&#x4E2A;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x60F3;&#x6CD5;&#x3002;Daniel P. Friedman&#x548C; Matthias Felleisen&#x5728;&#x300A;The Little Schemer&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x5F88;&#x597D;&#x7684;&#x63CF;&#x8FF0;&#x4E86;&#x5176;&#x505A;&#x6CD5;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BFB;&#x4E00;&#x4E0B;&#x5176;<a href="http://www.ccs.neu.edu/home/matthias/BTLS/sample.pdf" target="_blank">&#x5728;&#x7EBF;&#x6837;&#x7AE0;</a>&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;</strong></p>
<blockquote>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x4E2D;&#x7528;&#x5230;&#x4E86;&#x72B6;&#x6001;&#x5417;&#xFF1F;&#x6709;&#x6CA1;&#x6709;&#x95F4;&#x63A5;&#x7684;&#x7528;&#x5230;&#x5462;&#xFF1F;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap8.html" class="navigation navigation-prev " aria-label="Previous page:  8. 可变结构体和变量">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap10.html" class="navigation navigation-next " aria-label="Next page: 10. 对象">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":" 9. 递归和循环：子程序与数据","level":"1.10","depth":1,"next":{"title":"10. 对象","level":"1.11","depth":1,"path":"chap10.md","ref":"chap10.md","articles":[]},"previous":{"title":" 8. 可变结构体和变量","level":"1.9","depth":1,"path":"chap8.md","ref":"chap8.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-76420995-1"},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc; MrMathematica","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap9.md","mtime":"2018-09-28T07:36:04.703Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-28T07:36:08.800Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

