
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>15. 静态地检查程序中的不变量：类型 · Programming Languages: Application and Interpretation</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="lotuc; MrMathematica">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chap16.html" />
    
    
    <link rel="prev" href="chap14.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    封面
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chap1.html">
            
                <a href="chap1.html">
            
                    
                     1. 引言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chap2.html">
            
                <a href="chap2.html">
            
                    
                     2. 本书有关语法解析的一切
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chap3.html">
            
                <a href="chap3.html">
            
                    
                     3. 解释器初窥
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chap4.html">
            
                <a href="chap4.html">
            
                    
                     4. 初试去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chap5.html">
            
                <a href="chap5.html">
            
                    
                     5. 添加函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="chap6.html">
            
                <a href="chap6.html">
            
                    
                     6. 从替换模型到环境模型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chap7.html">
            
                <a href="chap7.html">
            
                    
                     7. 任意位置的函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chap8.html">
            
                <a href="chap8.html">
            
                    
                     8. 可变结构体和变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chap9.html">
            
                <a href="chap9.html">
            
                    
                     9. 递归和循环：子程序与数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chap10.html">
            
                <a href="chap10.html">
            
                    
                    10. 对象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chap11.html">
            
                <a href="chap11.html">
            
                    
                    11. 内存管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chap12.html">
            
                <a href="chap12.html">
            
                    
                    12. 表示层抉择
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chap13.html">
            
                <a href="chap13.html">
            
                    
                    13. 语言中支持去语法糖
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chap14.html">
            
                <a href="chap14.html">
            
                    
                    14. 控制指令
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.16" data-path="chap15.html">
            
                <a href="chap15.html">
            
                    
                    15. 静态地检查程序中的不变量：类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="chap16.html">
            
                <a href="chap16.html">
            
                    
                    16. 动态地检查程序中的不变量：契约
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chap17.html">
            
                <a href="chap17.html">
            
                    
                    17. 其他调用语义
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >15. 静态地检查程序中的不变量：类型</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="15-&#x9759;&#x6001;&#x5730;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#xFF1A;&#x7C7B;&#x578B;">15 &#x9759;&#x6001;&#x5730;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#xFF1A;&#x7C7B;&#x578B;</h1>
<p>&#x5F53;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x5927;&#x6216;&#x8005;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5E0C;&#x671B;&#x80FD;&#x6709;&#x5DE5;&#x5177;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x63CF;&#x8FF0;&#x3001;&#x9A8C;&#x8BC1;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;<strong>&#x4E0D;&#x53D8;&#x91CF;</strong>&#x3002;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x4E0D;&#x53D8;&#x91CF;&#x6307;&#x7684;&#x5C31;&#x662F;&#x5173;&#x4E8E;&#x7A0B;&#x5E8F;&#x7EC4;&#x6210;&#x5143;&#x7D20;&#x7684;&#x90A3;&#x4E9B;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x7684;&#x9648;&#x8FF0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#x5199;&#x4E0B;<code>x : number</code>&#x65F6;&#xFF0C;&#x8868;&#x793A; x &#x4E2D;&#x5B58;&#x653E;&#x7684;&#x603B;&#x662F;&#x6570;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F9D;&#x8D56; x &#x7684;&#x90E8;&#x5206;&#x90FD;&#x53EF;&#x4EE5;&#x8BA4;&#x5B9A;&#x5B83;&#x662F;&#x6570;&#x7684;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x7C7B;&#x578B;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x9648;&#x8FF0;&#x7684;&#x5404;&#x7C7B;&#x4E0D;&#x53D8;&#x91CF;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x68C0;&#x6D4B;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x4F17;&#x591A;&#x7684;&#x6280;&#x672F;&#x5BB6;&#x65CF;&#x2014;&#x2014;&#x4E5F;&#x53EA;&#x662F;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x4F17;&#x591A;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x3002;</p>
<h2 id="151-&#x9759;&#x6001;&#x7C7B;&#x578B;&#x89C4;&#x5219;">15.1 &#x9759;&#x6001;&#x7C7B;&#x578B;&#x89C4;&#x5219;</h2>
<p>&#x672C;&#x7AE0;&#x6211;&#x4EEC;&#x5C06;&#x4E13;&#x6CE8;&#x4E8E;<strong>&#x9759;&#x6001;&#x7C7B;&#x578B;&#x68C0;&#x67E5;</strong>&#xFF1A;&#x5373;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x524D;&#x68C0;&#x67E5;&#xFF08;&#x58F0;&#x660E;&#x7684;&#xFF09;&#x7C7B;&#x578B;&#x3002;&#x4E4B;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x5DF2;&#x7ECF;&#x8BA9;&#x6211;&#x4EEC;&#x79EF;&#x6512;&#x4E86;&#x4E00;&#x4E9B;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x7A0B;&#x5E8F;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x7D22;&#x7C7B;&#x578B;&#x7684;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#x53CA;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x6743;&#x8861;&#x53D6;&#x820D;&#x3002;&#x5C3D;&#x7BA1;&#x7C7B;&#x578B;&#x662F;&#x63A7;&#x5236;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x4E14;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x4F1A;&#x8003;&#x5BDF;&#x4E00;&#x4E9B;&#x5176;&#x5B83;&#x53EF;&#x7528;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<p>&#x8003;&#x8651;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x5199;&#x5C31;&#x7684;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (f [n : number]) : number
  (+ n 3))

(f &quot;x&quot;)
</code></pre>
<p>&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x524D;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x3002;&#x4F7F;&#x7528;&#x666E;&#x901A; Racket &#x5199;&#x5C31;&#x7684;&#x540C;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;&#x53BB;&#x9664;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#xFF09;&#x53EA;&#x4F1A;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x51FA;&#x9519;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (f n)
  (+ n 3))

(f &quot;x&quot;)
</code></pre>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x5982;&#x4F55;&#x5224;&#x65AD;&#x9519;&#x8BEF;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x524D;&#x8FD8;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x629B;&#x51FA;&#x7684;&#xFF1F;</p>
</blockquote>
<p>&#x8003;&#x8651;&#x4E0B;&#x9762;&#x8FD9;&#x6BB5; Racket &#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define f n
  (+ n 3))
</code></pre>
<p>&#x5B83;&#x4E5F;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x524D;&#x5C31;&#x9047;&#x5230;&#x9519;&#x8BEF;&#x2014;&#x2014;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x9519;&#x8BEF;&#x2014;&#x2014;&#x7EC8;&#x6B62;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x548C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x2014;&#x2014;&#x901A;&#x5E38;&#x662F;&#x56E0;&#x4E3A;&#x7C7B;&#x578B;&#x68C0;&#x6D4B;&#x662F;&#x9488;&#x5BF9;&#x5DF2;&#x7ECF;&#x88AB;&#x89E3;&#x6790;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x505A;&#x7684;&#x2014;&#x2014;&#x4F46;&#x662F;&#x5C06;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x770B;&#x4F5C;&#x4E00;&#x79CD;&#x6700;&#x7B80;&#x5355;&#x5F62;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#xFF1A;&#x5B83;&#xFF08;&#x9759;&#x6001;&#x5730;&#xFF09;&#x5224;&#x5B9A;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x9075;&#x5B88;&#x67D0;&#x4E2A;<strong>&#x4E0A;&#x4E0B;&#x6587;&#x65E0;&#x5173;</strong>&#x8BED;&#x6CD5;&#x3002;&#x968F;&#x540E;&#xFF0C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5224;&#x5B9A;&#x5B83;&#x662F;&#x5426;&#x9075;&#x5B88;&#x67D0;&#x4E2A;<strong>&#x4E0A;&#x4E0B;&#x6587;&#x76F8;&#x5173;</strong>&#xFF08;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x66F4;&#x4E30;&#x5BCC;&#x7684;&#xFF09;&#x8BED;&#x6CD5;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x770B;&#x662F;&#x8BED;&#x6CD5;&#x89E3;&#x6790;&#x7684;&#x6CDB;&#x5316;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x901A;&#x8FC7;<strong>&#x8BED;&#x6CD5;</strong>&#x63A7;&#x5236;&#x7A0B;&#x5E8F;&#x9075;&#x5FAA;&#x6307;&#x5B9A;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
<h2 id="152-&#x5173;&#x4E8E;&#x7C7B;&#x578B;&#x7684;&#x7ECF;&#x5178;&#x770B;&#x6CD5;">15.2 &#x5173;&#x4E8E;&#x7C7B;&#x578B;&#x7684;&#x7ECF;&#x5178;&#x770B;&#x6CD5;</h2>
<p>&#x6211;&#x4EEC;&#x5148;&#x4ECB;&#x7ECD;&#x4F20;&#x7EDF;&#x7684;&#x5305;&#x542B;&#x7C7B;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#xFF1B;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x7D22;&#x5176;&#x6269;&#x5C55;&#x548C;&#x53D8;&#x79CD;&#x3002;</p>
<h3 id="1521-&#x7B80;&#x5355;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;">15.2.1 &#x7B80;&#x5355;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;</h3>
<p>&#x8981;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x9700;&#x8981;&#x5C31;&#x4E24;&#x4EF6;&#x4E8B;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#xFF1A;&#x6211;&#x4EEC;&#x9759;&#x6001;&#x7C7B;&#x578B;<strong>&#x6838;&#x5FC3;</strong>&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x6CD5;&#x3002;</p>
<p>&#x5148;&#x56DE;&#x5230;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5B9E;&#x73B0;&#x8FC7;&#x7684;<a href="chap7.html">&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x503C;</a>&#x7684;&#x90A3;&#x4E00;&#x7248;&#x8BED;&#x8A00;&#xFF0C;&#x5176;&#x4E2D;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x8D4B;&#x503C;&#x7B49;&#x5176;&#x5B83;&#x7A0D;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#xFF08;&#x540E;&#x9762;&#x5C06;&#x8BB2;&#x5230;&#x6DFB;&#x52A0;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E3A;&#x8BE5;&#x8BED;&#x8A00;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x3002;&#x6309;&#x60EF;&#x4F8B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5BF9;&#x5E38;&#x91CF;&#x6216;&#x57FA;&#x672C;&#x64CD;&#x4F5C;&#xFF08;&#x5982;&#x52A0;&#x6CD5;&#xFF09;&#x5F3A;&#x52A0;&#x7C7B;&#x578B;&#x6CE8;&#x91CA;&#xFF1B;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x7C7B;&#x578B;&#x6CE8;&#x91CA;&#x52A0;&#x5728;&#x51FD;&#x6570;&#x6216;&#x65B9;&#x6CD5;&#x7684;&#x8FB9;&#x754C;&#x4E0A;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x8BA8;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x505A;&#x3002;</p>
<p>&#x9274;&#x4E8E;&#x6B64;&#x51B3;&#x5B9A;&#xFF0C;&#x6211;&#x4EEC;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x53D8;&#x6210;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type TyExprC
  [numC (n : number)]
  [idC (s : symbol)]
  [appC (fun : TyExprC) (arg : TyExprC)]
  [plusC (l : TyExprC) (r : TyExprC)]
  [multC (l : TyExprC) (r : TyExprC)]
  [lamC (arg : symbol) (argT : Type) (retT : Type) (body : TyExprC)])
</code></pre>
<p>&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x90FD;&#x6DFB;&#x52A0;&#x4E86;&#x5176;&#x53C2;&#x6570;&#x53CA;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x7684;&#x6CE8;&#x89E3;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4F5C;&#x51FA;&#x9009;&#x62E9;&#x3002;&#x6211;&#x4EEC;&#x9075;&#x4ECE;&#x4F20;&#x7EDF;&#x5B9A;&#x4E49;&#xFF0C;&#x5373;&#x7C7B;&#x578B;&#x662F;<strong>&#x4E00;&#x7EC4;&#x503C;&#x7684;&#x96C6;&#x5408;&#x7684;&#x62BD;&#x8C61;</strong>&#x3002;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x4E24;&#x7C7B;&#x503C;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type Value
  [numV (n : number)]
  [closV (arg : symbol) (body : TyExprC) (env : Env)])
</code></pre>
<p>&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;&#x6570;&#x548C;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5373;&#x4F7F;&#x6570;&#x7C7B;&#x578B;&#x4E5F;&#x5E76;&#x4E0D;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#xFF1A;&#x6570;&#x7C7B;&#x578B;&#x5E94;&#x8BE5;&#x8BB0;&#x5F55;&#x4F55;&#x79CD;&#x4FE1;&#x606F;&#xFF1F;&#x5927;&#x90E8;&#x5206;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6709;<strong>&#x5F88;&#x591A;</strong>&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x54EA;&#x4E2A;&#x7C7B;&#x578B;&#x8868;&#x793A;&#x201C;&#x6570;&#x201D;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#x6570;&#x7684;&#x5C42;&#x7EA7;&#x7ED3;&#x6784;&#xFF08;&#x8BD1;&#x6CE8;&#xFF0C;&#x7B2C;&#x4E09;&#x7AE0;&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x6709;&#x4E00;&#x79CD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x8DB3;&#x77E3;&#x3002;&#x8FD9;&#x6837;&#x51B3;&#x5B9A;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x9700;&#x8981;&#x8BB0;&#x5F55;<strong>&#x54EA;&#x79CD;</strong>&#x6570;&#x7684;&#x4FE1;&#x606F;&#xFF1F; &#x539F;&#x5219;&#x4E0A;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x9047;&#x5230;&#x53EF;&#x5224;&#x5B9A;&#x6027;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF1A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x8BB0;&#x5F55;&#x4E0B;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x9664;&#x975E;&#x4E8B;&#x540E;&#x8BC1;&#x5B9E;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6CA1;&#x6709;&#x7528;&#x5904;&#x3002;&#x7ED3;&#x5408;&#x8FD9;&#x4E9B;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x62BD;&#x8C61;&#x8BED;&#x8A00;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type Type
  [numT]
  [funT (arg : Type) (ret : Type)])
</code></pre>
<p>&#x65E2;&#x7136;&#x5DF2;&#x7ECF;&#x786E;&#x5B9A;&#x4E86;&#x8BED;&#x8A00;&#x4E2D;&#x9879;&#x548C;&#x7C7B;&#x578B;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x6765;&#x786E;&#x5B9A;&#x8BED;&#x8A00;&#x4E2D;&#x54EA;&#x4E9B;&#x7B97;&#x662F;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF08;&#x5E76;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x8FD9;&#x91CC;&#x5217;&#x51FA;&#x7684;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF09;&#x3002;&#x663E;&#x7136;&#x6709;&#x4E09;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF1A;</p>
<ul>
<li><code>+</code>&#x7684;&#x53C2;&#x6570;&#x4E0D;&#x662F;&#x6570;&#xFF0C;&#x5373;&#x4E0D;&#x662F;<code>numT</code>&#x3002;</li>
<li><code>*</code>&#x7684;&#x53C2;&#x6570;&#x4E0D;&#x662F;&#x6570;&#x3002;</li>
<li>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x51FD;&#x6570;&#x4F4D;&#x7F6E;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x4E0D;&#x662F;<code>funT</code>&#x3002;</li>
</ul>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x8FD8;&#x6709;&#x5176;&#x5B83;&#x5F62;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x9057;&#x6F0F;&#x4E86;&#x4E00;&#x4E2A;&#xFF1A;</p>
<ul>
<li>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x5B9E;&#x53C2;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x51FD;&#x6570;&#x5F62;&#x53C2;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x4F3C;&#x4E4E;&#x90FD;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x521D;&#x6B65;&#x8BBE;&#x60F3;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x8868;&#x8FBE;&#x5F0F;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x5E03;&#x5C14;&#x503C;&#x6307;&#x660E;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x5426;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x3002;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x5305;&#x542B;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x663E;&#x7136;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E2A;<strong>&#x7C7B;&#x578B;&#x73AF;&#x5883;</strong>&#xFF0C;&#x5B83;&#x5C06;&#x540D;&#x5B57;&#x6620;&#x5C04;&#x5230;&#x7C7B;&#x578B;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x7528;&#x5230;&#x7684;&#x503C;&#x73AF;&#x5883;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x5B9A;&#x4E49;&#x4E0E;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#x76F8;&#x5173;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x51FD;&#x6570;&#x3002;</p>
</blockquote>
<p>&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5199;&#x4E0B;&#x7684;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x5927;&#x81F4;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;tc-take-1&gt; ::=  ;;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;

    (define (tc [expr : TyExprC] [tenv : TyEnv]) : boolean
      (type-case TyExprC expr
        &lt;tc-take-1-numC-case&gt;
        &lt;tc-take-1-idC-case&gt;
        &lt;tc-take-1-appC-case&gt;))
</code></pre>
<p>&#x6B63;&#x5982;&#x4E0A;&#x9762;&#x7A0B;&#x5E8F;&#x4E2D;&#x5217;&#x51FA;&#x7684;&#x8981;&#x5904;&#x7406;&#x51E0;&#x79CD;&#x60C5;&#x5F62;&#x6240;&#x8868;&#x660E;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x884C;&#x4E0D;&#x901A;&#x3002;&#x6211;&#x4EEC;&#x5F88;&#x5FEB;&#x5C06;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5904;&#x7406;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x5F62;&#xFF1A;&#x6570;&#x3002;&#x5355;&#x72EC;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5417;&#xFF1F;&#x663E;&#x7136;&#x53EF;&#x4EE5;&#xFF1B;&#x5B83;&#x6240;&#x5904;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x5E94;&#x8BE5;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x88AB;&#x68C0;&#x67E5;&#x51FA;&#x3002;&#x56E0;&#x6B64;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;tc-take-1-numC-case&gt; ::=

    [numC (n) true]
</code></pre>
<p>&#x4E0B;&#x9762;&#x5904;&#x7406;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x6807;&#x8BC6;&#x7B26;&#x662F;&#x5426;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5462;&#xFF1F;&#x540C;&#x6837;&#xFF0C;&#x5C31;&#x5176;&#x81EA;&#x8EAB;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x7ED1;&#x5B9A;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x603B;&#x662F;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x7684;&#xFF1B;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x4E0A;&#x4E0B;&#x6587;&#x8981;&#x6C42;&#x7684;&#x90A3;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x5E94;&#x8BE5;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x68C0;&#x67E5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;tc-take-1-idC-case&gt; ::=

    [idC (n) (if (lookup n tenv)
                 true
                 (error &apos;tc &quot;not a bound identifier&quot;))]  ;&#x4E0D;&#x662F;&#x7ED1;&#x5B9A;&#x6807;&#x8BC6;&#x7B26;
</code></pre>
<p>&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4F60;&#x53EF;&#x80FD;&#x611F;&#x89C9;&#x4E0D;&#x592A;&#x5BF9;&#xFF1A;&#x5982;&#x679C;&#x6807;&#x8BC6;&#x7B26;&#x672A;&#x7ED1;&#x5B9A;&#x7684;&#x8BDD;&#xFF0C;<code>lookup</code>&#x4F1A;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x5FC5;&#x8981;&#x518D;&#x53BB;&#x91CD;&#x590D;&#x5904;&#x7406;&#x8BE5;&#x60C5;&#x51B5;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4EE3;&#x7801;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x5230;<code>error</code>&#x8C03;&#x7528;&#x90A3;&#x4E2A;&#x5206;&#x652F;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x5148;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6765;&#x5904;&#x7406;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x51FD;&#x6570;&#x4F4D;&#x7F6E;&#xFF0C;&#x786E;&#x5B9A;&#x5B83;&#x662F;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x7136;&#x540E;&#x786E;&#x4FDD;&#x5B9E;&#x9645;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x8BE5;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x65F6;&#x58F0;&#x660E;&#x7684;&#x5F62;&#x5F0F;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x51FD;&#x6570;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x53C2;&#x6570;&#x662F;&#x6570;&#xFF0C;&#x4F46;&#x8C03;&#x7528;&#x7ED9;&#x7684;&#x662F;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x53CD;&#x4E4B;&#xFF0C;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x9632;&#x6B62;&#x9519;&#x8BEF;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x8BE5;&#x600E;&#x4E48;&#x5199;&#xFF1F;</p>
<pre><code class="lang-Racket">&lt;tc-take-1-appC-case&gt; ::=

    [appC (f a) (let ([ft (tc f tenv)])
                  ...)]
</code></pre>
<p>&#x5BF9;&#x4E8E;<code>tc</code>&#x7684;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x53EA;&#x80FD;&#x8BA9;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x51FD;&#x6570;&#x4F4D;&#x7F6E;&#x662F;&#x5426;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x5982;&#x679C;&#x5B83;&#x901A;&#x8FC7;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x5B83;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;&#x8BED;&#x6CD5;&#x4E0A;&#x53D6;&#x5F97;&#x5176;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x80FD;<strong>&#x8BA1;&#x7B97;</strong>&#x51FA;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x53EA;&#x6709;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x4E2A;&#x7C7B;&#x578B;&#x6B63;&#x786E;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x65F6;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x624D;&#x80FD;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x7ED3;&#x679C;&#xFF1B;&#x5426;&#x5219;&#x7684;&#x8BDD;&#x5B83;&#x5C06;&#x4E0D;&#x80FD;&#x5F97;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;<strong>&#x201C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x201D;&#x662F;&#x201C;&#x7C7B;&#x578B;&#x8BA1;&#x7B97;&#x201D;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x60C5;&#x5F62;</strong>&#xFF01;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x589E;&#x5F3A;<code>tc</code>&#x7684;&#x5F52;&#x7EB3;&#x4E0D;&#x53D8;&#x91CF;&#xFF1A;&#x5373;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x8FD4;&#x56DE;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x5426;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x800C;&#x662F;&#x8FD4;&#x56DE;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x901A;&#x8FC7;&#x4E86;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF1B;&#x5426;&#x5219;&#x5B83;&#x4F1A;&#x629B;&#x51FA;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x5B9A;&#x4E49;&#x8FD9;&#x4E2A;&#x66F4;&#x5B8C;&#x5584;&#x7684;&#x7C7B;&#x578B;&#x201C;&#x68C0;&#x67E5;&#x5668;&#x201D;&#x3002;</p>
<pre><code class="lang-Racket">&lt;tc&gt; ::=

    (define (tc [expr : TyExprC] [tenv : TyEnv]) : Type
      (type-case TyExprC expr
        &lt;tc-numC-case&gt;
        &lt;tc-idC-case&gt;
        &lt;tc-plusC-case&gt;
        &lt;tc-multC-case&gt;
        &lt;tc-appC-case&gt;
        &lt;tc-lamC-case&gt;))
</code></pre>
<p>&#x73B0;&#x5728;&#x586B;&#x5145;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x3002;&#x6570;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x6570;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code class="lang-Racket">&lt;tc-numC-case&gt; ::=

    [numC (n) (numT)]
</code></pre>
<p>&#x4E0E;&#x4E4B;&#x76F8;&#x4F3C;&#xFF0C;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x7C7B;&#x578B;&#x4ECE;&#x73AF;&#x5883;&#x4E2D;&#x67E5;&#x8BE2;&#x5F97;&#x5230;&#xFF08;&#x5982;&#x679C;&#x5176;&#x672A;&#x88AB;&#x7ED1;&#x5B9A;&#x5219;&#x4F1A;&#x629B;&#x51FA;&#x9519;&#x8BEF;&#xFF09;&#x3002;</p>
<pre><code class="lang-Racket">&lt;tc-idC-case&gt; ::=

    [idC (n) (lookup n tenv)]
</code></pre>
<p>&#x5230;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x5230;&#x8BE5;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4E0E;&#x89E3;&#x91CA;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x4E9B;&#x5F02;&#x540C;&#xFF1A;&#x5BF9;&#x4E8E;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x4E24;&#x8005;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5176;&#x5B9E;&#x4E00;&#x6837;&#xFF08;&#x53EA;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x7C7B;&#x578B;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x503C;&#xFF09;&#xFF0C;&#x5BF9;&#x4E8E;&#x6570;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x91CC;&#x8FD4;&#x56DE;&#x4E86;&#x62BD;&#x8C61;&#x7684;&#x201C;&#x6570;&#x201D;&#x800C;&#x4E0D;&#x662F;&#x5177;&#x4F53;&#x7684;&#x6570;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8003;&#x8651;&#x52A0;&#x6CD5;&#x3002;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x5176;&#x4E24;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x5177;&#x6709;&#x6570;&#x7C7B;&#x578B;&#xFF1B;&#x5982;&#x679C;&#x6EE1;&#x8DB3;&#x8BE5;&#x6761;&#x4EF6;&#xFF0C;&#x5219;&#x52A0;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#x672C;&#x8EAB;&#x8FD4;&#x56DE;&#x7684;&#x662F;&#x6570;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code class="lang-Racekt">&lt;tc-plusC-case&gt; ::=

    [plusC (l r) (let ([lt (tc l tenv)]
                       [rt (tc r tenv)])
                   (if (and (equal? lt (numT))
                            (equal? rt (numT)))
                       (numT)
                       (error &apos;tc &quot;+ not both numbers&quot;)))] ;+&#x4E0D;&#x90FD;&#x662F;&#x6570;
</code></pre>
<p>&#x901A;&#x5E38;&#x5728;&#x5904;&#x7406;&#x5B8C;&#x52A0;&#x6CD5;&#x7684;&#x60C5;&#x5F62;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E58;&#x6CD5;&#x6211;&#x4EEC;&#x5C31;&#x4E00;&#x7B14;&#x5E26;&#x8FC7;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x663E;&#x5F0F;&#x5904;&#x7406;&#x4E00;&#x4E0B;&#x5B83;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x6559;&#x76CA;&#x7684;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;tc-multC-case&gt; ::=

    [multC (l r) (let ([lt (tc l tenv)]
                       [rt (tc r tenv)])
                   (if (and (equal? lt (numT))
                            (equal? rt (numT)))
                       (numT)
                       (error &apos;tc &quot;* not both numbers&quot;)))] ;*&#x4E0D;&#x90FD;&#x662F;&#x6570;
</code></pre>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x770B;&#x51FA;&#x5176;&#x4E2D;&#x7684;&#x533A;&#x522B;&#x4E86;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x662F;&#x7684;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;<strong>&#x5B8C;&#x5168;</strong>&#x6CA1;&#x533A;&#x522B;&#xFF01;&#xFF08;&#x4EC5;&#x6709;&#x7684;&#x533A;&#x522B;&#x662F;&#x5728;<code>type-case</code>&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x5206;&#x522B;<code>multC</code>&#x548C;<code>plusC</code>&#xFF0C;&#x4EE5;&#x53CA;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x4ECE;&#xFF08;&#x6B64;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF09;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x8BF4;&#xFF0C;&#x52A0;&#x6CD5;&#x548C;&#x4E58;&#x6CD5;&#x6CA1;&#x6709;&#x533A;&#x522B;&#xFF0C;&#x66F4;&#x751A;&#xFF0C;<strong>&#x4EFB;&#x610F;</strong>&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6570;&#x7684;&#x51FD;&#x6570;&#x90FD;&#x6CA1;&#x6709;&#x533A;&#x522B;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x5230;&#x4EE3;&#x7801;&#x89E3;&#x91CA;&#x548C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x4E4B;&#x95F4;&#x53E6;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x70B9;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x53C2;&#x6570;&#x90FD;&#x5F97;&#x662F;&#x6570;&#x3002;&#x89E3;&#x91CA;&#x5668;&#x8FD4;&#x56DE;&#x52A0;&#x6216;&#x8005;&#x4E58;&#x5B83;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x786E;&#x5207;&#x6570;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x5E76;&#x4E0D;&#x5728;&#x4E4E;&#x5177;&#x4F53;&#x7684;&#x6570;&#x503C;&#xFF1A;&#x56E0;&#x6B64;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF08;<code>(numT)</code>&#xFF09;&#x662F;&#x4E2A;&#x5E38;&#x6570;&#xFF0C;&#x4E24;&#x79CD;&#x60C5;&#x5F62;&#x8FD4;&#x56DE;&#x90FD;&#x662F;&#x8BE5;&#x5E38;&#x6570;&#x3002;</p>
<p>&#x6700;&#x540E;&#x8FD8;&#x5269;&#x4E0B;&#x4E24;&#x4E2A;&#x96BE;&#x4E00;&#x70B9;&#x7684;&#x60C5;&#x5F62;&#xFF1A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x548C;&#x51FD;&#x6570;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x600E;&#x4E48;&#x5904;&#x7406;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF1A;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#xFF1B;&#x786E;&#x4FDD;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#xFF1B;&#x68C0;&#x67E5;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x548C;&#x51FD;&#x6570;&#x5F62;&#x53C2;&#x7C7B;&#x578B;&#x76F8;&#x5BB9;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#x6EE1;&#x8DB3;&#xFF0C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#xFF08;&#x56E0;&#x4E3A;&#x8FD0;&#x884C;&#x65F6;&#x6700;&#x7EC8;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x5C31;&#x662F;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#x4F53;&#x5F97;&#x5230;&#x7684;&#x503C;&#xFF09;&#x3002;</p>
<pre><code class="lang-Racket">&lt;tc-appC-case&gt; ::=

    [appC (f a) (let ([ft (tc f tenv)]
                      [at (tc a tenv)])
                  (cond
                    [(not (funT? ft))
                     (error &apos;tc &quot;not a function&quot;)] ;&#x4E0D;&#x662F;&#x51FD;&#x6570;
                    [(not (equal? (funT-arg ft) at))
                     (error &apos;tc &quot;app arg mismatch&quot;)] ;app&#x53C2;&#x6570;&#x4E0D;&#x5339;&#x914D;
                    [else (funT-ret ft)]))]
</code></pre>
<p>&#x6700;&#x540E;&#x8FD8;&#x5269;&#x4E0B;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x3002;&#x51FD;&#x6570;&#x6709;&#x4E00;&#x4E2A;&#x5F62;&#x53C2;&#xFF0C;&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#x4E00;&#x822C;&#x4F1A;&#x7528;&#x5230;&#xFF1B;&#x9664;&#x975E;&#x5B83;&#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4E0D;&#x7136;&#x51FD;&#x6570;&#x4F53;&#x5E94;&#x8BE5;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6269;&#x5C55;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#xFF0C;&#x6DFB;&#x52A0;&#x5F62;&#x53C2;&#x4E0E;&#x5176;&#x7C7B;&#x578B;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6269;&#x5C55;&#x540E;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x68C0;&#x67E5;&#x51FD;&#x6570;&#x4F53;&#x3002;&#x6700;&#x7EC8;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x51FD;&#x6570;&#x4F53;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x548C;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;&#x5982;&#x679C;&#x6EE1;&#x8DB3;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x6307;&#x5B9A;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x5230;&#x51FD;&#x6570;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x201C;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x201D;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;</p>
</blockquote>
<pre><code class="lang-Racket">&lt;tc-lamC-case&gt; ::=

    [lamC (a argT retT b)
          (if (equal? (tc b (extend-ty-env (bind a argT) tenv)) retT)
              (funT argT retT)
              (error &apos;tc &quot;lam type mismatch&quot;))] ;&#x3BB;&#x7C7B;&#x578B;&#x4E0D;&#x5339;&#x914D;
</code></pre>
<p>&#x6CE8;&#x610F;&#x5230;&#x89E3;&#x91CA;&#x5668;&#x4E0E;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x53E6;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x3002;&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8D1F;&#x8D23;&#x8BA1;&#x7B97;&#x53C2;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x503C;&#xFF0C;&#x6269;&#x5C55;&#x73AF;&#x5883;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x51FD;&#x6570;&#x4F53;&#x6C42;&#x503C;&#x3002;&#x800C;&#x8FD9;&#x91CC;&#xFF0C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x60C5;&#x5F62;&#x4E2D;&#x7684;&#x786E;&#x4E5F;&#x68C0;&#x67E5;&#x4E86;&#x53C2;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x73AF;&#x5883;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x4E86;&#x51FD;&#x6570;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x800C;<strong>&#x6CA1;&#x6709;&#x904D;&#x5386;&#x5B83;</strong>&#x3002;&#x5BF9;&#x51FD;&#x6570;&#x4F53;&#x7684;&#x904D;&#x5386;&#x68C0;&#x67E5;&#x8FC7;&#x7A0B;&#x5B9E;&#x9645;&#x662F;&#x5728;&#x68C0;&#x67E5;&#x51FD;&#x6570;<strong>&#x5B9A;&#x4E49;</strong>&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x73AF;&#x5883;&#x4E5F;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x624D;&#x5B9E;&#x9645;&#x88AB;&#x6269;&#x5C55;&#x7684;&#x3002;</p>
<h3 id="1522-&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;">15.2.2 &#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;</h3>
<p>&#x8003;&#x8651;&#x4E3A;&#x4E0A;&#x9762;&#x7684;&#x8BED;&#x8A00;&#x6DFB;&#x52A0;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#xFF0C;&#x5373;&#x4F7F;&#x6700;&#x7B80;&#x5355;&#x7684; if &#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x4F1A;&#x5F15;&#x5165;&#x82E5;&#x5E72;&#x8BBE;&#x8BA1;&#x6289;&#x62E9;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5148;&#x8BA8;&#x8BBA;&#x5176;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x56DE;&#x8FC7;&#x5934;&#x8BA8;&#x8BBA;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x3002;</p>
<ol>
<li>&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#x5B83;&#x5FC5;&#x987B;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x9700;&#x8981;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x6DFB;&#x52A0;&#x5E03;&#x5C14;&#x503C;&#x7C7B;&#x578B;&#xFF08;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF09;&#x3002;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x503C;&#xFF0C;&#x67D0;&#x4E9B;&#x503C;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x201C;&#x771F;&#x503C;&#x201D;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x5219;&#x88AB;&#x89C6;&#x4E3A;&#x201C;&#x5047;&#x503C;&#x201D;&#x3002;</li>
<li><code>then-</code>&#x548C;<code>else-</code>&#x4E24;&#x4E2A;&#x5206;&#x652F;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x6574;&#x4E2A; if &#x8868;&#x8FBE;&#x5F0F;&#x6709;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x65E0;&#x6B67;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5176;&#x5B83;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x5206;&#x652F;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x6781;&#x5927;&#x5730;&#x6539;&#x53D8;&#x4E86;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x6539;&#x53D8;&#x4E86;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x7684;&#x6027;&#x8D28;&#x3002;</li>
</ol>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x4E3A;&#x8BE5;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x6DFB;&#x52A0;&#x5E03;&#x5C14;&#x503C;&#x3002;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x4E9B;&#x5565;&#xFF1F;&#x5728;&#x5178;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x8FD8;&#x9700;&#x8981;&#x52A0;&#x4EC0;&#x4E48;&#xFF1F;</p>
</blockquote>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x4E3A;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#x89C4;&#x5219;&#xFF0C;&#x5176;&#x4E2D;&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#x5E94;&#x8BE5;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x4E14;<code>then-</code>&#x548C;<code>else-</code>&#x5206;&#x652F;&#x5FC5;&#x987B;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x540C;&#x65F6;&#x8BE5;&#x7C7B;&#x578B;&#x4E5F;&#x662F;&#x6574;&#x4E2A;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
</blockquote>
<h3 id="1523-&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x9012;&#x5F52;">15.2.3 &#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x9012;&#x5F52;</h3>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4E0B;&#x9762;&#x4E3A;&#x5176;&#x6DFB;&#x52A0;&#x9012;&#x5F52;&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x8FC7;&#x9012;&#x5F52;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x901A;&#x8FC7;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x60C5;&#x51B5;&#x8981;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x3002;</p>
<h4 id="15231-&#x9012;&#x5F52;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x521D;&#x6B21;&#x5C1D;&#x8BD5;">15.2.3.1 &#x9012;&#x5F52;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x521D;&#x6B21;&#x5C1D;&#x8BD5;</h4>
<p>&#x9996;&#x5148;&#x5C1D;&#x8BD5;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5F53;&#x7136;&#x5C31;&#x662F;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4EC5;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x5417;&#xFF1F;&#x53EF;&#x4EE5;&#xFF1A;</p>
<pre><code class="lang-Racket">((lambda (x) (x x))
 (lambda (x) (x x)))
</code></pre>
<p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x5DF2;&#x7ECF;&#x652F;&#x6301;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x503C;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4F1A;&#x6784;&#x6210;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF1F;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE7;&#x5999;&#x5730;&#x4F9D;&#x8D56;&#x4E8E;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x672C;&#x8D28;&#x7684;&#xFF1F;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x4E3A;&#x6240;&#x6709;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x4E3A;&#x8BE5;&#x51FD;&#x6570;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x3002;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x5047;&#x8BBE;&#x4ECE;&#x73B0;&#x5728;&#x5F00;&#x59CB;&#x6211;&#x4EEC;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x6CD5;&#x662F;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x5C42;&#x8BED;&#x6CD5;&#xFF0C;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5C06;&#x5E2E;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E24;&#x4E2A;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E92;&#x76F8;&#x8C03;&#x7528;&#x3002;&#x5386;&#x53F2;&#x539F;&#x56E0;&#xFF0C;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x88AB;&#x79F0;&#x4E3A;&#x3A9;&#xFF08;&#x5E0C;&#x814A;&#x5B57;&#x6BCD;&#x5927;&#x5199;&#x6B27;&#x7C73;&#x8304;&#xFF09;&#xFF0C;&#x90A3;&#x4E24;&#x4E2A;&#x4E00;&#x6837;&#x7684;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x88AB;&#x79F0;&#x4E3A;&#x3C9;&#xFF08;&#x5E0C;&#x814A;&#x5B57;&#x6BCD;&#x5C0F;&#x5199;&#x6B27;&#x7C73;&#x8304;&#xFF09;&#x3002;&#x4E24;&#x4E2A;&#x4E00;&#x6837;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5E76;&#x975E;&#x5F97;&#x662F;&#x540C;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x8FD8;&#x4F9D;&#x8D56;&#x4E8E;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x4E2D;&#x5BF9;&#x4E8E;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x89C2;&#x5BDF;&#x5230; x &#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x3C9;&#xFF0C;&#x4E8E;&#x662F;&#x3C9;&#x5C06;&#x51FA;&#x73B0;&#x5728;&#x5728;<code>(x x)</code>&#x5F0F;&#x5B50;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x7B2C;&#x4E8C;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x5373;&#xFF0C;&#x786E;&#x5B9A;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5F0F;&#x5B50;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x88AB;&#x786E;&#x5B9A;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x5C1D;&#x8BD5;&#x8BA1;&#x7B97;&#x3C9;&#x7684;&#x7C7B;&#x578B;&#xFF1B;&#x79F0;&#x8BE5;&#x7C7B;&#x578B;&#x4E3A;&#x3B3;&#x3002;&#x663E;&#x7136;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5355;&#x53C2;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x5FC5;&#x7136;&#x662F;<code>&#x3C6; -&gt; &#x3C8;</code>&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x3002;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#xFF1F;&#x5C31;&#x662F;&#x3C9;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4E5F;&#x5373;&#xFF0C;&#x4F20;&#x5165;&#x3C6;&#x7684;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x3B3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x3C9;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x3B3;&#xFF0C;&#x4E5F;&#x5373;<code>&#x3C6; -&gt; &#x3C8;</code>&#xFF0C;&#x5C55;&#x5F00;&#x5373;<code>(&#x3C6; -&gt; &#x3C8;) -&gt; &#x3C8;</code>&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x5C55;&#x5F00;&#x5F97;<code>((&#x3C6; -&gt; &#x3C8;) -&gt; &#x3C8;) -&gt; &#x3C8;</code>&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x4E0B;&#x53BB;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x4E0D;&#x80FD;&#x7528;&#x6709;&#x9650;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5199;&#x51FA;&#x6765;&#xFF01;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x4F60;&#x6CE8;&#x610F;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x521A;&#x505A;&#x7684;&#x7684;&#x5FAE;&#x5999;&#x4F46;&#x91CD;&#x8981;&#x7684;&#x8DF3;&#x8DC3;&#x5417;&#xFF1F;</p>
</blockquote>
<h4 id="15232-&#x7A0B;&#x5E8F;&#x7EC8;&#x6B62;">15.2.3.2 &#x7A0B;&#x5E8F;&#x7EC8;&#x6B62;</h4>
<p>&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x8BD5;&#x56FE;&#x76F4;&#x63A5;&#x5730;&#x8BA1;&#x7B97;&#x3A9;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x8BA1;&#x7B97;&#x3B3;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x5BFC;&#x81F4;&#x4E86;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;&#x6B64;&#x7C7B;&#x578B;&#x4E0D;&#x80FD;&#x7528;&#x6709;&#x9650;&#x957F;&#x5EA6;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8868;&#x793A;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x53EA;&#x662F;&#x76F4;&#x89C9;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x975E;&#x8BC1;&#x660E;&#x3002;&#x66F4;&#x5947;&#x602A;&#x7684;&#x4E8B;&#x5B9E;&#x662F;&#xFF1A;&#x5728;&#x6211;&#x4EEC;&#x8FC4;&#x4ECA;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;<strong>&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x7ED9;&#x51FA;&#x3A9;&#x7684;&#x7C7B;&#x578B;</strong>&#xFF01;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5F3A;&#x7684;&#x8868;&#x8FF0;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;&#x51FA;&#x66F4;&#x5F3A;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x7528;&#x7684;<strong>&#x9759;&#x6001;&#x7C7B;&#x578B;</strong>&#x8BED;&#x8A00;&#x6709;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x5F3A;&#x5F52;&#x4E00;&#x5316;</strong>&#xFF08;strong normalization&#xFF09;&#xFF1A;&#x4EFB;&#x4F55;&#x6709;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x4F1A;&#x5728;&#x6709;&#x9650;&#x6B65;&#x9AA4;&#x540E;&#x7EC8;&#x6B62;&#x8BA1;&#x7B97;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#xFF08;&#x5947;&#x7279;&#x7684;&#xFF09;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x4E0D;&#x53EF;&#x83B7;&#x5F97;&#x7C7B;&#x578B;&#x7684;&#x7A0B;&#x5E8F;&#xFF1B;<strong>&#x4EFB;&#x4F55;</strong>&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF08;&#x6216;&#x6F5C;&#x5728;&#x5B58;&#x5728;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF09;&#x7A0B;&#x5E8F;&#x90FD;&#x65E0;&#x6CD5;&#x6C42;&#x5F97;&#x7C7B;&#x578B;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x76F4;&#x89C9;&#x8BF4;&#x660E;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#xFF0C;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x2014;&#x2014;&#x5FC5;&#x987B;&#x80FD;&#x88AB;&#x6709;&#x9650;&#x957F;&#x5EA6;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8868;&#x793A;&#x2014;&#x2014;&#x53EA;&#x80FD;&#x5305;&#x542B;&#x6709;&#x9650;&#x4E2A;<code>-&gt;</code>&#xFF0C;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x4F1A;&#x53BB;&#x9664;&#x4E00;&#x4E2A;<code>-&gt;</code>&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x8FDB;&#x884C;&#x6709;&#x9650;&#x6B21;&#x6570;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x53EA;&#x5141;&#x8BB8;&#x975E;&#x8F6C;&#x79FB;&#x7A0B;&#x5E8F;&#xFF08;<a href="https://en.wikipedia.org/wiki/Straight-line_program" target="_blank">straight-line program</a>&#xFF09;&#xFF0C;&#x8FD9;&#x70B9;&#x4E5F;&#x65E0;&#x8DB3;&#x4E3A;&#x5947;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#xFF0C;&#x8FD8;&#x6709;&#x53EF;&#x4EE5;&#x5F53;&#x505A;&#x503C;&#x4EFB;&#x610F;&#x4F20;&#x9012;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x7801;&#x5F97;&#x5230;&#x4EFB;&#x4F55;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x7136;&#x800C;&#x6211;&#x4EEC;&#x4ECD;&#x80FD;&#x5F97;&#x5230;&#x8FD9;&#x4E2A;&#x4FDD;&#x8BC1;&#xFF01;&#x8FD9;&#x4F7F;&#x5F97;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x4EE4;&#x4EBA;&#x5403;&#x60CA;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x8BD5;&#x7740;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x5206;&#x522B;&#x5728;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x548C;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#x7F16;&#x7801;&#x5B9E;&#x73B0;&#x94FE;&#x8868;&#x3002;&#x4F60;&#x770B;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x8BF4;&#x660E;&#x6B64;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E8E;&#x7F16;&#x7801;&#x4EA7;&#x751F;&#x4E86;&#x4F55;&#x79CD;&#x5F71;&#x54CD;&#xFF1F;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x5C55;&#x793A;&#x4E86;&#x67D0;&#x79CD;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5B83;&#x8868;&#x660E;&#xFF0C;&#x548C;&#x4F60;&#x53EF;&#x80FD;&#x76F8;&#x4FE1;&#x7684;&#x2014;&#x2014;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x53EA;&#x662F;&#x7528;&#x6765;&#x907F;&#x514D;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F; BUG &#x5728;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x88AB;&#x53D1;&#x73B0;&#x2014;&#x2014;&#x76F8;&#x53CD;&#xFF0C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;<strong>&#x6539;&#x53D8;&#x8BED;&#x8A00;&#x7684;&#x8BED;&#x4E49;</strong>&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x4E00;&#x4E24;&#x884C;&#x5C31;&#x80FD;&#x5199;&#x51FA;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x90FD;&#x5199;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x4E5F;&#x8868;&#x660E;&#xFF0C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x5173;&#x4E8E;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#xFF0C;&#x8FD8;&#x80FD;&#x5EFA;&#x7ACB;<strong>&#x5173;&#x4E8E;&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x7684;</strong>&#x4E0D;&#x53D8;&#x91CF;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x975E;&#x5E38;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x67D0;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C06;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x53EA;&#x8981;&#x7528;&#x8BE5;&#x8BED;&#x8A00;&#x6765;&#x5199;&#x7136;&#x540E;&#x4EA4;&#x7531;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x68C0;&#x67E5;&#x901A;&#x8FC7;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x7528;&#x5176;&#x4E66;&#x5199;&#x7684;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x90FD;&#x5C06;&#x7EC8;&#x6B62;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5904;&#xFF1F;&#x5BF9;&#x4E8E;&#x901A;&#x7528;&#x7F16;&#x7A0B;&#x6765;&#x8BF4;&#xFF0C;&#x5F53;&#x7136;&#x6CA1;&#x7528;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5F88;&#x591A;&#x7279;&#x6B8A;&#x9886;&#x57DF;&#xFF0C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x4FDD;&#x8BC1;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF1B;&#x4F60;&#x5E0C;&#x671B;&#x77E5;&#x9053;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x4FDD;&#x8BC1;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x4EE5;&#x4FBF;&#x90A3;&#x4E9B;&#x88AB;&#x8C03;&#x5EA6;&#x7684;&#x4EFB;&#x52A1;&#x88AB;&#x6267;&#x884C;&#x3002;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x8FD9;&#x6837;&#x7684;&#x4FDD;&#x8BC1;&#x4E2D;&#x53D7;&#x76CA;&#xFF1A;&#x8DEF;&#x7531;&#x5668;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5305;&#x8FC7;&#x6EE4;&#x5668;&#xFF1B;&#x5B9E;&#x65F6;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5668;&#xFF1B;&#x8BBE;&#x5907;&#x521D;&#x59CB;&#x5316;&#x7A0B;&#x5E8F;&#xFF1B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF1B;&#x5355;&#x7EBF;&#x7A0B; JavaScript &#x4E2D;&#x7684;&#x56DE;&#x8C03;&#xFF1B;&#x751A;&#x81F3;&#x7F16;&#x8BD1;&#x5668;&#x6216;&#x94FE;&#x63A5;&#x5668;&#x3002;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x6210;&#x6587;&#x7684;&#x671F;&#x671B;&#xFF0C;&#x5373;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x6700;&#x7EC8;&#x4F1A;&#x7EC8;&#x6B62;&#x3002;&#x800C;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#x80FD;&#x4FDD;&#x8BC1;&#x8FD9;&#x70B9;&#x2014;&#x2014;&#x4E14;&#x8FD9;&#x70B9;&#x662F;&#x4E0D;&#x53EF;&#x6D4B;&#x8BD5;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x8FD9;&#x4E0D;&#x662F;&#x5047;&#x60F3;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5728;Standard ML&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x94FE;&#x63A5;&#x6A21;&#x5757;&#x57FA;&#x672C;&#x4E0A;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x6765;&#x7F16;&#x5199;&#x6A21;&#x5757;&#x94FE;&#x63A5;&#x89C4;&#x8303;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#x2014;&#x2014;&#x6BD5;&#x7ADF;&#x53EF;&#x4EE5;&#x5C06;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x503C;&#x4F7F;&#x7528;&#x2014;&#x2014;&#x4E14;&#x540C;&#x65F6;&#x94FE;&#x63A5;&#x8FC7;&#x7A0B;&#x88AB;&#x4FDD;&#x8BC1;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x4EA7;&#x751F;&#x6700;&#x7EC8;&#x7684;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<h4 id="15233-&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x9012;&#x5F52;">15.2.3.3 &#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x9012;&#x5F52;</h4>
<p>&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53EA;&#x901A;&#x8FC7;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x6765;&#x5B9E;&#x73B0;<code>rec</code>&#xFF0C;&#x73B0;&#x5728;&#x5219;&#x5FC5;&#x987B;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#x663E;&#x5F0F;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x4EC5;&#x8003;&#x8651;<code>rec</code>&#x7684;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x5F62;&#x5F0F;&#x2014;&#x2014;&#x5B83;&#x6DB5;&#x76D6;&#x4E86;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#xFF0C;&#x5373;&#x9012;&#x5F52;&#x6807;&#x8BC6;&#x7B26;&#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x51FD;&#x6570;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8868;&#x5C42;&#x8BED;&#x6CD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5199;&#x51FA;&#x5982;&#x4E0B;&#x7684;&#x7D2F;&#x52A0;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(rec (&#x3A3; num (n num)
        (if0 n
             0
             (n + (&#x3A3; (n + -1))))) ;&#x8BD1;&#x6CE8;&#xFF0C;&#x539F;&#x6587;&#x5982;&#x6B64;&#xFF0C;+&#x5E94;&#x524D;&#x7F6E;
  (&#x3A3; 10))
</code></pre>
<p>&#x5176;&#x4E2D;&#xFF0C;<code>&#x3A3;</code>&#x662F;&#x51FD;&#x6570;&#x540D;&#xFF0C;<code>n</code>&#x4E3A;&#x5176;&#x53C2;&#x6570;&#xFF0C;<code>num</code>&#x4E3A;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x4EE5;&#x53CA;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8868;&#x8FBE;&#x5F0F;<code>(&#x3A3; 10)</code>&#x8868;&#x793A;&#x4F7F;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x8BA1;&#x7B97;&#x4ECE; 10 &#x7D2F;&#x52A0;&#x5230; 0 &#x7684;&#x548C;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#xFF1F;&#x663E;&#x7136;&#xFF0C;&#x6C42;&#x7C7B;&#x578B;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;<code>n</code>&#x5728;&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x9700;&#x8981;&#x7ED1;&#x5B9A;&#xFF08;&#x4F46;&#x662F;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5904;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#xFF09;&#xFF1B;&#x8FD9;&#x4E00;&#x70B9;&#x8BA1;&#x7B97;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x77E5;&#x9053;&#x4E86;&#x3002;&#x90A3;&#x4E48;<code>&#x3A3;</code>&#x5462;&#xFF1F;&#x663E;&#x7136;&#xFF0C;&#x5728;&#x68C0;&#x67E5;<code>(&#x3A3; 10)</code>&#x7684;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x5728;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#x4E2D;&#x88AB;&#x7ED1;&#x5B9A;&#xFF0C;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x4E3A;<code>num -&gt; num</code>&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5728;&#x68C0;&#x67E5;&#x51FD;&#x6570;&#x4F53;&#x65F6;&#xFF0C;&#x5B83;<strong>&#x540C;&#x6837;</strong>&#x9700;&#x8981;&#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x6B64;&#x7C7B;&#x578B;&#x3002;&#xFF08;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x51FD;&#x6570;&#x4F53;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x9700;&#x8981;&#x548C;&#x4E8B;&#x5148;&#x58F0;&#x660E;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;&#xFF09;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5982;&#x4F55;&#x6253;&#x7834;&#x7C7B;&#x578B;&#x6709;&#x9650;&#x6027;&#x7684;&#x675F;&#x7F1A;&#x3002;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x7F16;&#x5199;&#x5305;&#x542B;&#x6709;&#x9650;&#x6570;&#x91CF;<code>-&gt;</code>&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x7684;&#x89C4;&#x5219;&#x5728;&#x51FD;&#x6570;&#x4F53;&#x4E2D;&#x5F15;&#x7528;&#x81EA;&#x8EAB;&#x65F6;&#x590D;&#x5236;&#x4E86;<code>-&gt;</code>&#xFF0C;&#x4ECE;&#x800C;&#x4F9B;&#x5E94;&#x4E86;&#x65E0;&#x7A77;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x662F;&#x5305;&#x542B;&#x65E0;&#x7A77;&#x7BAD;&#x77E2;&#x7684;&#x7BAD;&#x7B52;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x89C4;&#x5219;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#x3002;&#x5047;&#x8BBE;<code>f</code>&#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x51FD;&#x6570;&#x7684;&#x540D;&#x5B57;&#xFF0C;<code>aT</code>&#x662F;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#xFF0C;<code>rT</code>&#x4E3A;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#xFF0C;<code>b</code>&#x662F;&#x51FD;&#x6570;&#x4F53;&#xFF0C;<code>u</code>&#x662F;&#x51FD;&#x6570;&#x7684;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;tc-lamC-case&gt; ::=

    [recC (f a aT rT b u)
          (let ([extended-env
                 (extend-ty-env (bind f (funT aT rT)) tenv)])
            (cond
              [(not (equal? rT (tc b
                                   (extend-ty-env
                                    (bind a aT)
                                    extended-env))))
               (error &apos;tc &quot;body return type not correct&quot;)] ;&#x51FD;&#x6570;&#x4F53;&#x7C7B;&#x578B;&#x9519;&#x8BEF;
              [else (tc u extended-env)]))]
</code></pre>
<h3 id="1524-&#x6570;&#x636E;&#x4E2D;&#x7684;&#x9012;&#x5F52;">15.2.4 &#x6570;&#x636E;&#x4E2D;&#x7684;&#x9012;&#x5F52;</h3>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89C1;&#x8BC6;&#x4E86;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x9012;&#x5F52;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD8;&#x4E0D;&#x80FD;&#x4F7F;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x9012;&#x5F52;&#x7684;&#x6570;&#x636E;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x79CD;&#x9012;&#x5F52;&#x6570;&#x636E;&#x2014;&#x2014;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x2014;&#x2014;&#x4F46;&#x662F;&#x8FD9;&#x662F;&#x5185;&#x5EFA;&#x7684;&#x3002;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x770B;&#x5230;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x9012;&#x5F52;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;</p>
<h4 id="15241-&#x9012;&#x5F52;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;">15.2.4.1 &#x9012;&#x5F52;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;</h4>
<p>&#x5F53;&#x6211;&#x4EEC;&#x8BF4;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x521B;&#x5EFA;&#x9012;&#x5F52;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x5728;&#x540C;&#x65F6;&#x8C08;&#x8BBA;&#x4E09;&#x79CD;&#x4E1C;&#x897F;&#xFF1A;</p>
<ul>
<li>&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7C7B;&#x578B;</li>
<li>&#x8BA9;&#x65B0;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;</li>
<li>&#x8BA9;&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x6307;&#x5411;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;</li>
</ul>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5141;&#x8BB8;&#x4E86;&#x7B2C;&#x4E09;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5FC5;&#x987B;&#x518D;&#x5141;&#x8BB8;&#x4E00;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5141;&#x8BB8;&#x8BE5;&#x7C7B;&#x578B;&#x4E2D;&#x975E;&#x9012;&#x5F52;&#x7684;&#x57FA;&#x672C;&#x60C5;&#x51B5;&#x7684;&#x5B58;&#x5728;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x51C6;&#x5219;&#x7684;&#x7EC4;&#x5408;&#x4EA7;&#x751F;&#x4E86;&#x901A;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x4EE3;&#x6570;&#x6570;&#x636E;&#x7C7B;&#x578B;</strong>&#xFF08;algebraic datatype&#xFF09;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x7684;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x4E2D;&#x652F;&#x6301;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x6570;&#x4E8C;&#x53C9;&#x6811;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;&#x3010;&#x6CE8;&#x91CA;&#x3011;</p>
<pre><code class="lang-Racket">(define-type BTnum
  [BTmt]
  [BTnd (n : number) (l : BTnum) (r : BTnum)])
</code></pre>
<blockquote>
<p>&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;&#x3002;</p>
</blockquote>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6CA1;&#x6709;&#x540D;&#x5B57;&#xFF0C;<code>BTnum</code>&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E0D;&#x80FD;&#x5728;<code>BTnd</code>&#x4E2D;&#x5F15;&#x7528;&#x56DE;&#x8BE5;&#x7C7B;&#x578B;&#x3002;&#x540C;&#x6837;&#x5730;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x5141;&#x8BB8;&#x5B9A;&#x4E49;&#x4E00;&#x79CD;<code>BTnum</code>&#x6784;&#x9020;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x65E0;&#x6CD5;&#x5B9A;&#x4E49; <code>BTmt</code>&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x9012;&#x5F52;&#x65E0;&#x6CD5;&#x7EC8;&#x6B62;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#xFF08;&#x5982;<code>BTnd</code>&#x4E2D;&#x7684;&#x4E00;&#x6837;&#xFF09;&#x6765;&#x6784;&#x9020;&#x6709;&#x7528;&#x3001;&#x6709;&#x8DA3;&#x7684;&#x6570;&#x636E;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E09;&#x79CD;&#x673A;&#x5236;&#x88AB;&#x6253;&#x5305;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x624D;&#x6700;&#x6709;&#x7528;&#x3002;&#xFF08;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x786E;&#x5B9E;&#x5141;&#x8BB8;&#x5B9A;&#x4E49;&#x72EC;&#x7ACB;&#x7ED3;&#x6784;&#x4F53;&#x3002;&#x540E;&#x6587;&#x6211;&#x4EEC;&#x5C06;&#x56DE;&#x6765;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x5BF9;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x5F71;&#x54CD;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5173;&#x4E8E;&#x9012;&#x5F52;&#x8868;&#x793A;&#x7684;&#x521D;&#x6B65;&#x8BA8;&#x8BBA;&#x6682;&#x544A;&#x4E00;&#x4E2A;&#x6BB5;&#x843D;&#xFF0C;&#x4F46;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x89E3;&#x91CA;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;<code>BTum</code>&#x7684;&#x6765;&#x6E90;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x5F97;&#x4E0D;&#x5047;&#x88C5;&#x5B83;&#x5DF2;&#x7ECF;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B0;&#x7684;&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x6539;&#x53D8;&#x6211;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x6709;&#x70B9;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x2014;&#x2014;&#x8FD9;&#x5C31;&#x597D;&#x6BD4;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B0;&#x51FA;&#x73B0;&#x7684;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x53BB;&#x4FEE;&#x6539;&#x89E3;&#x91CA;&#x5668;&#xFF01;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x79CD;&#x5B9A;&#x4E49;&#x6210;&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x56FA;&#x6709;&#x80FD;&#x529B;&#x3002;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x56DE;&#x6765;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x7684;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x4E58;&#x79EF;&#x7684;&#x548C;</strong>&#xFF0C;&#x201C;&#x4E58;&#x201D;&#x6307;&#x4EE3;&#x5B57;&#x6BB5;&#x7EC4;&#x5408;&#x6210;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;<code>BTnd</code>&#x7684;&#x5408;&#x6CD5;&#x503C;&#x662F;&#x4F20;&#x9012;&#x7ED9;<code>BTnd</code>&#x6784;&#x9020;&#x5668;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x5408;&#x6CD5;&#x503C;&#x7684;&#x53C9;&#x4E58;&#x3002;&#x201C;&#x548C;&#x201D;&#x662F;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x603B;&#x6570;&#xFF1A;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;<code>BTnum</code>&#x503C;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x3002;&#xFF08;&#x5C06;&#x201C;&#x4E58;&#x201D;&#x60F3;&#x4F5C;&#x201C;&#x4E14;&#x201D;&#xFF0C;&#x201C;&#x52A0;&#x201D;&#x60F3;&#x4F5C;&#x201C;&#x6216;&#x201D;&#x3002;&#xFF09;</p>
<h4 id="15242-&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;">15.2.4.2 &#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;</h4>
<p>&#x60F3;&#x4E00;&#x60F3;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5B9A;&#x4E49;&#x4F1A;&#x4EA7;&#x751F;&#x54EA;&#x4E9B;&#x5F71;&#x54CD;&#xFF1F;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x5F15;&#x5165;&#x4E86;&#x65B0;&#x7684;&#x7C7B;&#x578B;&#xFF1B;&#x5176;&#x6B21;&#x5B83;&#x57FA;&#x4E8E;&#x6B64;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x82E5;&#x5E72;&#x6784;&#x9020;&#x5668;&#x3001;&#x8C13;&#x8BCD;&#x548C;&#x9009;&#x62E9;&#x5668;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x5F15;&#x5165; <code>BTnum</code>&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5B83;&#x521B;&#x5EFA;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-Racket">BTmt : -&gt; BTnum
BTnd : number * BTnum * BTnum -&gt; BTnum
BTmt? : BTnum -&gt; boolean
BTnd? : BTnum -&gt; boolean
BTnd-n : BTnum -&gt; number
BTnd-l : BTnum -&gt; BTnum
BTnd-r : BTnum -&gt; BTnum
</code></pre>
<p>&#x89C2;&#x5BDF;&#x51E0;&#x4E2A;&#x663E;&#x8457;&#x7684;&#x4E8B;&#x5B9E;&#xFF1A;</p>
<ul>
<li>&#x8FD9;&#x91CC;&#x7684;&#x6784;&#x9020;&#x5668;&#x521B;&#x5EFA;<code>BTnum</code>&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x7A0D;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x6289;&#x62E9;&#x3002;</li>
<li>&#x8FD9;&#x91CC;&#x7684;&#x8C13;&#x8BCD;&#x51FD;&#x6570;&#x90FD;&#x63A5;&#x53D7;<code>BTnum</code>&#x7C7B;&#x578B;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x201C;Any&#x201D;&#xFF08;&#x4EFB;&#x610F;&#x503C;&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x67D0;&#x4E2A;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x533A;&#x5206;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x3002;</li>
<li>&#x9009;&#x62E9;&#x5668;&#x53EA;&#x80FD;&#x4F5C;&#x7528;&#x4E8E;&#x7C7B;&#x578B;&#x4E2D;&#x76F8;&#x5173;&#x5F62;&#x5F0F;&#x7684;&#x5B9E;&#x4F8B;&#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;<code>BTnd-n</code>&#x53EA;&#x5BF9;<code>BTnd</code>&#x7684;&#x5B9E;&#x4F8B;&#x6709;&#x6548;&#xFF0C;&#x5BF9;<code>BTmt</code>&#x7684;&#x5B9E;&#x4F8B;&#x5219;&#x4E0D;&#x884C;&#x2014;&#x2014;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x7F3A;&#x4E4F;&#x5408;&#x9002;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x8868;&#x793A;&#x8FD9;&#x70B9;&#x3002;</li>
</ul>
<p>&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x4E2D;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x503C;&#x5F97;&#x8BA8;&#x8BBA;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4E45;&#x5C06;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x3002;</p>
<h4 id="15243-&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x548C;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;">15.2.4.3 &#x6A21;&#x5F0F;&#x5339;&#x914D;&#x548C;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;</h4>
<p>&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7684;&#x8BA8;&#x8BBA;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#xFF0C;&#x5269;&#x4E0B;&#x8981;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x5C31;&#x662F;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p>
<pre><code class="lang-Racket">(type-case BTnum t
    [BTnum () e1]
    [BTnd (nv lt rt) e2])
</code></pre>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x524D;&#x8FF0;&#x7684;&#x51FD;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x7528; let &#x5C31;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x6B64;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x6240;&#x5B9E;&#x73B0;&#x7684;&#x7ED1;&#x5B9A;&#xFF1A;</p>
<pre><code class="lang-Racket">(cond
    [(BTmt? t) e1]
    [(BTnd? t) (let ([nv (BTnd-n t)]
                     [lt (BTnd-l t)]
                     [rt (BTnd-r t)]
                 e2)])
</code></pre>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B8F;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x76F4;&#x63A5;&#x7528;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5373;&#x53EF;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x673A;&#x5236;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E0D;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#x3002;&#x751F;&#x6210;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#x7684;<code>cond</code>&#x8868;&#x8FBE;&#x5F0F;&#x65F6;&#xFF0C;&#x5B8F;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x624B;&#x6BB5;&#x77E5;&#x9053;<code>BTnd</code>&#x7684;&#x4E09;&#x4E2A;&#x4F4D;&#x7F6E;&#x9009;&#x62E9;&#x5668;&#x5206;&#x522B;&#x662F;<code>BTnd-n</code>&#x3001;<code>BTnd-l</code>&#x548C;<code>BTnd-r</code>&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5728;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x65F6;&#x663E;&#x5F0F;&#x7ED9;&#x51FA;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x65F6;&#x662F;&#x9690;&#x542B;&#x7684;&#xFF08;&#x5212;&#x91CD;&#x70B9;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5FC5;&#x987B;&#x8981;&#x4ECE;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x5904;&#x4F20;&#x8FC7;&#x6765;&#x3002;&#x56E0;&#x6B64;&#x5B8F;&#x5C55;&#x5F00;&#x5668;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#x7684;&#x4E1C;&#x897F;&#x5B8C;&#x6210;&#x5176;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4F8B;&#x5982;<code>e1</code>&#x548C;<code>e2</code>&#x8FD9;&#x6837;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x65E0;&#x6CD5;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x2014;&#x2014;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x80FD;&#x88AB;&#x53EF;&#x9760;&#x5730;&#x8BC6;&#x522B;&#x4E3A;&#x8868;&#x8FBE;&#x5F0F;&#x2014;&#x2014;&#x76F4;&#x5230;&#x5B8C;&#x6210;&#x4E86;<code>type-case</code>&#x7684;&#x5B8F;&#x5C55;&#x5F00;&#x4E4B;&#x540E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C55;&#x5F00;&#x4F9D;&#x8D56;&#x4E8E;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#xFF0C;&#x800C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x4F9D;&#x8D56;&#x4E8E;&#x5C55;&#x5F00;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x8FD9;&#x4E24;&#x8005;&#x662F;&#x5171;&#x751F;&#x5173;&#x7CFB;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x540C;&#x6B65;&#x8FD0;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#x8FDB;&#x884C;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x8BED;&#x6CD5;&#x7CD6;&#x9700;&#x8981;&#x5BF9;&#x76F8;&#x5173;&#x7C7B;&#x578B;&#x4F5C;&#x51FA;&#x63A8;&#x6D4B;&#xFF0C;&#x8981;&#x6BD4;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#x66F4;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x3002;</p>
<h3 id="1525-&#x7C7B;&#x578B;&#x3001;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;">15.2.5 &#x7C7B;&#x578B;&#x3001;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;</h3>
<p>&#x660E;&#x663E;&#xFF0C;&#x7C7B;&#x578B;&#x5DF2;&#x7ECF;&#x8D4B;&#x4E88;&#x4E86;&#x7C7B;&#x578B;&#x5B89;&#x5168;&#x8BED;&#x8A00;&#x4E00;&#x4E9B;&#x6027;&#x80FD;&#x4F18;&#x52BF;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x672C;&#x6765;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x65F6;&#x6267;&#x884C;&#x7684;&#x68C0;&#x67E5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x68C0;&#x67E5;&#x52A0;&#x6CD5;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x786E;&#x662F;&#x6570;&#xFF09;&#x73B0;&#x5728;&#x662F;&#x9759;&#x6001;&#x6267;&#x884C;&#x7684;&#x3002;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7C7B;&#x4F3C;<code>:number</code>&#x7684;&#x6CE8;&#x89E3;&#x5DF2;&#x7ECF;&#x56DE;&#x7B54;&#x4E86;&#x5173;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#x662F;&#x5426;&#x662F;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF1B;&#x65E0;&#x9700;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x518D;&#x53BB;&#x68C0;&#x67E5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7C7B;&#x578B;&#x7EA7;&#x522B;&#x7684;&#x8C13;&#x8BCD;&#x4EE5;&#x53CA;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BF9;&#x5B83;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x5C06;&#x4F1A;&#xFF08;&#x5E76;&#x4E14;&#x9700;&#x8981;&#xFF09;&#x5B8C;&#x5168;&#x6D88;&#x5931;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x8FD9;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x4E00;&#x4E9B;&#x4EE3;&#x4EF7;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x8BF4;&#x670D;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4ED6;&#x4EEC;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF1B;&#x7531;&#x4E8E;&#x53EF;&#x5224;&#x5B9A;&#x6027;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6709;&#x4E9B;&#x53EF;&#x4EE5;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x4E5F;&#x53EF;&#x80FD;&#x4E0E;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x51B2;&#x7A81;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E3A;&#x6EE1;&#x8DB3;&#x4E86;&#x5B83;&#x8981;&#x6C42;&#x7684;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x89C2;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x6027;&#x80FD;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x6765;&#x8BA8;&#x8BBA;&#x7A7A;&#x95F4;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x503C;&#x9644;&#x52A0;&#x5B58;&#x50A8;&#x5176;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x5176;&#x5B9E;&#x73B0;&#x7C7B;&#x578B;&#x7EA7;&#x522B;&#x8C13;&#x8BCD;&#x5982; <code>number?</code> &#x7684;&#x57FA;&#x7840;&#xFF0C;&#x8FD9;&#x4E9B;&#x8C13;&#x8BCD;&#x65E2;&#x53EF;&#x88AB;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x4E5F;&#x53EF;&#x88AB;&#x8BED;&#x8A00;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x8C13;&#x8BCD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#x800C;&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;&#x6240;&#x5360;&#x636E;&#x7684;&#x7A7A;&#x95F4;&#x4E5F;&#x5C06;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x3002;&#x56E0;&#x6B64;&#xFF08;&#x9759;&#x6001;&#x8BED;&#x8A00;&#xFF09;&#x4E0D;&#x9700;&#x8981;&#x7C7B;&#x578B;&#x6807;&#x7B7E;&#x3002;</p>
<blockquote>
<p>&#x7136;&#x800C;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x5176;&#x4ED6;&#x8868;&#x793A;&#x6CD5;&#xFF08;&#x5982;BIBOP(&#x8BD1;&#x6CE8;BIg Bag Of Pages)&#xFF09;&#x80FD;&#x6781;&#x5927;&#x51CF;&#x5C11;&#x5B83;&#x4EEC;&#x5BF9;&#x7A7A;&#x95F4;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
</blockquote>
<p>&#x7C7B;&#x578B;&#x53D8;&#x4F53;&#x76F8;&#x5173;&#x7684;&#x8C13;&#x8BCD;&#x4ECD;&#x8981;&#x4FDD;&#x7559;&#xFF1A;&#x5982;&#x4E0A;&#x9762;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;<code>BTmt?</code>&#x548C;<code>BTnd?</code>&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x8C03;&#x7528;&#x9700;&#x8981;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x6C42;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x9009;&#x62E9;&#x5668;<code>BTnd-n</code>&#x5C31;&#x9700;&#x8981;&#x6267;&#x884C;&#x8FD9;&#x79CD;&#x68C0;&#x67E5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x4F18;&#x5316;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x8003;&#x8651;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x540E;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#xFF1A;&#x5176;&#x4E2D;&#x7684;&#x4E09;&#x4E2A;&#x9009;&#x62E9;&#x5668;&#x5C31;&#x65E0;&#x9700;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x68C0;&#x67E5;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;<code>BTnd?</code>&#x8FD4;&#x56DE;&#x771F;&#x503C;&#x65F6;&#x624D;&#x4F1A;&#x6267;&#x884C;&#x5BF9;&#x5E94;&#x4EE3;&#x7801;&#x7247;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x7ED9;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5C42;&#x9762;&#x63D0;&#x4F9B;&#x7279;&#x6B8A;&#x7684;<strong>&#x4E0D;&#x5B89;&#x5168;</strong>&#xFF08;unsafe&#xFF09;&#x6307;&#x4EE4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0D;&#x6267;&#x884C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4ECE;&#x800C;&#x751F;&#x6210;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-Racket">(cond
  [(BTmt? t) e1]
  [(BTnd? t) (let ([nv (BTnd-n/no-check t)]
                   [lt (BTnd-l/no-check t)]
                   [rt (BTnd-r/no-check t)])
               e2)])
</code></pre>
<p>&#x4F46;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x51C6;&#x786E;&#x56DE;&#x7B54;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x76F8;&#x6BD4;&#x4E8E;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8DB3;&#x591F;&#x7684;&#x4F4D;&#x6765;&#x533A;&#x5206;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x53CA;&#x7C7B;&#x578B;&#x53D8;&#x4F53;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x7531;&#x4E8E;&#x7C7B;&#x578B;&#x88AB;&#x9759;&#x6001;&#x5730;&#x9694;&#x79BB;&#x4E86;&#xFF0C;&#x5BF9;&#x4E8E;&#x6CA1;&#x6709;&#x53D8;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#xFF0C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x4EFB;&#x4F55;&#x53D8;&#x4F53;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF1B;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x53EF;&#x7528;&#x4F4D;&#x6765;&#x5B58;&#x50A8;&#x5B9E;&#x9645;&#x7684;&#x52A8;&#x6001;&#x503C;&#x3002;</p>
<p>&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x578B;&#x5B58;&#x5728;&#x53D8;&#x4F53;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x727A;&#x7272;&#x4E00;&#x4E9B;&#x7A7A;&#x95F4;&#x7528;&#x4E8E;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x53D8;&#x4F53;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x4E2D;&#x53D8;&#x4F53;&#x7684;&#x6570;&#x91CF;&#x663E;&#x7136;&#x6BD4;<strong>&#x6240;&#x6709;&#x7C7B;&#x578B;</strong>&#x548C;&#x5176;&#x53D8;&#x4F53;&#x7684;&#x6570;&#x91CF;&#x8981;&#x5C0F;&#x5F97;&#x591A;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<code>BTnum</code>&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x53D8;&#x4F53;&#xFF0C;&#x56E0;&#x6B64;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x6765;&#x8BB0;&#x5F55;&#x67D0;&#x4E2A;&#x503C;&#x662F;<code>BTnum</code>&#x7684;&#x54EA;&#x4E2A;&#x53D8;&#x4F53;&#x3002;</p>
<p>&#x7279;&#x522B;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x7C7B;&#x578B;&#x4F53;&#x7CFB;&#x7684;&#x9694;&#x79BB;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x6DF7;&#x6DC6;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x6BCF;&#x79CD;&#x90FD;&#x6709;&#x4E24;&#x79CD;&#x53D8;&#x4F53;&#xFF0C;&#x5728;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x56DB;&#x79CD;&#x53D8;&#x4F53;&#x90FD;&#x9700;&#x8981;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x793A;&#x6CD5;&#xFF1B;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#xFF0C;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x8868;&#x793A;&#x6CD5;&#x53EF;&#x4EE5;&#x8DE8;&#x7C7B;&#x578B;&#x91CD;&#x53E0;&#xFF0C;&#x56E0;&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4F1A;&#x4FDD;&#x8BC1;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x53D8;&#x4F53;&#x548C;&#x53E6;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x4E0D;&#x88AB;&#x6DF7;&#x6DC6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x7684;&#x7A7A;&#x95F4;&#xFF08;&#x8282;&#x7EA6;&#x8868;&#x793A;&#x6240;&#x9700;&#x7A7A;&#x95F4;&#xFF09;&#x548C;&#x65F6;&#x95F4;&#xFF08;&#x6D88;&#x9664;&#x8FD0;&#x884C;&#x65F6;&#x68C0;&#x67E5;&#xFF09;&#x4E0A;&#x90FD;&#x6709;&#x5B9E;&#x6253;&#x5B9E;&#x7684;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x3002;</p>
<h3 id="1526-&#x7C7B;&#x578B;&#x548C;&#x8D4B;&#x503C;">15.2.6 &#x7C7B;&#x578B;&#x548C;&#x8D4B;&#x503C;</h3>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8986;&#x76D6;&#x4E86;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4E2D;&#x9664;&#x8D4B;&#x503C;&#x4E4B;&#x5916;&#x7684;&#x5927;&#x90E8;&#x5206;&#x57FA;&#x672C;&#x7279;&#x6027;&#x3002;&#x4ECE;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x770B;&#xFF0C;&#x7C7B;&#x578B;&#x548C;&#x8D4B;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x7ECF;&#x5178;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x6839;&#x672C;&#x4E0D;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([x 10])
  (begin
    (set! x 5)
    (set! x &quot;&#x67D0;&#x7269;&quot;)))
</code></pre>
<p><code>x</code>&#x7684;&#x201C;&#x7C7B;&#x578B;&#x201D;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x5E76;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x662F;&#x6570;&#xFF0C;<strong>&#x540E;&#x6765;</strong>&#xFF08;&#x6CE8;&#x610F;&#x91CC;&#x9762;&#x8574;&#x542B;&#x65F6;&#x95F4;&#x610F;&#x5473;&#xFF09;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x6211;&#x4EEC;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x7ED9;&#x5B83;&#x5B9A;&#x7C7B;&#x578B;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x662F;&#x79CD;<strong>&#x975E;&#x65F6;&#x95F4;&#x6027;&#x7684;</strong>&#x6D3B;&#x52A8;&#xFF1A;&#x5B83;&#x53EA;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x72EC;&#x7ACB;&#x4E8E;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x7279;&#x5B9A;&#x987A;&#x5E8F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8DDF;&#x8E2A;&#x8D2E;&#x5B58;&#x4E2D;&#x7684;&#x7CBE;&#x786E;&#x503C;&#x8D85;&#x51FA;&#x4E86;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#x7684;&#x80FD;&#x529B;&#x8303;&#x56F4;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x9759;&#x6001;&#x7684;&#x88AB;&#x7406;&#x89E3;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x88AB;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x8BEF;&#x5BFC;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([x 10])
  (if (even? (read-number &quot;&#x8F93;&#x5165;&#x6570;&#x5B57;&quot;))
      (set! x 5)
      (set! x &quot;&#x67D0;&#x7269;&quot;)))
</code></pre>
<p>&#x73B0;&#x5728;&#xFF0C;&#x9759;&#x6001;&#x68C0;&#x67E5;&#x4E0D;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x5173;&#x4E8E;<code>x</code>&#x7684;&#x7C7B;&#x578B;&#x7684;&#x7ED3;&#x8BBA;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x503C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x91C7;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7B56;&#x7565;&#xFF1A;&#x8D4B;&#x503C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7C7B;&#x578B;&#x5FC5;&#x987B;<strong>&#x4FDD;&#x6301;&#x4E0D;&#x53D8;</strong>&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x53D8;&#x91CF;&#x8D4B;&#x503C;&#x8FD8;&#x662F;&#x7ED3;&#x6784;&#x4F53;&#x8D4B;&#x503C;&#xFF0C;&#x90FD;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x88AB;&#x8D4B;&#x503C;&#x7684;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x6211;&#x4EEC;&#x5F53;&#x524D;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x5C06;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x63D0;&#x4F9B;&#x591A;&#x5C11;&#x7075;&#x6D3B;&#x6027;&#x5C31;&#x53D6;&#x51B3;&#x4E0E;&#x8BED;&#x8A00;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x7684;&#x7C7B;&#x578B;&#x8868;&#x793A;&#x201C;&#x6570;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x201D;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x5C06;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x4F46;&#x662F;<code>x</code>&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x90A3;&#x4E48;&#x7CBE;&#x786E;&#xFF0C;&#x6240;&#x6709;&#x4F7F;&#x7528;<code>x</code>&#x7684;&#x5730;&#x65B9;&#x90FD;&#x9700;&#x8981;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x964D;&#x4F4E;&#x4E86;&#x7684;&#x7CBE;&#x5EA6;&#xFF0C;&#x540E;&#x9762;&#x6211;&#x4EEC;&#x4F1A;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x8D4B;&#x503C;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x91C7;&#x7528;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x503C;&#x53EF;&#x4EE5;&#x5728;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x6307;&#x5B9A;&#x7684;&#x9650;&#x5EA6;&#x4E0B;&#x8FDB;&#x884C;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x7C7B;&#x578B;&#x4E0D;&#x80FD;&#x88AB;&#x6539;&#x53D8;&#x3002;&#x5728;&#x50CF;<code>set!</code>&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x7684;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4E2D;&#x7684;<code>setC</code>&#xFF09;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8D4B;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x548C;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x5339;&#x914D;&#x3002;&#x5728;&#x7ED3;&#x6784;&#x4F53;&#x8D4B;&#x503C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;<code>box</code>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8D4B;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x548C;<code>box</code>&#x5BB9;&#x5668;&#x5185;&#x5BB9;&#x7684;&#x7C7B;&#x578B;&#x5339;&#x914D;&#x3002;</p>
<h3 id="1527-&#x4E2D;&#x5FC3;&#x5B9A;&#x7406;&#xFF1A;&#x7C7B;&#x578B;&#x7684;&#x53EF;&#x9760;&#x6027;">15.2.7 &#x4E2D;&#x5FC3;&#x5B9A;&#x7406;&#xFF1A;&#x7C7B;&#x578B;&#x7684;&#x53EF;&#x9760;&#x6027;</h3>
<p>&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#xFF0C;&#x4E00;&#x4E9B;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x4E3A;&#x5176;&#x4E66;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x6240;&#x80FD;&#x8FBE;&#x6210;&#x67D0;&#x4E9B;&#x7279;&#x6027;&#x4F5C;&#x51FA;&#x5F88;&#x575A;&#x5B9E;&#x7684;&#x8BC1;&#x660E;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x8BE5;&#x8BED;&#x8A00;&#x4E66;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x80AF;&#x5B9A;&#x4F1A;&#x7EC8;&#x6B62;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x83B7;&#x5F97;&#x8FD9;&#x6837;&#x7684;&#x4FDD;&#x8BC1;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6B63;&#x662F;&#x4E3A;&#x4E86;&#x80FD;&#x5199;&#x51FA;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x6211;&#x4EEC;&#x624D;&#x6DFB;&#x52A0;&#x7684;&#x901A;&#x7528;&#x9012;&#x5F52;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x2014;&#x2014;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4EFB;&#x4F55;&#x503C;&#x5F97;<strong>&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;</strong>&#x8FD9;&#x4E00;&#x9AD8;&#x8D35;&#x5934;&#x8854;&#x7684;&#x4E1C;&#x897F;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x2014;&#x2014;&#x5E94;&#x8BE5;&#x4E3A;&#x6240;&#x6709;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x67D0;&#x79CD;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4FDD;&#x8BC1;&#x3002;&#x8FD9;&#x662F;&#x7ED9;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x56DE;&#x62A5;&#xFF1A;&#x901A;&#x8FC7;&#x7ED9;&#x7A0B;&#x5E8F;&#x52A0;&#x4E0A;&#x7C7B;&#x578B;&#xFF0C;&#x5979;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x67D0;&#x4E9B;&#x4E0D;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x627E;&#x5230;bug&#xFF1B;&#x8FD9;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x8DB3;&#x4EE5;&#x63D0;&#x4F9B;&#x6784;&#x5EFA;&#x9AD8;&#x7EA7;&#x522B;&#x5DE5;&#x5177;&#xFF08;&#x4F8B;&#x5982;&#x8981;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x6027;&#x3001;&#x9690;&#x79C1;&#x6027;&#x6216;&#x5065;&#x58EE;&#x6027;&#xFF09;&#x7684;&#x5FC5;&#x8981;&#x57FA;&#x7840;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x4E00;&#x518D;&#x4F7F;&#x7528;&#x201C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x201D;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x3002;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x662F;&#x4E09;&#x4E2A;&#x7EC4;&#x4EF6;&#x7684;&#x7EC4;&#x5408;&#xFF1A;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x3001;&#x7C7B;&#x578B;&#x89C4;&#x5219;&#xFF0C;&#x4EE5;&#x53CA;&#x5C06;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x5E94;&#x7528;&#x4E8E;&#x7A0B;&#x5E8F;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x8BA8;&#x8BBA;&#x4E2D;&#x5C06;&#x7C7B;&#x578B;&#x89C4;&#x5219;&#x653E;&#x5165;&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x6A21;&#x7CCA;&#x4E86;&#x7B2C;&#x4E8C;&#x8005;&#x548C;&#x7B2C;&#x4E09;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5728;&#x903B;&#x8F91;&#x4E0A;&#x52A0;&#x4EE5;&#x533A;&#x5206;&#x3002;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4FDD;&#x8BC1;&#x5462;&#xFF1F;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x524D;&#x9759;&#x6001;&#x5730;&#x5BF9;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5BF9;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#x7684;<strong>&#x9884;&#x6D4B;</strong>&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x5B83;&#x6307;&#x51FA;&#x67D0;&#x4E2A;&#x590D;&#x6742;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x4E3A;<code>num</code>&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x662F;&#x5728;&#x9884;&#x6D4B;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x5C06;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x9884;&#x6D4B;&#x662F;&#x6B63;&#x786E;&#x7684;&#x5462;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x68C0;&#x67E5;&#x5668;&#x4ECE;&#x4E0D;&#x6492;&#x8C0E;&#xFF1F;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x90FD;&#x5E94;&#x8BE5;&#x9644;&#x5E26;&#x4E00;&#x4E2A;&#x8BC1;&#x660E;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x5B9A;&#x7406;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x5B58;&#x7591;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x4E0D;&#x662F;&#x6000;&#x7591;&#x4E3B;&#x4E49;&#x7684;&#x90A3;&#x79CD;&#x3002;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x548C;&#x7A0B;&#x5E8F;&#x6C42;&#x503C;&#x5668;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#xFF1A;</p>
<ul>
<li>&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x80FD;&#x89C1;&#x5230;&#x7684;&#x53EA;&#x6709;&#x7A0B;&#x5E8F;&#x6587;&#x672C;&#xFF0C;&#x6C42;&#x503C;&#x5668;&#x8FD0;&#x884C;&#x5728;&#x771F;&#x5B9E;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E0A;&#x3002;</li>
<li>&#x7C7B;&#x578B;&#x73AF;&#x5883;&#x5C06;&#x6807;&#x8BC6;&#x7B26;&#x7ED1;&#x5B9A;&#x5230;&#x7C7B;&#x578B;&#xFF0C;&#x6C42;&#x503C;&#x5668;&#x7684;&#x73AF;&#x5883;&#x5219;&#x7ED1;&#x5B9A;&#x6807;&#x8BC6;&#x7B26;&#x5230;&#x503C;&#x6216;&#x8005;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x3002;</li>
<li>&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x5C06;&#x503C;&#x7684;&#x96C6;&#x5408;&#xFF08;&#x751A;&#x81F3;&#x662F;&#x65E0;&#x9650;&#x96C6;&#x5408;&#xFF09;&#x538B;&#x7F29;&#x6210;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x6C42;&#x503C;&#x5668;&#x5904;&#x7406;&#x7684;&#x662F;&#x503C;&#x672C;&#x8EAB;&#x3002;</li>
<li>&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4E00;&#x5B9A;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x6C42;&#x503C;&#x5668;&#x4E0D;&#x4E00;&#x5B9A;&#x4F1A;&#x3002;</li>
<li>&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4EC5;&#x9700;&#x68C0;&#x67E5;&#x8868;&#x8FBE;&#x5F0F;&#x4E00;&#x904D;&#xFF0C;&#x6C42;&#x503C;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#x67D0;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8FD0;&#x884C;&#x6B21;&#x6570;&#x53EF;&#x80FD;&#x4ECE;&#x96F6;&#x6B21;&#x5230;&#x65E0;&#x7A77;&#x6B21;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5E94;&#x5047;&#x8BBE;&#x8FD9;&#x4E24;&#x8005;&#x5C06;&#x59CB;&#x7EC8;&#x5BF9;&#x5E94;&#xFF01;</p>
<p>&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8FBE;&#x5230;&#x7684;&#x6838;&#x5FC3;&#x76EE;&#x6807;&#x662F;&#x2014;&#x2014;&#x8BE5;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x662F;<strong>&#x53EF;&#x9760;&#x7684;</strong>&#xFF08;sound&#xFF09;&#x3002;&#x5B83;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF1A;&#x7ED9;&#x5B9A;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x6216;&#x8005;&#x7A0B;&#x5E8F;&#xFF09;<code>e</code>&#xFF0C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5F97;&#x51FA;&#x5176;&#x7C7B;&#x578B;&#x4E3A;<code>t</code>&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8FD0;&#x884C;<code>e</code>&#x65F6;&#xFF0C;&#x5047;&#x8BBE;&#x5F97;&#x5230;&#x4E86;&#x503C;<code>v</code>&#xFF0C;&#x90A3;&#x4E48;<code>v</code>&#x7684;&#x7C7B;&#x578B;&#x662F;<code>t</code>&#x3002;</p>
<p>&#x8BC1;&#x660E;&#x8FD9;&#x4E2A;&#x5B9A;&#x7406;&#x7684;&#x6807;&#x51C6;&#x65B9;&#x6CD5;&#x662F;&#x5206;&#x4E24;&#x6B65;&#x8FDB;&#x884C;&#xFF0C;<strong>&#x8FDB;&#x5C55;</strong>&#xFF08;progress&#xFF09;&#x548C;<strong>&#x4FDD;&#x6301;</strong>&#xFF08;preservation&#xFF09;&#x3002;&#x8FDB;&#x5C55;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5E94;&#x8BE5;&#x80FD;&#x8FDB;&#x884C;&#x8FDB;&#x4E00;&#x6B65;&#x6C42;&#x503C;&#x5F97;&#x5230;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF08;&#x9664;&#x975E;&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x503C;&#xFF09;&#xFF1B;&#x4FDD;&#x6301;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6C42;&#x503C;&#x6B65;&#x9AA4;&#x524D;&#x540E;&#x7C7B;&#x578B;&#x4E0D;&#x53D8;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4EA4;&#x9519;&#x8FDB;&#x884C;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#xFF08;&#x5148;&#x8FDB;&#x5C55;&#x518D;&#x4FDD;&#x6301;&#xFF0C;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x548C;&#x6700;&#x521D;&#x88AB;&#x6C42;&#x503C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x786E;&#x5B9E;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x8868;&#x8FBE;&#x5F0F;&#xFF1A;<code>(+ 5 (* 2 3))</code>&#x3002;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x4E3A;<code>num</code>&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FDB;&#x5C55;&#x8BC1;&#x660E;&#xFF0C;&#x7531;&#x4E8E;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x4E14;&#x5176;&#x5F53;&#x524D;&#x4E0D;&#x662F;&#x503C;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4E00;&#x6B65;&#x6C42;&#x503C;&#x2014;&#x2014;&#x8FD9;&#x91CC;&#x5B83;&#x663E;&#x7136;&#x53EF;&#x4EE5;&#x3002;&#x8FDB;&#x884C;&#x4E00;&#x6B65;&#x6C42;&#x503C;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x88AB;&#x89C4;&#x7EA6;&#x6210;&#x4E86;<code>(+ 5 6)</code>&#x3002;&#x4E0D;&#x51FA;&#x6240;&#x6599;&#xFF0C;&#x6B63;&#x5982;&#x4FDD;&#x6301;&#x7ED9;&#x51FA;&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x4E3A;<code>num</code>&#x3002;&#x8FDB;&#x5C55;&#x8868;&#x660E;&#x5B83;&#x8FD8;&#x80FD;&#x8FDB;&#x884C;&#x4E00;&#x6B65;&#x6C42;&#x503C;&#xFF0C;&#x5F97;&#x5230;<code>11</code>&#x3002;&#x4FDD;&#x6301;&#x518D;&#x6B21;&#x8868;&#x660E;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x4E0A;&#x4E00;&#x6B65;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#xFF0C;&#x90FD;&#x4E3A;<code>num</code>&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8FDB;&#x5C55;&#x53D1;&#x73B0;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#xFF0C;&#x65E0;&#x540E;&#x7EED;&#x8981;&#x8FDB;&#x884C;&#x7684;&#x6C42;&#x503C;&#x6B65;&#x9AA4;&#xFF0C;&#x8BE5;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x6700;&#x521D;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x4E0D;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x6709;&#x4E24;&#x70B9;&#x9700;&#x8981;&#x8BF4;&#x660E;&#xFF1A;</p>
<ol>
<li>&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x5F97;&#x51FA;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x5FAA;&#x73AF;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BE5;&#x5B9A;&#x7406;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4ECD;&#x80FD;&#x770B;&#x5230;&#xFF0C;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x4E2D;&#x95F4;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x5C06;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x56E0;&#x6B64;&#x5373;&#x4F7F;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x6700;&#x7EC8;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5B83;&#x4ECD;&#x5728;&#x8FDB;&#x884C;&#x7740;&#x6709;&#x610F;&#x4E49;&#x7684;&#x8BA1;&#x7B97;&#x3002;</li>
<li>&#x4EFB;&#x4F55;&#x7279;&#x6027;&#x8DB3;&#x591F;&#x4E30;&#x5BCC;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x90FD;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x4E0D;&#x80FD;&#x9759;&#x6001;&#x51B3;&#x5B9A;&#x7684;&#x5C5E;&#x6027;&#xFF08;&#x6709;&#x4E9B;&#x5C5E;&#x6027;&#x4E5F;&#x8BB8;&#x672C;&#x6765;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x662F;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x51B3;&#x5B9A;&#x5C06;&#x5176;&#x63A8;&#x8FDF;&#x5230;&#x8FD0;&#x884C;&#x65F6;&#x51B3;&#x5B9A;&#xFF09;&#x3002;&#x5F53;&#x8FD9;&#x7C7B;&#x5C5E;&#x6027;&#x51FA;&#x9519;&#x65F6;&#x2014;&#x2014;&#x6BD4;&#x5982;&#xFF0C;&#x6570;&#x7EC4;&#x7684;&#x7D22;&#x5F15;&#x8D8A;&#x754C;&#x2014;&#x2014;&#x5173;&#x4E8E;&#x8FD9;&#x79CD;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x7EA6;&#x675F;&#x5B83;&#x4EEC;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x578B;&#x5B8C;&#x5907;&#x6027;&#x5B9A;&#x7406;&#x4E2D;&#x90FD;&#x9690;&#x542B;&#x4E86;&#x4E00;&#x7EC4;&#x5DF2;&#x53D1;&#x5E03;&#x7684;&#x3001;&#x5141;&#x8BB8;&#x7684;&#x5F02;&#x5E38;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x6761;&#x4EF6;&#x3002;&#x4F7F;&#x7528;&#x8BE5;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x9690;&#x5F0F;&#x7684;&#x63A5;&#x53D7;&#x4E86;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#x3002;</li>
</ol>
<p>&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x70B9;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5178;&#x578B;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x90FD;&#x4F1A;&#x6307;&#x660E;&#x5BF9;&#x4E8E;&#x5411;&#x91CF;&#x7684;&#x5BFB;&#x5740;&#x3001;&#x94FE;&#x8868;&#x7684;&#x7D22;&#x5F15;&#x7B49;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x540E;&#x9762;&#x8FD9;&#x4E2A;&#x8BF4;&#x660E;&#x597D;&#x50CF;&#x7AD9;&#x4E0D;&#x4F4F;&#x811A;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x8BB0;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x6761;&#x5173;&#x4E8E;&#x8FD0;&#x884C;&#x65F6;<strong>&#x4E0D;&#x80FD;</strong>&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x9648;&#x8FF0;&#xFF1A;&#x8FD9;&#x4E00;&#x7EC4;&#x5F02;&#x5E38;&#x4E4B;&#x5916;&#x7684;&#x5F02;&#x5E38;&#x5C06;&#x80FD;&#x88AB;&#x8BC1;&#x660E;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x6700;&#x5F00;&#x59CB;&#x5C31;&#x8BBE;&#x8BA1;&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x9664;&#x4E86;&#x4E0D;&#x90A3;&#x4E48;&#x4E25;&#x683C;&#x7684;&#x7C7B;&#x6BD4;&#x5916;&#xFF0C;&#x53EF;&#x80FD;&#x641E;&#x4E0D;&#x6E05;&#x8FD9;&#x7EC4;&#x5F02;&#x5E38;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x5F00;&#x59CB;&#x672C;&#x5C31;&#x65E0;&#x987B;&#x5B9A;&#x4E49;&#x5B83;&#x4EEC;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x5C06;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x6DFB;&#x52A0;&#x5230;&#x5DF2;&#x6709;&#x7684;&#x8BED;&#x8A00;&#x65F6;&#x2014;&#x2014;&#x7279;&#x522B;&#x662F;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x5982;Racket&#x6216;Python&#x2014;&#x2014;&#x90A3;&#x4E48;&#x8FD9;&#x91CC;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x7EC4;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x5C06;&#x4F1A;&#x6307;&#x660E;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x5F02;&#x5E38;&#xFF08;&#x50CF;&#x201C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4F4D;&#x7F6E;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#x201D;&#x6216;&#x8005;&#x201C;&#x672A;&#x627E;&#x5230;&#x65B9;&#x6CD5;&#x201D;&#xFF09;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x63A5;&#x7EB3;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x8BED;&#x6CD5;&#x4E0A;&#x9650;&#x5236;&#x6240;&#x5F97;&#x5230;&#x7684;&#x56DE;&#x62A5;&#x3002;</p>
<h2 id="153-&#x5BF9;&#x6838;&#x5FC3;&#x7684;&#x6269;&#x5C55;">15.3 &#x5BF9;&#x6838;&#x5FC3;&#x7684;&#x6269;&#x5C55;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x57FA;&#x7840;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x4E0B;&#x9762;&#x63A2;&#x7D22;&#x4E00;&#x4E0B;&#x5982;&#x4F55;&#x5C06;&#x5176;&#x6269;&#x5C55;&#x6210;&#x4E3A;&#x66F4;&#x6709;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;</p>
<h3 id="1531-&#x663E;&#x5F0F;&#x7684;&#x53C2;&#x6570;&#x591A;&#x6001;">15.3.1 &#x663E;&#x5F0F;&#x7684;&#x53C2;&#x6570;&#x591A;&#x6001;</h3>
<p><strong>&#x4E0B;&#x9762;&#x54EA;&#x4E9B;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF1F;</strong></p>
<ul>
<li><code>List&lt;String&gt;</code></li>
<li><code>List&lt;String&gt;</code></li>
<li><code>(listof string)</code></li>
</ul>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4E0A;&#x9762;&#x4EFB;&#x4F55;&#x4E24;&#x4E2A;&#x90FD;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#x3002;&#x4F46;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x548C;&#x7B2C;&#x4E09;&#x4E2A;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x56E0;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;Java&#x4EE3;&#x7801;&#x800C;&#x7B2C;&#x4E09;&#x4E2A;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#xFF0C;&#x662F;C++&#x4EE3;&#x7801;&#xFF0C;&#x548C;&#x5176;&#x5B83;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x3002;&#x6E05;&#x695A;&#x4E86;&#x5417;&#xFF1F;&#x4E0D;&#x6E05;&#x695A;&#xFF1F;&#x5F88;&#x597D;&#xFF0C;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x8BFB;&#xFF01;</p>
<h4 id="15311-&#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;">15.3.1.1 &#x53C2;&#x6570;&#x5316;&#x7C7B;&#x578B;</h4>
<p>&#x6211;&#x4EEC;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5DF2;&#x7ECF;&#x5C55;&#x793A;&#x4E86;&#x53C2;&#x6570;&#x591A;&#x6001;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;<code>map</code>&#x51FD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7ED9;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-Racket">((&apos;a -&gt; &apos;b) (listof &apos;a) -&gt; (listof &apos;b))
</code></pre>
<p>&#x610F;&#x601D;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EFB;&#x610F;&#x7C7B;&#x578B;<code>&apos;a</code>&#x548C;<code>&apos;b</code>&#xFF0C;<code>map</code>&#x8BFB;&#x5165;&#x4E00;&#x4E2A;&#x4ECE;<code>&apos;a</code>&#x5230;<code>&apos;b</code>&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;<code>&apos;a</code>&#x7684;&#x94FE;&#x8868;&#xFF0C;&#x751F;&#x6210;&#x5BF9;&#x5E94;&#x7684;<code>&apos;b</code>&#x7684;&#x94FE;&#x8868;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;<code>&apos;a</code>&#x548C;<code>&apos;b</code>&#x4E0D;&#x662F;&#x5177;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#xFF1B;&#x5B83;&#x4EEC;&#x662F;<strong>&#x7C7B;&#x578B;&#x53D8;&#x91CF;</strong>&#xFF08;&#x6211;&#x4EEC;&#x7684;&#x672F;&#x8BED;&#x4E2D;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x7C7B;&#x578B;&#x6807;&#x8BC6;&#x7B26;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5728;&#x5B9E;&#x4F8B;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x4F1A;&#x53D8;&#x5316;&#xFF1B;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x4F7F;&#x7528;&#x4F20;&#x7EDF;&#x672F;&#x8BED;&#xFF09;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x6362;&#x79CD;&#x65B9;&#x5F0F;&#x7406;&#x89E3;&#x5B83;&#xFF1A;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x4E00;&#x65CF;&#x65E0;&#x7A77;&#x591A;&#x7684;&#x8FD9;&#x6837;&#x7684;<code>map</code>&#x51FD;&#x6570;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;<code>map</code>&#x7684;&#x7C7B;&#x578B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<pre><code class="lang-Racket">((number -&gt; string) (listof number) -&gt; (listof string))
</code></pre>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF08;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x8BF4;&#x5176;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">((number -&gt; (number -&gt; number)) (listof number) -&gt; (listof (number -&gt; number)))
</code></pre>
<p>&#x8FD8;&#x6709;&#x8FD9;&#x6837;&#x7684;&#xFF08;&#x4E5F;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x8BF4;<code>&apos;a</code>&#x548C;<code>&apos;b</code>&#x5FC5;&#x987B;&#x4E0D;&#x540C;&#xFF09;&#xFF1A;</p>
<pre><code class="lang-Racket">((string -&gt; string) (listof string) -&gt; (listof string))
</code></pre>
<p>&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x540D;&#x5B57;&#x4E5F;&#x9700;&#x8981;&#x4E0D;&#x540C;&#xFF1A;<code>map_num_str</code>&#x3001;<code>map_num_num-&gt;num</code>&#x3001;<code>map_str_str</code>&#x7B49;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4F1A;&#x8BA9;&#x5B83;&#x4EEC;&#x53D8;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x603B;&#x5F97;&#x4F7F;&#x7528;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;<code>map</code>&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x6BD4;&#x8F83;&#x4E00;&#x822C;&#x7684;&#x90A3;&#x4E2A;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x5C06;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x653E;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#xFF1A;&#x6BD5;&#x7ADF;&#x5B83;&#x4EEC;&#x6709;&#x65E0;&#x7A77;&#x591A;&#x4E2A;&#xFF01;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x80FD;&#x6309;&#x9700;&#x83B7;&#x53D6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x51FD;&#x6570;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x70B9;&#x63D0;&#x793A;&#xFF1A;<code>map</code>&#x63A5;&#x53D7;&#x4E24;&#x4E2A;<strong>&#x53C2;&#x6570;</strong>&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;<strong>&#x7C7B;&#x578B;</strong>&#x3002;&#x7ED9;&#x5B9A;&#x4E86;&#x4E24;&#x4E2A;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;<code>map</code>&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x79CD;<strong>&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x5316;</strong>&#x88AB;&#x79F0;&#x4E3A;<strong>&#x53C2;&#x6570;&#x591A;&#x6001;</strong>&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x548C;&#x5BF9;&#x8C61;&#x201C;&#x591A;&#x6001;&#x201D;&#x641E;&#x6DF7;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x8BA8;&#x8BBA;&#x5B83;&#x3002;</p>
</blockquote>
<h4 id="15312-&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x53C2;&#x6570;">15.3.1.2 &#x663E;&#x5F0F;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x53C2;&#x6570;</h4>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x76F8;&#x5F53;&#x4E8E;&#x8BF4;<code>map</code>&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6709;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x662F;&#x7C7B;&#x578B;&#xFF0C;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x662F;&#x5B9E;&#x9645;&#x7684;&#x503C;&#xFF08;&#x51FD;&#x6570;&#x548C;&#x94FE;&#x8868;&#xFF09;&#x3002;&#x5728;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5199;&#x6210;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (map [a : ???] [b : ???] [f : (a -&gt; b)] [l : (listof a)]) : (listof b)
  ...)
</code></pre>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x9996;&#x5148;&#xFF0C;<code>???</code>&#x5904;&#x5E94;&#x8BE5;&#x586B;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x662F;<code>a</code>&#x548C;<code>b</code>&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;a&#x548C;b&#x672C;&#x8EAB;&#x5C06;&#x88AB;<strong>&#x7C7B;&#x578B;</strong>&#x66FF;&#x6362;&#xFF0C;&#x90A3;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5176;&#x6B21;&#xFF0C;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x5E0C;&#x671B;&#x6BCF;&#x6B21;&#x8C03;&#x7528;map&#x7684;&#x65F6;&#x5019;&#x4F20;&#x5165;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x5417;&#xFF1F;&#x518D;&#x8005;&#xFF0C;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x5E0C;&#x671B;&#x5728;&#x63A5;&#x6536;&#x4EFB;&#x4F55;&#x5B9E;&#x9645;&#x503C;&#x4E4B;&#x524D;&#x5148;&#x63A5;&#x6536;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x5417;&#xFF1F;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x80FD;&#x5EF6;&#x4F38;&#x51FA;&#x5173;&#x4E8E;&#x591A;&#x6001;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x5DE8;&#x5927;&#x7684;&#x8BA8;&#x8BBA;&#x7A7A;&#x95F4;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x5927;&#x90E8;&#x5206;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x5C06;<strong>&#x4E0D;</strong>&#x4F1A;&#x6D89;&#x53CA;&#x3002;</p>
<blockquote>
<p>&#x63A8;&#x8350;&#x9605;&#x8BFB;Pierce&#x7684;&#x300A;Types and Programming Languages(&#x7C7B;&#x578B;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;)&#x300B;&#xFF0C;&#x83B7;&#x53D6;&#x6613;&#x61C2;&#x3001;&#x73B0;&#x4EE3;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
</blockquote>
<p>&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x53C2;&#x6570;&#x5316;&#xFF0C;&#x5F88;&#x591A;&#x9884;&#x671F;&#x4E4B;&#x5916;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x5C06;&#x88AB;&#x53C2;&#x6570;&#x5316;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x5E73;&#x5E73;&#x65E0;&#x5947;&#x7684;<code>cons</code>&#x51FD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x9700;&#x8981;&#x57FA;&#x4E8E;&#x94FE;&#x8868;&#x4E2D;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x53C2;&#x6570;&#x5316;&#xFF08;&#x5C3D;&#x7BA1;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;&#x4E9B;&#x503C;&#x2014;&#x2014;&#x7A0D;&#x540E;&#x4F1A;&#x89E3;&#x91CA;&#x8FD9;&#x4E00;&#x70B9;&#xFF09;&#xFF0C;&#x4E8E;&#x662F;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;<code>cons</code>&#x65F6;&#x90FD;&#x9700;&#x8981;&#x6B63;&#x786E;&#x5730;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x5B9E;&#x4F8B;&#x5316;&#x3002;&#x8BF4;&#x5230;&#x8FD9;&#xFF0C;&#x5373;&#x4F7F;&#x7528;<code>empty</code>&#x521B;&#x5EFA;&#x7A7A;&#x94FE;&#x8868;&#x4E5F;&#x5FC5;&#x987B;&#x7C7B;&#x578B;&#x5B9E;&#x4F8B;&#x5316;&#xFF01;&#x5F53;&#x7136;&#xFF0C;Java&#x548C;C++&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x8BE5;&#x5BF9;&#x8FD9;&#x4E2A;&#x75DB;&#x70B9;&#x5F88;&#x719F;&#x6089;&#x4E86;&#x3002;</p>
<h4 id="15313-&#x4E00;&#x9636;&#x591A;&#x6001;">15.3.1.3 &#x4E00;&#x9636;&#x591A;&#x6001;</h4>
<p>&#x6211;&#x4EEC;&#x5C06;&#x53EA;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x4E2D;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x6709;&#x7528;&#x4E14;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x7684;&#x70B9;&#x4E0A;&#xFF0C;&#x4E5F;&#x5373; Standard ML &#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x3001;&#x540C;&#x65F6;&#x662F;&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x548C;&#x65E9;&#x671F;&#x7248;&#x672C;&#x7684; Haskell &#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x6709;&#x8303;&#x578B;&#x52A0;&#x6210;&#x7684; Java &#x548C; C# &#x4EE5;&#x53CA;&#x5F15;&#x5165;&#x4E86;&#x6A21;&#x7248;&#x7684;C++ &#x4E5F;&#x5DEE;&#x4E0D;&#x591A;&#x83B7;&#x5F97;&#x4E86;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x90E8;&#x5206;&#x80FD;&#x529B;&#x3002;&#x8FD9;&#x7C7B;&#x8BED;&#x8A00;&#x5B9A;&#x4E49;&#x4E86;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x8C13;&#x8BCD;</strong>&#x3001;<strong>&#x4E00;&#x9636;</strong>&#x6216;&#x8005;&#x53EB;<strong>&#x524D;&#x7F00;</strong>&#x591A;&#x6001;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5173;&#x4E8E;&#x4E0A;&#x5C0F;&#x8282;&#x7684;&#x95EE;&#x9898;&#x5B83;&#x7684;&#x7B54;&#x6848;&#x662F;&#x4E0D;&#x586B;&#x3001;&#x6CA1;&#x6709;&#x3001;&#x662F;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x9996;&#x5148;&#x5C06;&#x7C7B;&#x578B;&#x7684;&#x4E16;&#x754C;&#x5206;&#x6210;&#x4E24;&#x7EC4;&#x3002;&#x7B2C;&#x4E00;&#x7EC4;&#x5305;&#x542B;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x7528;&#x5230;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x53E6;&#x5916;&#x52A0;&#x4E0A;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF1B;&#x5B83;&#x4EEC;&#x88AB;&#x79F0;&#x4E3A; <strong>monotype&#xFF08;&#x5355;&#x578B;&#xFF09;</strong>&#x3002;&#x7B2C;&#x4E8C;&#x7EC4;&#x5305;&#x542B;&#x53C2;&#x6570;&#x5316;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A; <strong>polytype&#xFF08;&#x591A;&#x578B;&#xFF09;</strong>&#xFF1B;&#x6309;&#x60EF;&#x4F8B;&#x5B83;&#x4EEC;&#x662F;&#x8FD9;&#x6837;&#x5199;&#x7684;&#xFF1A;<code>&#x2200;</code>&#x524D;&#x7F00;&#xFF0C;&#x4E00;&#x7EC4;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF0C;&#x518D;&#x8DDF;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;<code>map</code>&#x7684;&#x7C7B;&#x578B;&#x5C06;&#x5199;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-Racket">&#x2200; a, b : ((&apos;a -&gt; &apos;b) (listof &apos;a) -&gt; (listof &apos;b))
</code></pre>
<p>&#x7531;&#x4E8E;&#x201C;<code>&#x2200;</code>&#x201D;&#x662F;&#x903B;&#x8F91;&#x7B26;&#x53F7;&#x201C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x201D;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x4E8E;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x8BFB;&#x4F5C;&#xFF1A;&#x201C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7C7B;&#x578B;<code>&apos;a</code>&#x548C;<code>&apos;b</code>&#xFF0C;<code>map</code>&#x7684;&#x7C7B;&#x578B;&#x4E3A;&#x2026;&#x2026;&#x201D;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x9636;&#x591A;&#x6001;&#xFF08;rank-1 polymorphism&#xFF09;&#x4E2D;&#xFF0C;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x88AB;<code>monotype</code>&#x66FF;&#x6362;&#x3002;&#xFF08;&#x6B64;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x80FD;&#x88AB;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#x66FF;&#x6362;&#xFF0C;&#x5426;&#x5219;&#x5269;&#x4E0B;&#x7684;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x5C06;&#x65E0;&#x6CD5;&#x88AB;&#x66FF;&#x6362;&#x6389;&#x3002;&#xFF09;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x53C2;&#x6570;&#x548C;&#x5E38;&#x89C4;&#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x660E;&#x786E;&#x7684;&#x754C;&#x7EBF;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x63D0;&#x4F9B;&#x201C;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x6837;&#x5F97;&#x5230;&#x7684;&#x8BED;&#x8A00;&#x76F8;&#x5BF9;&#x7B80;&#x6D01;&#xFF0C;&#x4F46;&#x4ECD;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x5F53;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x3002;</p>
<blockquote>
<p><strong>&#x975E;&#x76F4;&#x8C13;&#x6027;</strong>&#x8BED;&#x8A00;&#xFF08;<a href="https://en.wikipedia.org/wiki/Impredicativity" target="_blank">Impredicative</a> language&#xFF09;&#x53D6;&#x6D88;&#x4E86;<code>monotype</code>&#x548C;<code>polytype</code>&#x7684;&#x533A;&#x522B;&#xFF0C;&#x56E0;&#x6B64;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x591A;&#x6001;&#x7C7B;&#x578B;&#x5B9E;&#x4F8B;&#x5316;&#x3002;</p>
</blockquote>
<p>&#x6CE8;&#x610F;&#x5230;&#x7531;&#x4E8E;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x53EA;&#x80FD;&#x88AB;<code>monotype</code>&#x66FF;&#x6362;&#xFF0C;&#x4ED6;&#x4EEC;&#x5168;&#x76F8;&#x4E92;&#x5BF9;&#x7ACB;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x5168;&#x88AB;&#x63D0;&#x5230;&#x53C2;&#x6570;&#x8868;&#x7684;&#x524D;&#x9762;&#x3002;&#x8FD9;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5F62;&#x5982;<code>&#x2200; tv, ... : t</code>&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x4E2D;<code>tv</code>&#x662F;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF0C;<code>t</code>&#x662F;<code>monotype</code>&#xFF08;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF09;&#x3002;&#x6B64;&#x8BED;&#x6CD5;&#x7684;&#x610F;&#x4E49;&#x5C31;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E4B;&#x524D;&#x79F0;&#x5176;&#x4E3A;&#x524D;&#x7F00;&#x591A;&#x6001;&#x7684;&#x539F;&#x56E0;&#x3002;&#x800C;&#x4E14;&#x540E;&#x9762;&#x4E5F;&#x5C06;&#x770B;&#x5230;&#x8FD9;&#x5BF9;&#x5176;&#x5B9E;&#x73B0;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#x3002;</p>
<h4 id="15314-&#x901A;&#x8FC7;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5B9E;&#x73B0;&#x4E00;&#x9636;&#x591A;&#x6001;&#x89E3;&#x91CA;&#x5668;">15.3.1.4 &#x901A;&#x8FC7;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x5B9E;&#x73B0;&#x4E00;&#x9636;&#x591A;&#x6001;&#x89E3;&#x91CA;&#x5668;</h4>
<p>&#x8BE5;&#x7279;&#x6027;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#x5C31;&#x662F;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x4E00;&#x79CD;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x5F62;&#x5F0F;&#xFF1A;C++ &#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x3002;&#xFF08;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x56E0;&#x4E3A; C++ &#x6709;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x6A21;&#x7248;&#x7684;&#x5B8F;&#x7CFB;&#x7EDF;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x6A21;&#x7248;&#xFF0C;&#x5B83;&#x975E;&#x5E38;&#x5DE7;&#x5408;&#x5730;&#x8FBE;&#x6210;&#x4E86;&#x4E00;&#x9636;&#x591A;&#x6001;&#x3002;&#xFF09;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x8BED;&#x6CD5;&#x5F62;&#x5F0F;<code>define-poly</code>&#xFF0C;&#x5B83;&#x63A5;&#x6536;&#x540D;&#x5B57;&#x3001;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x548C;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x5F53;&#x4F20;&#x5165;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x5C06;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x5BF9;&#x5E94;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x66FF;&#x6362;&#x4E3A;&#x6B64;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-poly (id t) (lambda ([x : t]) : t x))
</code></pre>
<p>&#x901A;&#x8FC7;&#x5C06;<code>id</code>&#x5B9A;&#x4E49;&#x4E3A;&#x591A;&#x6001;&#x7684;&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6052;&#x7B49;&#xFF08;identity&#xFF09;&#x51FD;&#x6570;&#xFF1A;&#x7ED9;<code>t</code>&#x4F20;&#x5165;&#x9012;&#x4EFB;&#x610F;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;&#x5C31;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5355;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x4E3A;<code>(t -&gt; t)</code>&#x7684;&#x51FD;&#x6570;&#xFF08;&#x5176;&#x4E2D;<code>t</code>&#x88AB;&#x66FF;&#x6362;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x5B9E;&#x4F8B;&#x5316;<code>id</code>&#xFF1A;</p>
<pre><code class="lang-Racket">(define id_num (id number))
(define id_str (id string))
</code></pre>
<p>&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x6052;&#x7B49;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(test (id_num 5) 5)
(test (id_str &quot;x&quot;)  &quot;x&quot;)
</code></pre>
<p>&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#xFF0C;&#x50CF;</p>
<pre><code class="lang-Racket">(id_num &quot;x&quot;)
(id_str 5)
</code></pre>
<p>&#x8FD9;&#x6837;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5C06;<strong>&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;</strong>&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x51FA;&#x9519;&#xFF09;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x597D;&#x5947;&#x7684;&#x8BDD;&#xFF0C;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4E86;&#x5B9E;&#x73B0;&#x3002;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#xFF1B;&#x5F88;&#x5BB9;&#x6613;&#x4F7F;&#x7528;<code>...</code>&#x5B9E;&#x73B0;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x60C5;&#x5F62;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x5C06;<code>define-poly</code>&#x5B9A;&#x4E49;&#x4E3A;&#x5B8F;&#xFF0C;<strong>&#x5B83;</strong>&#x8FD8;&#x4F1A;&#x5B9A;&#x4E49;&#x5B8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-syntax define-poly
  (syntax-rules ()
    [(_ (name tyvar) body)
     (define-syntax (name stx)
       (syntax-case stx ()
         [(_ type)
          (with-syntax ([tyvar #&apos;type])
            #&apos;body)]))]))
</code></pre>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-poly (id t) (lambda ([x : t]) : t x))
</code></pre>
<p>&#x8BE5;&#x8BED;&#x8A00;&#x5C06;&#x521B;&#x5EFA;&#x540D;&#x4E3A;<code>id</code>&#x7684;<strong>&#x5B8F;</strong>&#xFF1A;&#x5BF9;&#x5E94;<code>(define-syntax (name ...) ...)</code>&#x7684;&#x90E8;&#x5206;&#xFF08;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;<code>name</code>&#x662F;<code>id</code>&#xFF09;&#x3002;<code>id</code>&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5982;<code>(id number)</code>&#xFF0C;&#x5C06;&#x7C7B;&#x578B;&#x53D8;&#x91CF;<code>t</code>&#x3001;&#x5B8F;&#x91CC;&#x9762;&#x7684;<code>typvar</code>&#x66FF;&#x6362;&#x6210;&#x7ED9;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x56E0;&#x4E3A;&#x8981;&#x89C4;&#x907F;&#x536B;&#x751F;&#xFF0C;&#x6211;&#x4EEC;&#x7528;<code>with-syntax</code>&#x6765;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x5BF9;&#x4E8E;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF08;typvar&#xFF09;&#x7684;&#x4F7F;&#x7528;&#x88AB;&#x66FF;&#x6362;&#x4E3A;&#x7ED9;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B9E;&#x9645;&#x6548;&#x679C;&#x662F;&#xFF0C;</p>
<pre><code class="lang-Racket">(define id_num (id number))
</code></pre>
<p>&#x88AB;&#x8F6C;&#x6362;&#x6210;&#x4E86;</p>
<pre><code class="lang-Racket">(define id_num (lambda ([x : number]) : number x))
</code></pre>
<p>&#x7136;&#x800C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x4E2A;&#x91CD;&#x5927;&#x5C40;&#x9650;&#x6027;&#xFF1A;</p>
<ol>
<li><p>&#x6765;&#x8BD5;&#x8BD5;&#x5B9A;&#x4E49;&#x9012;&#x5F52;&#x7684;&#x591A;&#x6001;&#x51FD;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;<code>filter</code>&#x3002;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#xFF0C;&#x6BCF;&#x4E2A;&#x591A;&#x6001;&#x503C;&#xFF08;&#x4F8B;&#x5982;<code>cons</code>&#x548C;<code>empty</code>&#xFF09;&#x90FD;&#x9700;&#x8981;&#x7C7B;&#x578B;&#x5B9E;&#x4F8B;&#x5316;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x7B80;&#x6D01;&#x8D77;&#x89C1;&#x6211;&#x4EEC;&#x5C06;&#x4F9D;&#x8D56;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x8FD9;&#x70B9;&#xFF0C;&#x800C;&#x4EC5;&#x4E13;&#x6CE8;&#x4E8E;<code>filter</code>&#x7684;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x3002;&#x5BF9;&#x5E94;&#x4EE3;&#x7801;&#x662F;&#xFF1A;</p>
<blockquote>
<pre><code class="lang-Racket">(define-poly (filter t)
  (lambda ([f : (t -&gt; boolean)] [l : (listof t)]) : (listof t)
    (cond
      [(empty? l) empty]
      [(cons? l) (if (f (first l))
                     (cons (first l)
                           ((filter t) f (rest l)))
                     ((filter t) f (rest l)))])))
</code></pre>
</blockquote>
<p> &#x6CE8;&#x610F;&#x5230;&#x9012;&#x5F52;&#x7684;&#x4F7F;&#x7528;<code>filter</code>&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x6070;&#x5F53;&#x7684;&#x7C7B;&#x578B;&#x5BF9;&#x5176;&#x5B9E;&#x4F8B;&#x5316;&#x3002;</p>
<p> &#x4E0A;&#x9762;&#x7684;&#x5B9A;&#x4E49;&#x5B8C;&#x5168;&#x6B63;&#x786E;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x5B83;&#x65F6;&#x2014;&#x2014;&#x5982;&#xFF1A;</p>
<blockquote>
<pre><code class="lang-Racket">(define filter_num (filter number))
</code></pre>
</blockquote>
<p> DrRacket &#x5C06;&#x4E0D;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x66F4;&#x51C6;&#x786E;&#x7684;&#x8BF4;&#xFF0C;&#x662F;&#x5B8F;&#x5C55;&#x5F00;&#x4E0D;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C06;&#x4E0D;&#x65AD;&#x7684;&#x5C1D;&#x8BD5;&#x521B;&#x5EFA;<code>filter</code><strong>&#x4EE3;&#x7801;&#x7684;&#x526F;&#x672C;</strong>&#x3002;&#x4E0D;&#x8FC7;&#x5982;&#x679C;&#x7528;&#x4E0B;&#x9762;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x8BE5;&#x51FD;&#x6570;&#xFF0C;&#x5C55;&#x5F00;&#x4F1A;&#x7EC8;&#x6B62;&#x2014;&#x2014;</p>
<blockquote>
<pre><code class="lang-Racket">(define-poly (filter2 t)
  (letrec ([fltr
            (lambda ([f : (t -&gt; boolean)] [l : (listof t)]) : (listof t)
              (cond
                [(empty? l) empty]
                [(cons? l) (if (f (first l))
                               (cons (first l) (fltr f (rest l)))
                               (fltr f (rest l)))]))])
    fltr))
</code></pre>
</blockquote>
<p> &#x4F46;&#x662F;&#x8FD9;&#x7ED9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5F92;&#x589E;&#x4E86;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x75DB;&#x82E6;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4E00;&#x4E9B;&#x6A21;&#x7248;&#x5C55;&#x5F00;&#x7A0B;&#x5E8F;&#x4F1A;&#x7F13;&#x5B58;&#x4E4B;&#x524D;&#x5C55;&#x5F00;&#x7684;&#x503C;&#xFF0C;&#x907F;&#x514D;&#x5BF9;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x53C2;&#x6570;&#x53CD;&#x590D;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x3002;&#xFF08;Racket &#x505A;&#x4E0D;&#x5230;&#x8FD9;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5B8F;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x4F9D;&#x8D56;&#x53EF;&#x53D8;&#x53D8;&#x91CF;&#x548C;&#x503C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x6B64; Racket &#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x540C;&#x6837;&#x7684;&#x8F93;&#x5165;&#x8868;&#x8FBE;&#x5F0F;&#x603B;&#x662F;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x8F93;&#x51FA;&#x3002;&#xFF09;</p>
</li>
<li><p>&#x8003;&#x8651;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x7684;&#x4E24;&#x4E2A;&#x5B9E;&#x4F8B;&#x3002;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x6BD4;&#x8F83;<code>id_num</code>&#x548C;<code>id_str</code>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#xFF0C;&#x4F7F;&#x7528;<code>eq?</code>&#x6BD4;&#x8F83;&#x5B83;&#x4EEC;&#x4E5F;&#x4E0D;&#x540C;&#xFF1A;</p>
<blockquote>
<pre><code class="lang-Racket">(test (eq? (id number) (id number)) #f)
</code></pre>
</blockquote>
<p> &#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5BF9;<code>id</code>&#x6BCF;&#x6B21;&#x5B9E;&#x4F8B;&#x5316;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4EFD;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x526F;&#x672C;&#x3002;&#x5373;&#x4F7F;&#x4F7F;&#x7528;&#x4E86;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4F18;&#x5316;&#xFF0C;<strong>&#x540C;&#x4E00;&#x79CD;</strong>&#x7C7B;&#x578B;&#x5BF9;&#x5E94;&#x4EE3;&#x7801;&#x53EA;&#x6709;&#x4E00;&#x4EFD;&#x526F;&#x672C;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x5E94;&#x4EE3;&#x7801;&#x4F53;&#x8FD8;&#x662F;&#x4F1A;&#x88AB;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x2014;&#x2014;&#x4F46;&#x8FD9;&#x4E5F;&#x662F;&#x6CA1;&#x5FC5;&#x8981;&#x7684;&#xFF01;&#x4F8B;&#x5982;&#xFF0C;<code>id</code>&#x7684;&#x5B9E;&#x73B0;&#x7684;&#x90E8;&#x5206;&#x5176;&#x5B9E;&#x6CA1;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x4F9D;&#x8D56;&#x4E8E;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;<code>id</code>&#x8FD9;&#x4E00;&#x65CF;&#x65E0;&#x7A77;&#x591A;&#x4E2A;&#x7684;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x3002;&#x7B80;&#x5355;&#x7684;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7B56;&#x7565;&#x5B9E;&#x73B0;&#x4E0D;&#x4E86;&#x8FD9;&#x70B9;&#x3002;</p>
<blockquote>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;<code>C++</code>&#x6A21;&#x7248;&#x56E0;&#x4EE3;&#x7801;&#x81A8;&#x80C0;&#x7684;&#x95EE;&#x9898;&#x800C;&#x81ED;&#x540D;&#x662D;&#x8457;&#xFF0C;&#x8FD9;&#x662F;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;</p>
</blockquote>
</li>
</ol>
<p>&#x6362;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x57FA;&#x4E8E;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7684;&#x7B56;&#x7565;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4F7F;&#x7528;&#x66FF;&#x6362;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x6709;&#x7740;&#x548C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x4F7F;&#x7528;&#x66FF;&#x6362;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5176;&#x5B83;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x66FF;&#x6362;&#x7B56;&#x7565;&#x80FD;&#x8FBE;&#x6210;&#x6211;&#x4EEC;&#x5173;&#x4E8E;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#x7684;&#x671F;&#x671B;&#xFF1B;&#x5BF9;&#x4E8E;&#x591A;&#x6001;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x7684;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7B56;&#x7565;&#x7684;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x5C31;&#x662F;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x201C;&#x7406;&#x89E3;&#x201D;&#x591A;&#x6001;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x6838;&#x5FC3;&#x8BED;&#x8A00;&#x4ECD;&#x53EF;&#x4EE5;&#x662F;&#x5355;&#x6001;&#x7684;&#xFF08;monomorphic&#xFF09;&#xFF0C;&#x6240;&#x6709;&#x7684;&#xFF08;&#x4E00;&#x9636;&#xFF09;&#x591A;&#x6001;&#x5B8C;&#x5168;&#x7531;&#x5B8F;&#x5C55;&#x5F00;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5EC9;&#x4EF7;&#x7684;&#x5C06;&#x591A;&#x6001;&#x6DFB;&#x52A0;&#x5230;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4F46;&#x6B63;&#x5982;C++&#x6240;&#x793A;&#xFF0C;&#x5B83;&#x4E5F;&#x5F15;&#x5165;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x5173;&#x6CE8;&#x4E86;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x524D;&#x9762;&#x7684;&#x8BA8;&#x8BBA;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<h4 id="15315-&#x5176;&#x5B83;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;">15.3.1.5 &#x5176;&#x5B83;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;</h4>
<p>&#x6709;&#x4E9B;&#x5176;&#x4ED6;&#x5B9E;&#x73B0;&#x7B56;&#x7565;&#x4E0D;&#x4F1A;&#x9047;&#x5230;&#x6B64;&#x7C7B;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x6DF1;&#x5165;&#x8BB2;&#x89E3;&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x7B56;&#x7565;&#x7684;&#x672C;&#x8D28;&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#x201C;&#x7F13;&#x5B58;&#x201D;&#x65B9;&#x6CD5;&#x3002;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684;&#x540C;&#x4E00;&#x7EC4;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#xFF0C;&#x5E94;&#x8BE5;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x76F8;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x5B9E;&#x4F8B;&#x5316;&#x591A;&#x6B21;&#x3002;&#x8FD9;&#x907F;&#x514D;&#x4E86;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x68C0;&#x67E5;&#x4E86;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x4EE3;&#x7801;&#x4E00;&#x6B21;&#xFF0C;&#x540E;&#x7EED;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x7684;&#x5B9E;&#x4F8B;&#x5316;&#x7ED3;&#x679C;&#x5C31;&#x65E0;&#x9700;&#x518D;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF08;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF09;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x4FDD;&#x7559;&#x5B9E;&#x4F8B;&#x5316;&#x540E;&#x7684;&#x6E90;&#x7801;&#xFF1A;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x68C0;&#x67E5;&#x4E86;&#x5C55;&#x5F00;&#x540E;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4E22;&#x5F03;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x4E5F;&#x53EA;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x4E00;&#x4EFD;&#x5B9E;&#x4F8B;&#x5316;&#x7684;&#x526F;&#x672C;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E0A;&#x8FF0;&#x7EAF;&#x53BB;&#x8BED;&#x6CD5;&#x7CD6;&#x7B56;&#x7565;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x6240;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x7559;&#x5B83;&#x7684;&#x597D;&#x5904;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x6709;&#x70B9;&#x8FC7;&#x5206;&#x4E86;&#x3002;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x597D;&#x5904;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x80FD;&#x9009;&#x62E9;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x8868;&#x793A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x662F;&#x6570;&#x662F;32&#x4F4D;&#x7684;&#x8FD8;&#x662F;64&#x4F4D;&#x7684;&#x751A;&#x81F3;1&#x4F4D;&#x7684;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5E03;&#x5C14;&#x503C;&#xFF09;&#x3002;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x4F4D;&#x7684;&#x5E03;&#x5C40;&#x65B9;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;32&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#x53EF;&#x4EE5;<em>*&#x6253;&#x5305;</em>&#x8FDB;&#x4E00;&#x4E2A;32&#x4F4D;&#x5B57;&#xFF09;&#x4E3A;&#x6BCF;&#x79CD;&#x8868;&#x793A;&#x751F;&#x6210;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5BF9;&#x6BCF;&#x79CD;&#x4F7F;&#x7528;&#x7684;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x4E4B;&#x540E;&#xFF0C;&#x591A;&#x6001;&#x5B9E;&#x4F8B;&#x5316;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x51FD;&#x6570;&#x6216;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4F7F;&#x7528;&#x65F6;&#x7528;&#x5230;&#x7684;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x63D0;&#x4F9B;&#x7ED9;&#x7F16;&#x8BD1;&#x5668;&#x7528;&#x4E8E;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x3002;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x751F;&#x6210;&#x76F8;&#x5173;&#x51FD;&#x6570;&#x7684;&#x82E5;&#x5E72;&#x526F;&#x672C;&#xFF0C;&#x5F7C;&#x6B64;&#x90FD;&#x4E92;&#x4E0D;<code>eq?</code>&#x2014;&#x2014;&#x4F46;&#x8FD9;&#x4E48;&#x505A;&#x6709;&#x5145;&#x5206;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x8981;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7684;&#x786E;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<h4 id="15316-&#x5173;&#x7CFB;&#x578B;&#x53C2;&#x6570;">15.3.1.6 &#x5173;&#x7CFB;&#x578B;&#x53C2;&#x6570;</h4>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x89E3;&#x51B3;&#x5173;&#x4E8E;&#x591A;&#x6001;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x65E9;&#x5148;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#x50CF;<code>cons</code>&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5176;&#x53C2;&#x6570;&#x7684;&#x5177;&#x4F53;&#x503C;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5BF9;<code>map</code>&#x3001;<code>filter</code>&#x7B49;&#x4E5F;&#x6210;&#x7ACB;&#x3002;<code>map</code>&#x548C;<code>filter</code>&#x63A5;&#x6536;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x8981;&#x5BF9;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4F7F;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x8BE5;&#x51FD;&#x6570;&#x8D1F;&#x8D23;&#x505A;&#x51FA;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5143;&#x7D20;&#x7684;&#x51B3;&#x5B9A;&#xFF1B;<code>map</code>&#x548C;<code>filter</code>&#x672C;&#x8EAB;&#x53EA;&#x662F;&#x9075;&#x4ECE;&#x8BE5;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x201C;&#x68C0;&#x9A8C;&#x201D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x5426;&#x5C5E;&#x5B9E;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x66FF;&#x6362;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x94FE;&#x8868;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5047;&#x8BBE;&#x4E24;&#x7EC4;&#x503C;&#x4E4B;&#x95F4;&#x6709;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#xFF1B;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x6B64;&#x5173;&#x7CFB;&#x66FF;&#x6362;&#x94FE;&#x8868;&#x5143;&#x7D20;&#x548C;&#x53C2;&#x6570;&#x51FD;&#x6570;&#x3002;&#x95EE;&#x9898;&#x662F;&#xFF0C;<code>map</code>&#x548C;<code>filter</code>&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BE5;&#x5173;&#x7CFB;&#x9884;&#x6D4B;&#xFF1F;&#x5982;&#x679C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x8F93;&#x5165;&#xFF0C;<code>map</code>&#x7684;&#x8F93;&#x51FA;&#x548C;&#x5173;&#x7CFB;&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x8BF4;&#x660E;<code>map</code>&#x80AF;&#x5B9A;&#x4FA6;&#x6D4B;&#x4E86;&#x5B9E;&#x9645;&#x503C;&#x5E76;&#x6839;&#x636E;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x505A;&#x51FA;&#x4E86;&#x5904;&#x7406;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x5728;<code>map</code>&#x4E0A;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x5728;&#x5927;&#x591A;&#x6807;&#x51C6;&#x591A;&#x6001;&#x51FD;&#x6570;&#x4E0A;&#x3002;</p>
<p>&#x9075;&#x4ECE;&#x8FD9;&#x7C7B;&#x578B;&#x5173;&#x7CFB;&#x51C6;&#x5219;&#x7684;&#x51FD;&#x6570;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5173;&#x7CFB;&#x578B;&#x53C2;&#x6570;</strong>&#xFF08;Relational Parametricity&#xFF09;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x3002;&#x8FD9;&#x662F;&#x7C7B;&#x578B;&#x8D4B;&#x4E88;&#x6211;&#x4EEC;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x8FD9;&#x79CD;&#x591A;&#x6001;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x5F88;&#x53D7;&#x9650;&#x5236;&#xFF1A;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x3001;&#x590D;&#x5236;&#x6216;&#x91CD;&#x65B0;&#x6392;&#x5217;&#x5143;&#x7D20;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x80FD;&#x8003;&#x5BDF;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x5177;&#x4F53;&#x64CD;&#x7EB5;&#x3002;</p>
<blockquote>
<p>&#x8BF7;&#x53C2;&#x9605;Wadler&#x7684;&#x300A;Theorems for Free!&#x300B;&#x548C;Reynolds&#x7684;&#x300A;Types, Abstraction and Parametric Polymorphism&#x300B;&#x3002;</p>
</blockquote>
<p>&#x8D77;&#x521D;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x4EE4;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#xFF08;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#xFF01;&#xFF09;&#xFF0C;&#x4F46;&#x7EC6;&#x67E5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E0E;&#x7ECF;&#x9A8C;&#x5E76;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;Java&#x4E2D;&#xFF0C;&#x591A;&#x6001;&#x65B9;&#x6CD5;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>instanceof</code>&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x68C0;&#x67E5;&#x3001;&#x83B7;&#x5F97;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x76F8;&#x5E94;&#x7684;&#x6539;&#x53D8;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5C31;&#x4E0D;&#x662F;&#x5173;&#x7CFB;&#x578B;&#x53C2;&#x6570;&#x4E86;&#xFF01;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5173;&#x7CFB;&#x578B;&#x53C2;&#x6570;&#x4E5F;&#x80FD;&#x88AB;&#x770B;&#x4F5C;&#x662F;&#x8BED;&#x8A00;&#x5F31;&#x70B9;&#x7684;&#x4E00;&#x79CD;&#x8868;&#x8FF0;&#xFF1A;&#x5B83;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x7EC4;&#x6709;&#x9650;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#xFF08;&#x4F60;&#x4ECD;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x7C7B;&#x578B;&#x2014;&#x2014;&#x4F46;&#x4E0D;&#x80FD;&#x6839;&#x636E;&#x4F60;&#x83B7;&#x53D6;&#x7684;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x76F8;&#x5173;&#x884C;&#x52A8;&#xFF0C;&#x8FD9;&#x6837;&#x68C0;&#x67E5;&#x5C31;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#x8FD0;&#x884C;&#x65F6;&#x7CFB;&#x7EDF;&#x5982;&#x679C;&#x60F3;&#x8981;&#x6A21;&#x62DF;&#x5173;&#x7CFB;&#x578B;&#x53C2;&#x6570;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x79FB;&#x9664;&#x7C7B;&#x4F3C;<code>instanceof</code>&#x53CA;&#x5B83;&#x7684;&#x66FF;&#x4EE3;&#x884C;&#x4E3A;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x503C;&#x8FDB;&#x884C;&#x52A0;&#x4E00;&#x64CD;&#x4F5C;&#x5E76;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x4EE5;&#x5224;&#x65AD;&#x5B83;&#x662F;&#x6570;&#x3002;&#xFF09;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x4F18;&#x96C5;&#x548C;&#x4EE4;&#x4EBA;&#x5403;&#x60CA;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x663E;&#x793A;&#x4E86;&#x4F7F;&#x7528;&#x4E30;&#x5BCC;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x80FD;&#x83B7;&#x5F97;&#x7684;&#x5F3A;&#x5927;&#x7A0B;&#x5E8F;&#x63A8;&#x7406;&#x80FD;&#x529B;&#x3002;</p>
<blockquote>
<p>&#x7F51;&#x4E0A;&#xFF0C;&#x4F60;&#x4F1A;&#x7ECF;&#x5E38;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x51FD;&#x6570;&#x4E0D;&#x80FD;&#x68C0;&#x67E5;&#x5176;&#x53C2;&#x6570;&#x2014;&#x2014;&#x8FD9;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
</blockquote>
<h3 id="1532-&#x7C7B;&#x578B;&#x63A8;&#x65AD;">15.3.2 &#x7C7B;&#x578B;&#x63A8;&#x65AD;</h3>
<p>&#x624B;&#x5DE5;&#x4E66;&#x5199;&#x6BCF;&#x5904;&#x591A;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x6CAE;&#x4E27;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5F88;&#x591A;&#x7248;&#x672C;&#x7684;Java&#x548C;C++&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x8FD9;&#x70B9;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;<code>first</code>&#x548C;<code>rest</code>&#x65F6;&#x90FD;&#x9700;&#x8981;&#x4F20;&#x5165;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#xFF01;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x591F;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x547D;&#x8FD0;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x4E86;<strong>&#x7C7B;&#x578B;&#x63A8;&#x65AD;</strong>&#x3002;&#x8FD9;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (mapper f l)
  (cond
    [(empty? l) empty]
    [(cons? l) (cons (f (first l)) (mapper f (rest l)))]))
</code></pre>
<p>&#x7136;&#x540E;&#x7F16;&#x7A0B;&#x73AF;&#x5883;<strong>&#x81EA;&#x52A8;</strong>&#x58F0;&#x660E;</p>
<pre><code class="lang-Racket">&gt; mapper
- ((&apos;a -&gt; &apos;b) (listof &apos;a) -&gt; (listof &apos;b))
</code></pre>
<p>&#x5B83;&#x4E0D;&#x4EC5;&#x662F;&#x6B63;&#x786E;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x975E;&#x5E38;&#x4E00;&#x822C;&#x7684;&#x7C7B;&#x578B;&#xFF01;&#x4ECE;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x4E2D;&#x6D3E;&#x751F;&#x51FA;&#x8FD9;&#x79CD;&#x4E00;&#x822C;&#x7C7B;&#x578B;&#x7684;&#x8FC7;&#x7A0B;&#x611F;&#x89C9;&#x51E0;&#x4E4E;&#x5C31;&#x662F;&#x9B54;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x63ED;&#x793A;&#x5176;&#x5E55;&#x540E;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x4E86;&#x89E3;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x9519;&#x8BEF;&#x7684;&#x8BA4;&#x4E3A;&#xFF0C;&#x6709;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x7684;&#x8BED;&#x8A00;&#x65E0;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#xFF0C;&#x5176;&#x88AB;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x4E86;&#x3002;&#x8FD9;&#x6DF7;&#x6DC6;&#x4E86;&#x591A;&#x4E2A;&#x5C42;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x6709;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4ECD;&#x88AB;&#x5141;&#x8BB8;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#xFF08;&#x5E76;&#x4E14;&#x4E3A;&#x4E86;&#x6587;&#x6863;&#x66F4;&#x4E3A;&#x6E05;&#x6670;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x9F13;&#x52B1;&#x8FD9;&#x6837;&#x505A;&#x2014;&#x2014;&#x5C31;&#x50CF;&#x4F60;&#x4E4B;&#x524D;&#x88AB;&#x9F13;&#x52B1;&#x7684;&#x4E00;&#x6837;&#xFF09;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x58F0;&#x660E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x63A8;&#x65AD;&#x7684;&#x5B9E;&#x9645;<strong>&#x542B;&#x4E49;</strong>&#x5E76;&#x4E0D;&#x663E;&#x660E;&#x3002;</p>
<blockquote>
<p>&#x6709;&#x65F6;&#xFF08;&#x7C7B;&#x578B;&#xFF09;&#x63A8;&#x65AD;&#x662F;&#x4E0D;&#x53EF;&#x5224;&#x5B9A;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x7A0B;&#x5E8F;&#x5458;&#x522B;&#x65E0;&#x9009;&#x62E9;&#x53EA;&#x80FD;&#x58F0;&#x660E;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x663E;&#x5F0F;&#x7684;&#x4E66;&#x5199;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x80FD;&#x591F;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x96BE;&#x4EE5;&#x8FA8;&#x8BA4;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x6700;&#x597D;&#x5C06;&#x5E95;&#x5C42;&#x8BED;&#x8A00;&#x770B;&#x4F5C;&#x9700;&#x8981;&#x5B8C;&#x6574;&#x5730;&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x7684;&#x2014;&#x2014;&#x5C31;&#x5982;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x7814;&#x7A76;&#x7684;&#x591A;&#x6001;&#x8BED;&#x8A00;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8BF4;&#xFF0C;&#x5728;<code>:</code>&#x540E;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x7559;&#x7A7A;&#xFF0C;&#x7F16;&#x7A0B;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x7279;&#x6027;&#x4F1A;&#x4E3A;&#x6211;&#x4EEC;&#x586B;&#x5145;&#x8FD9;&#x4E9B;&#x3002;&#xFF08;&#x5982;&#x679C;&#x8D70;&#x5F97;&#x66F4;&#x8FDC;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E22;&#x5F03;<code>:</code>&#x53CA;&#x989D;&#x5916;&#x7684;&#x4FEE;&#x9970;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x63D2;&#x5165;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x53EA;&#x662F;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x79CD;&#x4FBF;&#x5229;&#xFF0C;&#x51CF;&#x8F7B;&#x7F16;&#x5199;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x800C;&#x5E95;&#x5C42;&#x7684;&#x8BED;&#x8A00;&#x4ECD;&#x7136;&#x662F;&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x8003;&#x8651;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x505A;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x6216;&#x8005;&#x7A0B;&#x5E8F;&#xFF09;<code>e</code>&#xFF0C;&#x7531;&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E66;&#x5199;&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5728;&#x4EFB;&#x4F55;&#x9700;&#x8981;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x6709;&#x5199;&#x51FA;&#x3002;&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x64E6;&#x9664;<code>e</code>&#x4E2D;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x51FD;&#x6570;<code>infer</code>&#x5C06;&#x5B83;&#x4EEC;&#x63A8;&#x65AD;&#x56DE;&#x6765;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p><code>infer</code>&#x5E94;&#x8BE5;&#x6709;&#x4F55;&#x79CD;&#x5C5E;&#x6027;&#xFF1F;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x3002;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x4E3A;&#xFF0C;&#x5B83;&#x8981;&#x4EA7;&#x751F;&#x548C;<code>e</code>&#x539F;&#x6765;&#x6070;&#x597D;&#x4E00;&#x6837;&#x7684;&#x6CE8;&#x89E3;&#x3002;&#x8FD9;&#x5728;&#x5F88;&#x591A;&#x65B9;&#x9762;&#x90FD;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;<code>e</code>&#x672C;&#x5C31;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x63A8;&#x65AD;&#x56DE;&#x5B83;&#x4EEC;&#xFF08;&#x5E94;&#x8BE5;&#xFF09;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x4F60;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x4E2A;&#x5B66;&#x7A76;&#x5F0F;&#x7684;&#x73A9;&#x7B11;&#xFF1A;&#x6BD5;&#x7ADF;&#xFF0C;&#x5982;&#x679C;<code>e</code>&#x672C;&#x5C31;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x5728;&#x5220;&#x9664;&#x5176;&#x6CE8;&#x89E3;&#x4E4B;&#x540E;&#x8FD8;&#x80FD;&#x8FD8;&#x539F;&#x56DE;&#x6765;&#x5462;&#xFF1F;&#x53CD;&#x6B63;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x8C01;&#x5728;&#x4E4E;&#x554A;&#xFF1F;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x8FD9;&#x4E2A;&#x63A8;&#x7406;&#x6B63;&#x786E;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x5047;&#x8BBE;<code>e</code>&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">(lambda ([x : number]) : string x)
</code></pre>
<p>&#x5B83;&#x663E;&#x7136;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x64E6;&#x9664;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x2014;&#x2014;&#x5F97;&#x5230;</p>
<pre><code class="lang-Racket">(lambda (x) x)
</code></pre>
<p>&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x663E;&#x7136;&#x53EF;&#x4EE5;&#x5408;&#x6CD5;&#x5730;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#xFF01;&#x56E0;&#x6B64;&#xFF0C;&#x66F4;&#x5408;&#x7406;&#x7684;&#x9700;&#x6C42;&#x53EF;&#x4EE5;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x539F;&#x59CB;&#x7684;<code>e</code>&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x5E94;&#x7684;&#x4F7F;&#x7528;&#x4E86;&#x63A8;&#x5BFC;&#x51FA;&#x7684;&#x6CE8;&#x89E3;&#x7684;&#x7248;&#x672C;&#x4E5F;&#x5FC5;&#x987B;&#x80FD;&#x3002;&#x8FD9;&#x79CD;&#x5355;&#x5411;&#x7684;&#x542B;&#x4E49;&#x7684;&#x7528;&#x9014;&#x4F53;&#x73B0;&#x5728;&#x4E24;&#x65B9;&#x9762;&#xFF1A;</p>
<ol>
<li>&#x5B83;&#x6CA1;&#x6709;&#x8BF4;<code>e</code>&#x672A;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5E94;&#x8BE5;&#x600E;&#x6837;&#xFF0C;&#x4E5F;&#x5373;&#x5B83;&#x4E0D;&#x4F1A;&#x6392;&#x9664;&#x524D;&#x8FF0;&#x7684;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x4F1A;&#x5C06;&#x4F8B;&#x5B50;&#x4E2D;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x7684;&#x6052;&#x7B49;&#x51FD;&#x6570;&#x53D8;&#x6210;&#x7C7B;&#x578B;&#x6B63;&#x786E;&#x7684;&#x3002;</li>
<li>&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x5411;&#x6211;&#x4EEC;&#x4FDD;&#x8BC1;&#xFF0C;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x5C06;&#x4E0D;&#x4F1A;&#x4F7F;&#x6211;&#x4EEC;&#x5931;&#x53BB;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF1A;&#x4E4B;&#x524D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x6D4B;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x88AB;&#x63A8;&#x65AD;&#x540E;&#x800C;&#x4E0D;&#x80FD;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x60F3;&#x8981;&#x7684;&#x5730;&#x65B9;&#x663E;&#x5F0F;&#x6DFB;&#x52A0;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x88AB;&#x8FEB;&#x8FD9;&#x6837;&#x505A;&#x3002;<blockquote>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x53EA;&#x5728;&#x7A0B;&#x5E8F;&#x63A8;&#x65AD;&#x53EF;&#x5224;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x6210;&#x7ACB;&#x3002;</p>
</blockquote>
</li>
</ol>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x4E24;&#x8005;&#x7C7B;&#x578B;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x662F;&#x80FD;&#x505A;&#x5230;&#x7684;&#xFF1A;&#x51FD;&#x6570;</p>
<pre><code class="lang-Racket">(lambda ([x : number]) : number x)
</code></pre>
<p>&#x7C7B;&#x578B;&#x4E3A;<code>(number -&gt; number)</code>&#xFF0C;&#x800C;&#x64E6;&#x9664;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x540E;&#x63A8;&#x5BFC;&#x51FA;&#x7684;&#x7C7B;&#x578B;&#x8981;&#x4E00;&#x822C;&#x5F97;&#x591A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x5173;&#x8054;&#x5E76;&#x7ED9;&#x51FA;&#x7C7B;&#x578B;&#x76F8;&#x7B49;&#x7684;&#x5B9A;&#x4E49;&#x5E76;&#x4E0D;&#x7B80;&#x5355;&#xFF0C;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#x540E;&#x9762;&#x5C06;&#x7B80;&#x8981;&#x8BA8;&#x8BBA;&#x6B64;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x51C6;&#x5907;&#xFF0C;&#x6211;&#x4EEC;&#x4E0B;&#x9762;&#x8FDB;&#x5165;&#x5BF9;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#x673A;&#x5236;&#x7684;&#x7814;&#x7A76;&#x3002;&#x6700;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x524D;&#x8FF0;&#x7684;&#x7B80;&#x5355;&#x9012;&#x5F52;&#x4E0B;&#x964D;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7B97;&#x6CD5;&#x5C06;&#x4E0D;&#x518D;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x5B83;&#x4E4B;&#x524D;&#x80FD;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x51FD;&#x6570;&#x7684;&#x8FB9;&#x754C;&#x5904;&#x90FD;&#x6709;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0B;&#x964D;&#x8FDB;&#x5165;&#x51FD;&#x6570;&#x4F53;&#xFF0C;&#x540C;&#x65F6;&#x7528;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#x643A;&#x5E26;&#x8FD9;&#x4E9B;&#x6CE8;&#x89E3;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x6CA1;&#x4E86;&#x8FD9;&#x4E9B;&#x6CE8;&#x89E3;&#xFF0C;&#x5C31;&#x4E0D;&#x77E5;&#x5982;&#x4F55;&#x9012;&#x5F52;&#x4E0B;&#x964D;&#x4E86;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x76EE;&#x524D;&#x8FD8;&#x4E0D;&#x6E05;&#x695A;&#x54EA;&#x4E2A;&#x65B9;&#x5411;&#x66F4;&#x5408;&#x7406;&#x3002;&#x50CF;&#x4E0A;&#x9762;<code>mapper</code>&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5404;&#x4EE3;&#x7801;&#x6BB5;&#x4E4B;&#x95F4;&#x4E92;&#x76F8;&#x5F71;&#x54CD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4ECE;<code>empty?</code>&#x3001;<code>cons?</code>&#x3001;<code>first</code>&#x548C;<code>rest</code>&#x5BF9;<code>l</code>&#x7684;&#x8C03;&#x7528;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5B83;&#x662F;&#x94FE;&#x8868;&#x3002;&#x4F46;&#x662F;&#x662F;&#x4EC0;&#x4E48;&#x7684;&#x94FE;&#x8868;&#x5462;&#xFF1F;&#x4ECE;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x6BCF;&#x4E2A;&#xFF08;&#x6216;&#x8005;&#x5E94;&#x8BE5;&#x8BF4;&#xFF0C;&#x4EFB;&#x610F;&#xFF09;<code>first</code>&#x5143;&#x7D20;&#x8C03;&#x7528;&#x4E86;<code>f</code>&#x8FD9;&#x70B9;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x94FE;&#x8868;&#x6210;&#x5458;&#x7684;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x53EF;&#x4EE5;&#x88AB;&#x4F20;&#x7ED9;<code>f</code>&#x3002;&#x540C;&#x7406;&#xFF0C;&#x7531;<code>empty</code>&#x548C;<code>cons</code>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#xFF08;<code>mapper</code>&#x7684;&#xFF09;&#x8FD4;&#x56DE;&#x8868;&#x8FBE;&#x5F0F;&#x5FC5;&#x987B;&#x4E3A;&#x94FE;&#x8868;&#x3002;&#x5B83;&#x7684;&#x6210;&#x5458;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5FC5;&#x987B;&#x4E3A;<code>f</code>&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x6700;&#x5FAE;&#x5999;&#x7684;&#x5730;&#x65B9;&#xFF1A;&#x5F53;&#x53C2;&#x6570;&#x94FE;&#x8868;&#x4E3A;&#x7A7A;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8FD4;&#x56DE;<code>empty</code>&#x800C;&#x4E0D;&#x662F;<code>l</code>&#xFF08;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x662F;&#x77E5;&#x9053;&#x5176;&#x88AB;&#x7ED1;&#x5B9A;&#x5230;<code>empty</code>&#xFF09;&#x3002;&#x4F7F;&#x7528;&#x524D;&#x8005;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x80FD;&#x662F;&#x4EFB;&#x610F;&#x7C7B;&#x578B;&#x7684;&#x94FE;&#x8868;&#xFF08;&#x4EC5;&#x53D7;<code>f</code>&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x7684;&#x7EA6;&#x675F;&#xFF09;&#xFF1B;&#x4F7F;&#x7528;&#x540E;&#x8005;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x88AB;&#x8FEB;&#x548C;&#x53C2;&#x6570;&#x94FE;&#x8868;&#x7684;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x90FD;&#x5305;&#x542B;&#x5728;&#x51FD;&#x6570;&#x91CC;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x7CFB;&#x7EDF;&#x5730;&#x63D0;&#x53D6;&#x51FA;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5462;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x5FC5;&#x987B;&#x4F1A;&#x7EC8;&#x6B62;&#xFF0C;&#x5E76;&#x6EE1;&#x8DB3;&#x524D;&#x9762;&#x9648;&#x8FF0;&#x5C5E;&#x6027;&#xFF1F;&#x6211;&#x4EEC;&#x5206;&#x4E24;&#x6B65;&#x6765;&#x505A;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6839;&#x636E;&#x7A0B;&#x5E8F;&#x8868;&#x8FBE;&#x5F0F;<strong>&#x751F;&#x6210;</strong>&#x5176;&#x5FC5;&#x987B;&#x8981;&#x6EE1;&#x8DB3;&#x7684;&#x7C7B;&#x578B;<strong>&#x7EA6;&#x675F;</strong>&#x3002;&#x7136;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x5408;&#x5E76;&#x6563;&#x5E03;&#x5728;&#x51FD;&#x6570;&#x4F53;&#x5404;&#x5904;&#x7684;&#x7EA6;&#x675F;&#x3001;&#x8BC6;&#x522B;&#x5176;&#x4E2D;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6700;&#x7EC8;<strong>&#x89E3;&#x51B3;&#x7EA6;&#x675F;</strong>&#x3002;&#x6BCF;&#x4E00;&#x6B65;&#x90FD;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x521B;&#x9020;&#x4E86;&#x9B54;&#x529B;&#x3002;</p>
<h4 id="15321-&#x7EA6;&#x675F;&#x751F;&#x6210;">15.3.2.1 &#x7EA6;&#x675F;&#x751F;&#x6210;</h4>
<p>&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x6807;&#x662F;&#x7ED9;&#x6BCF;&#x4E2A;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x4F4D;&#x7F6E;&#x586B;&#x5165;&#x7C7B;&#x578B;&#x3002;&#x5C06;&#x4F1A;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x4E5F;&#x7B49;&#x540C;&#x4E8E;&#x627E;&#x5230;&#x6BCF;&#x4E2A;<strong>&#x8868;&#x8FBE;&#x5F0F;</strong>&#x7684;&#x7C7B;&#x578B;&#x3002;&#x7B80;&#x5355;&#x60F3;&#x60F3;&#x5C31;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x672C;&#x6765;&#x4E5F;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF1A;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x51FD;&#x6570;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x4F55;&#x80FD;&#x786E;&#x5B9A;&#x51FD;&#x6570;&#x672C;&#x8EAB;&#x7684;&#x7C7B;&#x578B;&#xFF1F;&#x8FD9;&#x4E5F;&#x662F;&#x8DB3;&#x591F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x90FD;&#x88AB;&#x8BA1;&#x7B97;&#x5F97;&#x51FA;&#xFF0C;&#x5176;&#x4E2D;&#x5FC5;&#x7136;&#x5305;&#x62EC;&#x4E86;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x88AB;&#x6CE8;&#x89E3;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x751F;&#x6210;&#xFF08;&#x5F85;&#x89E3;&#x51B3;&#x7684;&#xFF09;&#x7EA6;&#x675F;&#x3002;&#x8FD9;&#x4E00;&#x6B65;&#x4F1A;&#x904D;&#x5386;&#x7A0B;&#x5E8F;&#x6E90;&#x7801;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x751F;&#x6210;&#x6070;&#x5F53;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x6700;&#x540E;&#x8FD4;&#x56DE;&#x8FD9;&#x7EC4;&#x7EA6;&#x675F;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#xFF0C;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF1B;&#x5B83;&#x6700;&#x7EC8;&#x751F;&#x6210;&#x7EA6;&#x675F;&#x7684;<strong>&#x96C6;&#x5408;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x539F;&#x5219;&#x4E0A;&#x904D;&#x5386;&#x548C;&#x751F;&#x6210;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x7684;&#x2014;&#x2014;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x7684;&#x9012;&#x5F52;&#x4E0B;&#x964D;&#x65B9;&#x5F0F;&#x2014;&#x2014;&#x5F53;&#x7136;&#xFF0C;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x94FE;&#x8868;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x7EA6;&#x675F;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5C31;&#x662F;&#x5173;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x7684;&#x9648;&#x8FF0;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x867D;&#x7136;&#x53D8;&#x91CF;&#x7ED1;&#x5B9A;&#x5E76;&#x4E0D;&#x662F;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4ECD;&#x9700;&#x8BA1;&#x7B97;&#x5176;&#x7C7B;&#x578B;&#xFF08;&#x56E0;&#x4E3A;&#x51FD;&#x6570;&#x9700;&#x8981;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#xFF09;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E9B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<ol>
<li>&#x5B83;&#x548C;&#x67D0;&#x4E9B;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x7C7B;&#x578B;&#x6709;&#x5173;&#x3002;</li>
<li>&#x5B83;&#x548C;&#x67D0;&#x4E9B;&#x5176;&#x5B83;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x6709;&#x5173;&#x3002;</li>
<li>&#x5B83;&#x662F;&#x6570;&#x3002;</li>
<li>&#x5B83;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x5176;&#x5B9A;&#x4E49;&#x57DF;&#xFF08;domain&#xFF09;&#x548C;&#x503C;&#x57DF;&#xFF08;range&#xFF09;&#x7C7B;&#x578B;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x7EA6;&#x675F;&#x3002;</li>
</ol>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type Constraints
  [eqCon (lhs : Term) (rhs : Term)])

(define-type Term
  [tExp (e : ExprC)]
  [tVar (s : symbol)]
  [tNum]
  [tArrow (dom : Term) (rng : Term)])
</code></pre>
<p>&#x63A5;&#x4E0B;&#x6765;&#x5B9A;&#x4E49;&#x7EA6;&#x675F;&#x751F;&#x6210;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;constr-gen&gt; ::= ;&#x7EA6;&#x675F;&#x751F;&#x6210;

    (define (cg [e : ExprC]) : (listof Constraints)
      (type-case ExprC e
        &lt;constr-gen-numC-case&gt;
        &lt;constr-gen-idC-case&gt;
        &lt;constr-gen-plusC/multC-case&gt;
        &lt;constr-gen-appC-case&gt;
        &lt;constr-gen-lamC-case&gt;))
</code></pre>
<p>&#x5F53;&#x8868;&#x8FBE;&#x5F0F;&#x4E3A;&#x6570;&#x65F6;&#xFF0C;&#x552F;&#x4E00;&#x80FD;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x4E3A;&#x6570;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;constr-gen-numC-case&gt; ::=

    [numC (_) (list (eqCon (tExp e) (tNum)))]
</code></pre>
<p>&#x542C;&#x4E0A;&#x53BB;&#x5F88;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x662F;&#xFF0C;&#x5176;&#x4ED6;&#x5305;&#x542B;&#x5B83;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x67D0;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x4E0E;&#x6B64;&#x65AD;&#x8A00;&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x662F;&#x6570;&#x578B;&#x2014;&#x2014;&#x76F8;&#x77DB;&#x76FE;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x671F;&#x671B;&#x8BE5;&#x6807;&#x8BC6;&#x7B26;&#x5E94;&#x6709;&#x7684;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;constr-gen-idC-case&gt; ::=

    [idC (s) (list (eqCon (tExp e) (tVar s)))]
</code></pre>
<p>&#x5982;&#x679C;&#x4E0A;&#x4E0B;&#x6587;&#x9650;&#x5236;&#x4E86;&#x5176;&#x7C7B;&#x578B;&#xFF0C;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x5C06;&#x81EA;&#x52A8;&#x53D7;&#x5230;&#x9650;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x4E0E;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x671F;&#x671B;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x52A0;&#x6CD5;&#x662F;&#x6211;&#x4EEC;&#x7B2C;&#x4E00;&#x4E2A;&#x9047;&#x5230;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x7EA6;&#x675F;&#x3002;&#x5BF9;&#x4E8E;&#x52A0;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x6211;&#x4EEC;&#x751F;&#x6210;&#xFF08;&#x5E76;&#x8FD4;&#x56DE;&#xFF09;&#x5176;&#x4E24;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x800C;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x662F;&#x590D;&#x6742;&#x7684;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x7EA6;&#x675F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x4EC0;&#x4E48;&#xFF1F;&#x9700;&#x8981;&#x6BCF;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x3002;&#xFF08;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x662F;&#x6570;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x5E94;&#x8BE5;&#x5BFC;&#x81F4;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x3002;&#xFF09;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x65AD;&#x8A00;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x4E3A;&#x6570;&#x3002;</p>
<pre><code class="lang-Racket">&lt;constr-gen-plusC/multC-case&gt; ::=

    [plusC (l r) (append3 (cg l)
                          (cg r)
                          (list (eqCon (tExp l) (tNum))
                                (eqCon (tExp r) (tNum))
                                (eqCon (tExp e) (tNum))))]
</code></pre>
<blockquote>
<p><code>append3</code>&#x662F;<code>append</code>&#x7684;&#x4E09;&#x53C2;&#x6570;&#x7248;&#x672C;&#x3002;</p>
</blockquote>
<p><code>multC</code>&#x7684;&#x60C5;&#x51B5;&#x4E0E;&#x4E4B;&#x76F8;&#x540C;&#xFF0C;&#x533A;&#x522B;&#x53EA;&#x5728;&#x540D;&#x5B57;&#x4E0A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x51FD;&#x6570;&#x58F0;&#x660E;&#x548C;&#x8C03;&#x7528;&#x3002;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x6211;&#x4EEC;&#x90FD;&#x9700;&#x8981;&#x751F;&#x6210;&#x548C;&#x8FD4;&#x56DE;&#x5B50;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7EA6;&#x675F;&#x3002;</p>
<p>&#x5728;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x51FD;&#x6570;&#xFF08;&#x201C;&#x7BAD;&#x5934;/arrow&#x201D;&#xFF09;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x662F;&#x5F62;&#x53C2;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x662F;&#x51FD;&#x6570;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code class="lang-Racket">&lt;constr-gen-lamC-case&gt; ::=

    [lamC (a b) (append (cg b)
                        (list (eqCon (tExp e) (tArrow (tVar a) (tExp b)))))]
</code></pre>
<p>&#x6700;&#x7EC8;&#xFF0C;&#x8003;&#x8651;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9648;&#x8FF0;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x7C7B;&#x578B;&#x7EA6;&#x675F;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x51FD;&#x6570;&#x63A5;&#x53D7;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x548C;&#x5B9E;&#x9645;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#xFF0C;&#x5E76;&#x4E14;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x8C03;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<pre><code class="lang-Racket">&lt;constr-gen-appC-case&gt; ::=

    [appC (f a) (append3 (cg f)
                         (cg a)
                         (list (eqCon (tExp f) (tArrow (tExp a) (tExp e)))))]
</code></pre>
<p>&#x5B8C;&#x6210;&#x4E86;&#xFF01;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x7EA6;&#x675F;&#x7684;&#x751F;&#x6210;&#xFF1B;&#x73B0;&#x5728;&#x53EA;&#x9700;&#x89E3;&#x51FA;&#x5B83;&#x4EEC;&#x3002;</p>
<h4 id="15322-&#x4F7F;&#x7528;&#x5408;&#x4E00;&#x6C42;&#x89E3;&#x7EA6;&#x675F;">15.3.2.2 &#x4F7F;&#x7528;&#x5408;&#x4E00;&#x6C42;&#x89E3;&#x7EA6;&#x675F;</h4>
<p>&#x6C42;&#x89E3;&#x7EA6;&#x675F;&#x7684;&#x8FC7;&#x7A0B;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5408;&#x4E00;</strong>&#xFF08;unification&#xFF09;&#x3002;&#x5408;&#x4E00;&#x5668;&#x7684;&#x8F93;&#x5165;&#x662F;&#x7B49;&#x5F0F;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x7B49;&#x5F0F;&#x662F;&#x53D8;&#x91CF;&#x5230;&#x9879;&#xFF08;term&#xFF09;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x9879;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5728;&#x4E0A;&#x9762;&#x5B9A;&#x4E49;&#x4E86;&#x3002;&#x6CE8;&#x610F;&#x5230;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x6709;<strong>&#x4E24;</strong>&#x79CD;&#x53D8;&#x91CF;&#x3002;<code>tvar</code>&#x548C;<code>tExp</code>&#x90FD;&#x662F;&#x201C;&#x53D8;&#x91CF;&#x201D;&#xFF0C;&#x524D;&#x8005;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x6CE8;&#x610F;&#x540E;&#x8005;&#x540C;&#x6837;&#x4E5F;&#x662F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6C42;&#x89E3;&#x6B64;&#x7C7B;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x3002;&#xFF08;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x4E3A;&#x6BCF;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x5F15;&#x5165;&#x65B0;&#x7684;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4ECD;&#x9700;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x786E;&#x5B9A;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x4E0E;&#x8868;&#x8FBE;&#x5F0F;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x8FD9;&#x5DF2;&#x7ECF;&#x80FD;&#x901A;&#x8FC7;&#x5BF9;&#x8868;&#x8FBE;&#x5F0F;&#x8FDB;&#x884C;<code>eq?</code>&#x64CD;&#x4F5C;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x53E6;&#x5916;&#x8FD9;&#x4F1A;&#x4EA7;&#x751F;&#x5927;&#x5F97;&#x591A;&#x7684;&#x7EA6;&#x675F;&#x96C6;&#xFF0C;&#x4E0D;&#x597D;&#x8FDB;&#x884C;&#x4EBA;&#x5DE5;&#x68C0;&#x67E5;&#x3002;&#xFF09;</p>
<p>&#x5C31;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x800C;&#x8A00;&#xFF0C;&#x5408;&#x4E00;&#x662F;&#x4E3A;&#x4E86;&#x662F;&#x751F;&#x6210;<strong>&#x66FF;&#x6362;</strong>&#xFF08;substitution&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5C06;&#x53D8;&#x91CF;&#x6620;&#x5C04;&#x4E3A;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x53D8;&#x91CF;&#x7684;&#x9879;&#x3002;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x5E94;&#x8BE5;&#x5F88;&#x8033;&#x719F;&#xFF1A;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x7EC4;&#x8054;&#x7ACB;&#x65B9;&#x7A0B;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x90FD;&#x662F;&#x7EBF;&#x6027;&#x4F7F;&#x7528;&#x7684;&#xFF1B;&#x8FD9;&#x79CD;&#x65B9;&#x7A0B;&#x7EC4;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<strong>&#x9AD8;&#x65AF;&#x6D88;&#x5143;&#x6CD5;</strong>&#x6C42;&#x89E3;&#x3002;&#x8BE5;&#x60C5;&#x5F62;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6E05;&#x695A;&#x6700;&#x7EC8;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x7F3A;&#x5C11;&#x7EA6;&#x675F;&#xFF08;under-constrained&#xFF09;&#x6216;&#x8FC7;&#x5EA6;&#x7EA6;&#x675F;&#xFF08;over-constrained&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x79CD;&#x4E8B;&#x60C5;&#x540C;&#x6837;&#x4E5F;&#x5C06;&#x53D1;&#x751F;&#x8FD9;&#x91CC;&#x3002;</p>
<p>&#x5408;&#x4E00;&#x7B97;&#x6CD5;&#x4F1A;&#x904D;&#x5386;&#x7EA6;&#x675F;&#x96C6;&#x5408;&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x7EA6;&#x675F;&#x6709;&#x4E24;&#x9879;&#xFF0C;&#x6BCF;&#x4E2A;&#x9879;&#x6709;&#x56DB;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x6709;&#x5341;&#x516D;&#x79CD;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x8003;&#x8651;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x53EF;&#x4EE5;&#x7528;&#x6BD4;&#x8F83;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x8986;&#x76D6;&#x8FD9;&#x5341;&#x516D;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x7B97;&#x6CD5;&#x4ECE;&#x6240;&#x6709;&#x7EA6;&#x675F;&#x7684;&#x96C6;&#x5408;&#x548C;&#x7A7A;&#x66FF;&#x6362;&#x5F00;&#x59CB;&#x3002;&#x6BCF;&#x4E2A;&#x7EA6;&#x675F;&#x90FD;&#x4F1A;&#x88AB;&#x5904;&#x7406;&#x4E00;&#x6B21;&#xFF0C;&#x5E76;&#x4ECE;&#x96C6;&#x5408;&#x4E2D;&#x5220;&#x9664;&#xFF0C;&#x56E0;&#x6B64;&#x539F;&#x5219;&#x4E0A;&#x7EC8;&#x6B62;&#x5224;&#x636E;&#x5E94;&#x8BE5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x5904;&#x7406;&#x8D77;&#x6765;&#x8FD8;&#x6709;&#x70B9;&#x5C0F;&#x9EBB;&#x70E6;&#x3002;&#x968F;&#x7740;&#x7EA6;&#x675F;&#x88AB;&#x5904;&#x7406;&#xFF0C;&#x66FF;&#x6362;&#x96C6;&#x5408;&#x4F1A;&#x9010;&#x6E10;&#x589E;&#x957F;&#x3002;&#x5F53;&#x6240;&#x6709;&#x7684;&#x7EA6;&#x675F;&#x90FD;&#x88AB;&#x5904;&#x7406;&#x5B8C;&#x540E;&#xFF0C;&#x5408;&#x4E00;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x6700;&#x540E;&#x7684;&#x66FF;&#x6362;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x5408;&#x4E00;&#x5668;&#x68C0;&#x67E5;&#x7B49;&#x5F0F;&#x5DE6;&#x8FB9;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x65F6;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x6D88;&#x9664;&#x4E86;&#xFF0C;&#x5408;&#x4E00;&#x5668;&#x5C06;&#x8BE5;&#x53D8;&#x91CF;&#xFF08;&#x7B49;&#x5F0F;&#xFF09;&#x7684;&#x53F3;&#x4FA7;&#x6DFB;&#x52A0;&#x5230;&#x66FF;&#x6362;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x771F;&#x6B63;&#x5B8C;&#x6210;&#x6D88;&#x9664;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5C06;&#x66FF;&#x6362;&#x96C6;&#x4E2D;&#x6240;&#x6709;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x51FA;&#x73B0;&#x66FF;&#x6362;&#x6210;&#x8BE5;&#x53F3;&#x4FA7;&#x3002;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x8003;&#x8651;&#x6548;&#x7387;&#xFF1B;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x53EF;&#x53D8;&#x503C;&#x8868;&#x793A;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x641C;&#x7D22;&#x2014;&#x66FF;&#x6362;&#x8FC7;&#x7A0B;&#x3002;&#x7136;&#x800C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x56DE;&#x6EAF;&#xFF08;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x9762;&#x786E;&#x5B9E;&#x4F1A;&#x9700;&#x8981;&#xFF09;&#xFF0C;&#x53EF;&#x53D8;&#x503C;&#x8868;&#x793A;&#x4E5F;&#x6709;&#x7F3A;&#x70B9;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x6CE8;&#x610F;&#x5230;&#x4E0A;&#x9762;&#x5FAE;&#x5999;&#x7684;&#x9519;&#x8BEF;&#x4E86;&#x5417;&#xFF1F;</p>
</blockquote>
<p>&#x8FD9;&#x4E2A;&#x5FAE;&#x5999;&#x7684;&#x9519;&#x8BEF;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x5408;&#x4E00;&#x5668;&#x901A;&#x8FC7;&#x66FF;&#x6362;&#x53D8;&#x91CF;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F8B;&#x6765;<strong>&#x6D88;&#x9664;</strong>&#x5B83;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x7B49;&#x5F0F;&#x53F3;&#x4FA7;&#x4E0D;&#x5305;&#x542B;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x4E0D;&#x7136;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F97;&#x5230;&#x5FAA;&#x73AF;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x66FF;&#x6362;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x80FD;&#x3002;&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x5408;&#x4E00;&#x5668;&#x4F1A;&#x8FDB;&#x884C;<strong>&#x51FA;&#x73B0;&#x68C0;&#x67E5;</strong>&#xFF08;occurs check&#xFF09;&#xFF1A;&#x68C0;&#x67E5;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x51FA;&#x73B0;&#x5728;&#x7B49;&#x5F0F;&#x4E24;&#x4FA7;&#xFF0C;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x5219;&#x62D2;&#x7EDD;&#x5408;&#x4E00;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x5176;&#x7EA6;&#x675F;&#x4F1A;&#x89E6;&#x53D1;&#x51FA;&#x73B0;&#x68C0;&#x67E5;&#x7684;&#x9879;&#x3002;</p>
</blockquote>
<p>&#x8FD8;&#x8BB0;&#x5F97;<code>&#x3C9;</code>&#x5417;&#xFF1F;</p>
<p>&#x4E0B;&#x9762;&#x8003;&#x8651;&#x5408;&#x4E00;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x60EF;&#x4F8B;&#x4F7F;&#x7528;&#x5E0C;&#x814A;&#x5B57;&#x6BCD;<code>&#x398;</code>&#x8868;&#x793A;&#x66FF;&#x6362;&#x3002;</p>
<pre><code class="lang-Racket">(define-type-alias Subst (listof Substitution))
(define-type Substitution
  [sub [var : Term] [is : Term]])

(define (unify [cs : (listof Constraints)]) : Subst
  (unify/&#x398; cs empty))
</code></pre>
<p>&#x9996;&#x5148;&#x628A;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x5199;&#x51FA;&#x6765;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;unify/&#x398;&gt; ::=

    (define (unify/&#x398; [cs : (listof Constraints)] [&#x398; : Subst]) : Subst
      (cond
        [(empty? cs) &#x398;]
        [(cons? cs)
         (let ([l (eqCon-lhs (first cs))]
               [r (eqCon-rhs (first cs))])
           (type-case Term l
             &lt;unify/&#x398;-tVar-case&gt;
             &lt;unify/&#x398;-tExp-case&gt;
             &lt;unify/&#x398;-tNum-case&gt;
             &lt;unify/&#x398;-tArrow-case&gt;))]))
</code></pre>
<p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5408;&#x4E00;&#x7684;&#x6838;&#x5FC3;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8F85;&#x52A9;&#x51FD;&#x6570;<code>extend-replace</code>&#xFF0C;&#x5176;&#x7B7E;&#x540D;&#x4E3A;<code>(Term Term Subst -&gt; Subst)</code>&#x3002;&#x5B83;&#x5C06;&#x6267;&#x884C;&#x51FA;&#x73B0;&#x68C0;&#x67E5;&#xFF0C;&#x5982;&#x679C;&#x68C0;&#x67E5;&#x5F97;&#x51FA;&#x6CA1;&#x6709;&#x73AF;&#x8DEF;&#xFF0C;&#x5219;&#x6269;&#x5C55;&#x66FF;&#x6362;&#x96C6;&#x5408;&#xFF0C;&#x5E76;&#x5C06;&#x66FF;&#x6362;&#x96C6;&#x5408;&#x4E2D;&#x6240;&#x6709;&#x51FA;&#x73B0;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x9879;&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF09;&#x66FF;&#x4EE3;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x9879;&#xFF08;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#xFF09;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;<code>lookup: (Term subst -&gt; (optionof Term))</code>&#x5B58;&#x5728;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x5B9A;&#x4E49;<code>extend-replace</code>&#x548C;<code>lookup</code>&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x7EA6;&#x675F;&#x7B49;&#x5F0F;&#x7684;&#x5DE6;&#x4FA7;&#x662F;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x5728;&#x66FF;&#x6362;&#x96C6;&#x5408;&#x4E2D;&#x5BFB;&#x627E;&#x5B83;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F53;&#x524D;&#x7EA6;&#x675F;&#x6362;&#x6210;&#x65B0;&#x7684;&#x7EA6;&#x675F;&#xFF1B;&#x5426;&#x5219;&#x6211;&#x4EEC;&#x6269;&#x5C55;&#x66FF;&#x6362;&#x96C6;&#x5408;&#x3002;</p>
<pre><code class="lang-Racket">&lt;unify/&#x398;-tVar-case&gt; ::=

    [tVar (s) (type-case (optionof Term) (lookup l &#x398;)
                [some (bound)
                      (unify/&#x398; (cons (eqCon bound r)
                                     (rest cs))
                               &#x398;)]
                [none ()
                      (unify/&#x398; (rest cs)
                               (extend+replace l r &#x398;))])]
</code></pre>
<p>&#x540C;&#x6837;&#x7684;&#x903B;&#x8F91;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x60C5;&#x51B5;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;unify/&#x398;-tExp-case&gt; ::=

    [tExp (e) (type-case (optionof Term) (lookup l &#x398;)
                [some (bound)
                      (unify/&#x398; (cons (eqCon bound r)
                                     (rest cs))
                               &#x398;)]
                [none ()
                      (unify/&#x398; (rest cs)
                               (extend+replace l r &#x398;))])]
</code></pre>
<p>&#x5982;&#x679C;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x7B49;&#x5F0F;&#x53F3;&#x8FB9;&#x3002;&#x6709;&#x56DB;&#x79CD;&#x53EF;&#x80FD;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x662F;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x7B49;&#x5F0F;&#x58F0;&#x660E;&#x7C7B;&#x578B;<code>num</code>&#x7B49;&#x4E8E;<code>num</code>&#xFF0C;&#x8FD9;&#x6052;&#x4E3A;&#x771F;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x8BE5;&#x7EA6;&#x675F;&#x2014;&#x2014;&#x5B83;&#x6CA1;&#x6709;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x4EC0;&#x4E48;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x2014;&#x2014;&#x7EE7;&#x7EED;&#x68C0;&#x67E5;&#x5269;&#x4E0B;&#x7684;&#x3002;
&#x5F53;&#x7136;&#xFF0C;&#x9996;&#x5148;&#x5F97;&#x89E3;&#x91CA;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x7EA6;&#x675F;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7EA6;&#x675F;&#x751F;&#x6210;&#x5668;&#x4E0D;&#x4F1A;&#x751F;&#x6210;&#x8FD9;&#x79CD;&#x7EA6;&#x675F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x524D;&#x9762;&#x66FF;&#x6362;&#x96C6;&#x5408;&#x7684;&#x6269;&#x5C55;&#x4F1A;&#x5BFC;&#x81F4;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x4E8B;&#x5B9E;&#x662F;&#x5B9E;&#x8DF5;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x9047;&#x5230;&#x597D;&#x51E0;&#x4E2A;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</li>
<li>&#x5982;&#x679C;&#x662F;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x663E;&#x7136;&#x5B58;&#x5728;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x548C;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x4E0D;&#x76F8;&#x4EA4;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x751F;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x4E00;&#x5B9A;&#x662F;&#x7531;&#x5148;&#x524D;&#x7684;&#x66FF;&#x4EE3;&#x4EA7;&#x751F;&#x3002;</li>
<li>&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x4E24;&#x79CD;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x4E4B;&#x4E00;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x7EA6;&#x675F;&#x751F;&#x6210;&#x5668;&#x7ECF;&#x8FC7;&#x4E86;&#x4ED4;&#x7EC6;&#x7684;&#x5B89;&#x6392;&#xFF0C;&#x4E0D;&#x4F1A;&#x5C06;&#x5B83;&#x4EEC;&#x653E;&#x5728;&#x53F3;&#x4FA7;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x66FF;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E5F;&#x4E0D;&#x4F1A;&#x5728;&#x53F3;&#x4FA7;&#x5F15;&#x5165;&#x5B83;&#x4EEC;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;</li>
</ul>
<p>&#x4E8E;&#x662F;&#x5F97;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-Racket">&lt;unify/&#x398;-tNum-case&gt; ::=

    [tNum () (type-case Term r
               [tNum () (unify/&#x398; (rest cs) &#x398;)]
               [else (error &apos;unify &quot;number and something else&quot;)])]
</code></pre>
<p>&#x6700;&#x540E;&#x8FD8;&#x5269;&#x4E0B;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x8BBA;&#x70B9;&#x51E0;&#x4E4E;&#x548C;&#x6570;&#x7C7B;&#x578B;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x3002;</p>
<pre><code class="lang-Racket">&lt;unify/&#x398;-tArrow-case&gt; ::=

    [tArrow (d r) (type-case Term r
                    [tArrow (d2 r2)
                            (unify/&#x398; (cons (eqCon d d2)
                                           (cons (eqCon r r2)
                                                 cs))
                                     &#x398;)]
                    [else (error &apos;unify &quot;arrow and something else&quot;)])]
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x6CA1;&#x6709;&#x4E25;&#x683C;&#x5730;&#x7F29;&#x5C0F;&#x7EA6;&#x675F;&#x96C6;&#x5408;&#xFF0C;&#x56E0;&#x6B64;&#x4EC5;&#x901A;&#x8FC7;&#x7EA6;&#x675F;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x8DB3;&#x4EE5;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4F1A;&#x7EC8;&#x6B62;&#x3002;&#x9700;&#x8981;&#x540C;&#x65F6;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x7EA6;&#x675F;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x4EE5;&#x53CA;&#x66FF;&#x6362;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x5305;&#x62EC;&#x5176;&#x4E2D;&#x53D8;&#x91CF;&#x7684;&#x4E2A;&#x6570;&#xFF09;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x7B97;&#x6CD5;&#x975E;&#x5E38;&#x901A;&#x7528;&#xFF0C;&#x4E0D;&#x4EC5;&#x5BF9;&#x6570;&#x548C;&#x51FD;&#x6570;&#xFF0C;&#x5BF9;&#x4E8E;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x9879;&#x4E5F;&#x90FD;&#x9002;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x6570;&#x4EE3;&#x8868;&#x5404;&#x79CD;&#x57FA;&#x7840;&#x7C7B;&#x578B;&#xFF1B;&#x540C;&#x6837;&#xFF0C;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x4EE3;&#x8868;&#x5404;&#x79CD;&#x6784;&#x9020;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;<code>listof</code>&#x548C;<code>vectorof</code>&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x5408;&#x4E00;&#x4EA7;&#x751F;&#x4E86;&#x66FF;&#x6362;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x904D;&#x5386;&#x8FD9;&#x4E9B;&#x66FF;&#x6362;&#xFF0C;&#x627E;&#x5230;&#x7A0B;&#x5E8F;&#x4E2D;&#x6240;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x63D2;&#x5165;&#x5BF9;&#x5E94;&#x7684;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#x3002;&#x6709;&#x5B9A;&#x7406;&#xFF08;&#x8FD9;&#x91CC;&#x4E0D;&#x8BC1;&#x660E;&#xFF09;&#x6307;&#x51FA;&#xFF0C;&#x4E0A;&#x9762;&#x8FC7;&#x7A0B;&#x7684;&#x6210;&#x529F;&#x610F;&#x5473;&#x7740;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x4E86;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x5BF9;&#x8BE5;&#x7A0B;&#x5E8F;&#x663E;&#x5F0F;&#x5730;&#x518D;&#x8DD1;&#x4E00;&#x904D;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x7684;&#x6027;&#x8D28;&#x5728;&#x8FD9;&#x91CC;&#x53D1;&#x751F;&#x4E86;&#x5DE8;&#x5927;&#x53D8;&#x5316;&#x3002;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9012;&#x5F52;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x5229;&#x7528;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#x904D;&#x5386;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x7C7B;&#x578B;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x7ED1;&#x5B9A;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x88AB;&#x5F53;&#x4F5C;&#xFF08;&#x671F;&#x671B;&#x7684;&#xFF09;&#x6743;&#x5A01;&#x7684;&#x7C7B;&#x578B;<strong>&#x89C4;&#x8303;</strong>&#xFF08;specification&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x9519;&#x8BEF;&#x90FD;&#x5E94;&#x5F52;&#x548E;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x7684;&#x62A5;&#x544A;&#x5F88;&#x7B80;&#x5355;&#xFF08;&#x800C;&#x4E14;&#x5F88;&#x597D;&#x61C2;&#xFF09;&#x3002;&#x7136;&#x800C;&#x8FD9;&#x91CC;&#xFF0C;&#x7C7B;&#x578B;&#x9519;&#x8BEF;<strong>&#x65E0;&#x6CD5;&#x901A;&#x77E5;</strong>&#x3002;&#x5408;&#x4E00;&#x9519;&#x8BEF;&#x662F;&#x4E24;&#x4E2A;&#x667A;&#x80FD;&#x7B97;&#x6CD5;&#x2014;&#x2014;&#x7EA6;&#x675F;&#x751F;&#x6210;&#x548C;&#x5408;&#x4E00;&#x2014;&#x2014;&#x5171;&#x540C;&#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x7406;&#x89E3;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x7EA6;&#x675F;&#x7684;&#x672C;&#x8D28;&#x662F;&#x7B49;&#x5F0F;&#xFF0C;&#x62A5;&#x544A;&#x7684;&#x9519;&#x8BEF;&#x4F4D;&#x7F6E;&#x548C;&#x201C;&#x771F;&#x5B9E;&#x201D;&#x7684;&#x9519;&#x8BEF;&#x4F4D;&#x7F6E;&#x53EF;&#x80FD;&#x76F8;&#x5DEE;&#x751A;&#x8FDC;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x751F;&#x6210;&#x66F4;&#x597D;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x4ECD;&#x7136;&#x662F;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x3002;</p>
<blockquote>
<p>&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x7B97;&#x6CD5;&#x4F1A;&#x7EF4;&#x62A4;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x7A0B;&#x5E8F;&#x6E90;&#x7801;&#x7684;&#x5143;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x4E5F;&#x4F1A;&#x4FDD;&#x5B58;&#x5408;&#x4E00;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x4EE5;&#x4FBF;&#x6EAF;&#x6E90;&#x9519;&#x8BEF;&#x56DE;&#x6E90;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<p>&#x6700;&#x540E;&#xFF0C;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x7EA6;&#x675F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x7CBE;&#x786E;&#x6307;&#x660E;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x65B9;&#x7A0B;&#x7EC4;<strong>&#x8FC7;&#x5EA6;</strong>&#x7EA6;&#x675F;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x51B2;&#x7A81;&#xFF0C;&#x5BFC;&#x81F4;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;<strong>&#x7F3A;&#x5C11;</strong>&#x7EA6;&#x675F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x6240;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x505A;&#x51FA;&#x660E;&#x786E;&#x7684;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;<code>(lambda (x) x)</code>&#xFF0C;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7EA6;&#x675F;&#x6307;&#x660E;<code>x</code>&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x4ECE;&#x800C;&#x65E0;&#x6CD5;&#x4EE5;&#x6307;&#x660E;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x5E76;&#x975E;&#x9519;&#x8BEF;&#xFF1B;&#x5B83;&#x53EA;&#x662F;&#x610F;&#x5473;&#x7740;<code>x</code>&#x53EF;&#x4EE5;&#x662F;<strong>&#x4EFB;&#x610F;</strong>&#x7C7B;&#x578B;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8BE5;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x201C;<code>x</code>&#x7684;&#x7C7B;&#x578B;-&gt;<code>x</code>&#x7684;&#x7C7B;&#x578B;&#x201D;&#xFF0C;&#x65E0;&#x5176;&#x5B83;&#x7EA6;&#x675F;&#x3002;&#x8FD9;&#x4E9B;&#x6B20;&#x7EA6;&#x675F;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x7C7B;&#x578B;&#x4EE5;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x5C55;&#x793A;&#xFF0C;&#x4E8E;&#x662F;&#x4E0A;&#x9762;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;<code>(&apos;a -&gt; &apos;a)</code>&#x3002;</p>
<p>&#x5408;&#x4E00;&#x7B97;&#x6CD5;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5C5E;&#x6027;&#xFF1A;&#x5B83;&#x80FD;&#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x8868;&#x8FBE;&#x5F0F;<strong>&#x6700;&#x901A;&#x7528;&#x7684;&#x7C7B;&#x578B;</strong>&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x4E3B;&#x7C7B;&#x578B;</strong>&#xFF08;principal type&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x6709;&#x7684;&#x4EFB;&#x4F55;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#xFF08;&#x7528;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#xFF09;&#x66FF;&#x6362;&#x63A8;&#x5BFC;&#x51FA;&#x7684;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x7684;&#x5F97;&#x5230;&#x3002;&#x8FD9;&#x662F;&#x4E2A;&#x5F02;&#x4E4E;&#x5BFB;&#x5E38;&#x7684;&#x7ED3;&#x679C;&#xFF1A;&#x6CA1;&#x4EBA;&#x80FD;&#x751F;&#x6210;&#x6BD4;&#x524D;&#x8FF0;&#x7B97;&#x6CD5;&#x5F97;&#x51FA;&#x7684;&#x66F4;&#x4E3A;&#x4E00;&#x822C;&#x7684;&#x7C7B;&#x578B;&#xFF01;</p>
<h4 id="15323-let-&#x591A;&#x6001;">15.3.2.3 Let-&#x591A;&#x6001;</h4>
<p>&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x8868;&#x9762;&#x4E0A;&#x770B;&#x548C;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x9047;&#x5230;&#x7684;&#x591A;&#x6001;&#x6709;&#x8BF8;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x540C;&#x3002;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<pre><code class="lang-Racket">(let ([id (lambda (x) x)])
  (if (id true)
      (id 5)
      (id 6)))
</code></pre>
<p>&#x5982;&#x679C;&#x52A0;&#x4E0A;&#x663E;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#xFF0C;&#x5B83;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF1A;</p>
<pre><code class="lang-Racket">(if ((id boolean) true)
    ((id number) 5)
    ((id number) 6))
</code></pre>
<p>&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x63A8;&#x65AD;&#xFF0C;&#x5B83;&#x5C06;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF01;&#x56E0;&#x4E3A;<code>id</code>&#x4E2D;&#x7684;&#x7C7B;&#x578B;<code>&apos;a</code>&#x2014;&#x2014;&#x53D6;&#x51B3;&#x4E8E;&#x7EA6;&#x675F;&#x5904;&#x7406;&#x7684;&#x987A;&#x5E8F;&#x2014;&#x2014;&#x8981;&#x4E48;&#x548C;<code>boolean</code>&#x5408;&#x4E00;&#xFF0C;&#x8981;&#x4E48;&#x548C;<code>number</code>&#x5408;&#x4E00;&#x3002;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x90A3;&#x65F6;<code>id</code>&#x7684;&#x7C7B;&#x578B;&#x8981;&#x4E48;&#x662F;<code>(boolean -&gt; boolean)</code>&#x8981;&#x4E48;&#x662F;<code>(number -&gt; number)</code>&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x8C03;&#x7528;<code>id</code>&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF01;</p>
<p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5408;&#x4E00;&#x63A8;&#x65AD;&#x51FA;&#x6765;&#x7684;&#x7C7B;&#x578B;&#x5B9E;&#x9645;&#x5E76;&#x4E0D;&#x662F;<strong>&#x591A;&#x6001;&#x7684;</strong>&#x3002;&#x8FD9;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF1A;&#x5C06;&#x5176;&#x79F0;&#x4E3A;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x4E0D;&#x4F1A;&#x4F7F;&#x4F60;&#x83B7;&#x5F97;&#x591A;&#x6001;!&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x6B21;&#x4F7F;&#x7528;&#x65F6;&#x5408;&#x4E00;&#xFF0C;&#x5F7C;&#x65F6;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x8FD8;&#x53EA;&#x662F;&#x5355;&#x6001;&#x51FD;&#x6570;&#x3002;&#x800C;&#x771F;&#x6B63;&#x7684;&#x591A;&#x6001;&#x53EA;&#x6709;&#x5728;&#x80FD;&#x771F;&#x6B63;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x53D8;&#x91CF;<strong>&#x5B9E;&#x4F8B;&#x5316;</strong>&#x65F6;&#x624D;&#x4F1A;&#x83B7;&#x5F97;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x5728;&#x5177;&#x6709;&#x771F;&#x6B63;&#x591A;&#x6001;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7EA6;&#x675F;&#x751F;&#x6210;&#x548C;&#x5408;&#x4E00;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x50CF;ML&#x548C;Haskell&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x751A;&#x81F3;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E5F;&#x662F;&#xFF0C;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;&#x4FD7;&#x79F0;<strong>let-&#x591A;&#x6001;</strong>&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x4E2D;&#xFF0C;&#x5F53;&#x5305;&#x542B;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x7684;&#x9879;&#x5728;&#x8BCD;&#x6CD5;&#x73AF;&#x5883;&#x4E2D;&#x88AB;&#x7ED1;&#x5B9A;&#x65F6;&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x88AB;&#x81EA;&#x52A8;&#x63D0;&#x5347;&#x4E3A;&#x91CF;&#x5316;&#x7C7B;&#x578B;&#x3002;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x8BE5;&#x9879;&#x88AB;&#x81EA;&#x52A8;&#x5B9E;&#x4F8B;&#x5316;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x5B9E;&#x73B0;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8FD9;&#x70B9;&#x3002;&#x6700;&#x7B80;&#x5355;&#xFF08;&#x800C;&#x4E0D;&#x4EE4;&#x4EBA;&#x6EE1;&#x610F;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x53EA;&#x9700;<strong>&#x590D;&#x5236;</strong>&#x7ED1;&#x5B9A;&#x6807;&#x8BC6;&#x7B26;&#x4EE3;&#x7801;&#x7684;<strong>&#x4EE3;&#x7801;</strong>&#xFF1B;&#x8FD9;&#x6837;&#xFF0C;&#x4E0A;&#x9762;&#x6BCF;&#x6B21;<code>id</code>&#x7684;&#x4F7F;&#x7528;&#x90FD;&#x4F1A;&#x5F97;&#x5230;&#x81EA;&#x5DF1;&#x7684;<code>(lambda (x) x)</code>&#x526F;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E2A;&#x90FD;&#x6709;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x80FD;&#x662F;<code>(&apos;a -&gt; &apos;a)</code>&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;<code>(&apos;b -&gt; &apos;b)</code>&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x662F;<code>(&apos;c -&gt; &apos;c)</code>&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x4E92;&#x4E0D;&#x51B2;&#x7A81;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x591A;&#x6001;&#x7684;&#x6548;&#x679C;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x4E0D;&#x4EC5;&#x589E;&#x52A0;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x5B58;&#x5728;&#x9012;&#x5F52;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x901A;&#x5F80;&#x66F4;&#x597D;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x601D;&#x8DEF;&#xFF1A;&#x4E0D;&#x662F;&#x590D;&#x5236;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x662F;&#x590D;&#x5236;<strong>&#x7C7B;&#x578B;</strong>&#x3002;&#x56E0;&#x6B64;&#x5728;&#x6BCF;&#x6B21;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x63A8;&#x5BFC;&#x51FA;&#x7C7B;&#x578B;&#x7684;&#x91CD;&#x547D;&#x540D;&#x7248;&#x672C;&#xFF1A;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;id&#x7684;&#x7C7B;&#x578B;<code>(&apos;a -&gt; &apos;a)</code>&#x53D8;&#x6210;&#x4E86;<code>(&apos;b -&gt; &apos;b)</code>&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x4E86;&#x62F7;&#x8D1D;&#x4EE3;&#x7801;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#x4E14;&#x6CA1;&#x6709;&#x5B83;&#x7684;&#x5305;&#x88B1;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x5B9E;&#x8D28;&#x90FD;&#x662F;&#x6548;&#x4EFF;&#x4EE3;&#x7801;&#x62F7;&#x8D1D;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x53EA;&#x80FD;&#x5728;&#x8BCD;&#x6CD5;&#x73AF;&#x5883;&#x4E0B;&#x5DE5;&#x4F5C;&#x3002;</p>
<h3 id="1533-&#x8054;&#x5408;&#x7C7B;&#x578B;">15.3.3 &#x8054;&#x5408;&#x7C7B;&#x578B;</h3>
<p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8981;&#x5EFA;&#x7ACB;&#x52A8;&#x7269;&#x56ED;&#x52A8;&#x7269;&#x7684;&#x94FE;&#x8868;&#xFF0C;&#x52A8;&#x7269;&#x6709;&#x8FD9;&#x4E9B;&#x79CD;&#x7C7B;&#xFF1A;&#x72B0;&#x72F3;&#x3001;&#x7EA2;&#x5C3E;&#x86BA;&#x7B49;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type Animal
  [armadillo (alive? : boolean)] ;&#x72B0;&#x72F3;
  [boa (length : number)]) ;&#x86BA;
</code></pre>
<blockquote>
<p>&#x201C;&#x5728;&#x5FB7;&#x5DDE;&#xFF0C;&#x9A6C;&#x8DEF;&#x4E2D;&#x95F4;&#x9664;&#x4E86;&#x9EC4;&#x7EBF;&#x548C;&#x6B7B;&#x6389;&#x7684;&#x72B0;&#x72F3;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x201D; &#x2014;&#x2014; Jim Hightower</p>
</blockquote>
<p>&#x7136;&#x540E;&#x521B;&#x5EFA;&#x5B83;&#x7684;&#x94FE;&#x8868;&#xFF1A;<code>(listof Animal)</code>&#x3002;&#x56E0;&#x6B64;&#xFF0C;<code>Animal</code>&#x7C7B;&#x578B;&#x8868;&#x793A;&#x7684;&#x662F;<code>armadillo</code>&#x548C;<code>boa</code>&#x7684;&#x201C;&#x8054;&#x5408;&#xFF08;&#x6216;&#x79F0;&#x8054;&#x5408;&#x4F53;&#xFF0C;union&#xFF09;&#x201D;&#xFF0C;&#x4E0D;&#x8FC7;&#x8981;&#x521B;&#x5EFA;&#x8FD9;&#x79CD;&#x8054;&#x5408;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x5F0F;&#x662F;&#x6BCF;&#x6B21;&#x90FD;&#x521B;&#x5EFA;&#x65B0;&#x7C7B;&#x578B;&#xFF1A;&#x6BD4;&#x5982;&#x8981;&#x521B;&#x5EFA;&#x52A8;&#x7269;&#x548C;&#x690D;&#x7269;&#x7684;&#x8054;&#x5408;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type LivingThings
  [animal (a : Animal)]
  [plant (p : Plant)])
</code></pre>
<p>&#x8FD9;&#x6837;&#x5B9E;&#x9645;&#x7684;&#x52A8;&#x7269;&#x73B0;&#x5728;&#x88F9;&#x5728;&#x4E86;&#x66F4;&#x6DF1;&#x4E00;&#x201C;&#x5C42;&#x201D;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x8054;&#x5408;</strong>&#xFF08;tagged union&#xFF09;&#x6216;<strong>&#x53EF;&#x8FA8;&#x8BC6;&#x7684;&#x8054;&#x5408;</strong>&#xFF08;discriminated union&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x5F15;&#x5165;&#x7C7B;&#x4F3C;<code>animal</code>&#x548C;<code>plant</code>&#x7684;&#x6807;&#x7B7E;&#xFF08;&#x6216;&#x79F0;<strong>&#x8FA8;&#x8BC6;&#x7B26;</strong>(discriminator)&#xFF09;&#x6765;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#x3002;&#x76F8;&#x5E94;&#x5730;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x6765;&#x5B9A;&#x4E49;&#xFF1B;&#x8981;&#x521B;&#x5EFA;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x79CD;&#x53D8;&#x4F53;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5982;</p>
<pre><code class="lang-Racket">(define-type Constraints
  [eqCon (lhs : Term) (rhs : Term)])
</code></pre>
<p>&#x6765;&#x8868;&#x793A;&#x8BE5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7C7B;&#x578B;<code>Constraints</code>&#x800C;&#x4E0D;&#x662F;<code>eqCons</code>&#xFF0C;&#x56E0;&#x4E3A;<code>eqCons</code>&#x4E0D;&#x662F;&#x7C7B;&#x578B;&#xFF0C;&#x53EA;&#x662F;&#x80FD;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x533A;&#x5206;&#x7684;&#x7C7B;&#x578B;&#x53D8;&#x4F53;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x8981;&#x70B9;&#x662F;&#x8868;&#x793A;&#x6790;&#x53D6;&#x6216;&#x201C;&#x6216;&#x201D;&#x3002;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x8054;&#x5408;&#x4E2D;&#x67D0;&#x4E2A;&#x7C7B;&#x578B;&#x3002;&#x503C;&#x901A;&#x5E38;&#x53EA;&#x80FD;&#x662F;&#x8054;&#x5408;&#x4E2D;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x7CBE;&#x786E;&#x5B9A;&#x4E49;&#x3001;&#x89C4;&#x8303;&#x5B83;&#x4EEC;&#x7684;&#x89C4;&#x5219;&#x7B49;&#x7B49;&#x3002;</p>
<h4 id="15331-&#x4F5C;&#x4E3A;&#x7C7B;&#x578B;&#x7684;&#x7ED3;&#x6784;&#x4F53;">15.3.3.1 &#x4F5C;&#x4E3A;&#x7C7B;&#x578B;&#x7684;&#x7ED3;&#x6784;&#x4F53;</h4>
<p>&#x5BF9;&#x6B64;&#x81EA;&#x7136;&#x7684;&#x53CD;&#x5E94;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x79FB;&#x9664;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x72EC;&#x7ACB;&#x5B58;&#x5728;&#xFF0C;&#x5C06;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x4E9B;&#x7ED3;&#x6784;&#x4F53;&#x7684;&#x96C6;&#x5408;&#xFF1F;&#x6BD5;&#x7ADF;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;C&#x8FD8;&#x662F;Racket&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x72EC;&#x7ACB;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x65E0;&#x9700;&#x4F7F;&#x7528;&#x6807;&#x7B7E;&#x6784;&#x9020;&#x51FD;&#x6570;&#x5C06;&#x5B83;&#x4EEC;&#x5305;&#x88F9;&#x5728;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x91CC;&#xFF01;&#x4F8B;&#x5982;&#xFF0C;Racket&#x91CC;&#x53EF;&#x4EE5;&#x5199;&#xFF1A;</p>
<pre><code class="lang-Racket">(struct armadillo (alive?))
(struct boa (length))
</code></pre>
<p>&#x52A0;&#x4E2A;&#x6CE8;&#x91CA;&#xFF1A;</p>
<pre><code class="lang-Racket">;; &#x52A8;&#x7269;&#x662F;&#x4E0B;&#x9762;&#x4E24;&#x8005;&#x4E4B;&#x4E00;&#xFF1A;
;; - (armadillo &lt;boolean&gt;)
;; - (boa &lt;number&gt;)
</code></pre>
<p>&#x4F46;&#x662F;&#x7531;&#x4E8E;Racket&#x4E0D;&#x5F3A;&#x5236;&#x9759;&#x6001;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x79CD;&#x6BD4;&#x8F83;&#x4E0D;&#x592A;&#x6E05;&#x695A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x548C; <em>Typed Racket</em> &#xFF08;&#x5185;&#x7F6E;&#x4E0E;DrRacket&#x4E2D;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;Racket&#xFF09;&#x76F8;&#x6BD4;&#x8F83;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5BF9;&#x5E94;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-Racket">#lang typed/racket

(struct: armadillo ([alive? : Boolean]))
(struct: boa ([length : Real])) ;; feet
</code></pre>
<p>&#x65E0;&#x9700;&#x5F15;&#x7528;<code>armadillo</code>&#x5C31;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4F7F;&#x7528;<code>boa</code>&#x7C7B;&#x578B;&#x503C;&#x7684;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">;; http://en.wikipedia.org/wiki/Boa_constrictor#Size_and_weight
(define: (big-one? [b : boa]) : Boolean
  (&gt; (boa-length b) 8))
</code></pre>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x8C03;&#x7528;&#x6B64;&#x51FD;&#x6570;&#x65F6;&#x4F20;&#x5165;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#xFF0C;&#x5982;<code>armadillo</code>&#x2014;&#x2014;<code>(big-one? (armadillo true))</code>&#x2014;&#x2014;&#x5C06;&#x53D1;&#x751F;<strong>&#x9759;&#x6001;</strong>&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x4E3A;<code>armadillo</code>&#x548C;<code>boa</code>&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x7B49;&#x540C;&#x4E0E;&#x6570;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x8054;&#x5408;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type Animal (U armadillo boa))
</code></pre>
<p>&#x5728;&#x8FD9;&#x4E4B;&#x4E0A;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-Racket">(define: (safe-to-transport? [a : Animal]) : Boolean
  (cond
    [(boa? a) (not (big-one? a))]
    [(armadillo? a) (armadillo-alive? a)]))
</code></pre>
<p>&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x6709;<strong>&#x4E00;&#x79CD;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x53D8;&#x4F53;&#x7684;&#x7C7B;&#x578B;</strong>&#xFF0C;&#x73B0;&#x5728;&#x5219;&#x6709;<strong>&#x4E09;&#x79CD;&#x7C7B;&#x578B;</strong>&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x6070;&#x5DE7;&#x80FD;&#x65B9;&#x4FBF;&#x7684;&#x901A;&#x8FC7;&#x8054;&#x5408;&#x5B9A;&#x4E49;&#x7B2C;&#x4E09;&#x79CD;&#x3002;</p>
<h4 id="15332-&#x65E0;&#x6807;&#x7B7E;&#x8054;&#x5408;">15.3.3.2 &#x65E0;&#x6807;&#x7B7E;&#x8054;&#x5408;</h4>
<p>&#x770B;&#x8D77;&#x6765;&#x6211;&#x4EEC;&#x597D;&#x50CF;&#x8FD8;&#x9700;&#x8981;&#x8FA8;&#x8BC6;&#x6807;&#x7B7E;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;&#x5728;&#x652F;&#x6301;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x8FD9;&#x6837;&#x83B7;&#x53D6;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x5668;<code>optionof</code>&#xFF1A;&#x5C06;&#x671F;&#x671B;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x548C;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x5931;&#x8D25;&#x6216;&#x8005;<code>none</code>&#x7684;&#x7C7B;&#x578B;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x662F;<code>(optionof number)</code>&#x7684;&#x7B49;&#x4EF7;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type MaybeNumber (U Number Boolean))
</code></pre>
<p>&#x540C;&#x65F6;&#xFF0C;<code>Boolean</code>&#x672C;&#x8EAB;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;<code>True</code>&#x548C;<code>False</code>&#x7684;&#x8054;&#x5408;&#xFF0C;&#x5728;Typed Racket&#x4E2D;&#x4E5F;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9009;&#x62E9;&#xFF08;option&#xFF09;&#x7C7B;&#x578B;&#x66F4;&#x4E3A;&#x51C6;&#x786E;&#x7684;&#x6A21;&#x62DF;&#x5B9E;&#x73B0;&#x5E94;&#x8BE5;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">(define-type MaybeNumber (U Number False))
</code></pre>
<p>&#x66F4;&#x4E3A;&#x4E00;&#x822C;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Racket">(struct: none ())
(define-type (Maybeof T) (U T none))
</code></pre>
<p>&#x7531;&#x4E8E;&#x7531;&#x4E8E;<code>none</code>&#x662F;&#x65B0;&#x7684;&#x3001;&#x72EC;&#x7279;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x4E0D;&#x4F1A;&#x548C;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x6DF7;&#x6DC6;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x5B9A;&#x4E49;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x7C7B;&#x578B;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x7ED9;&#x6211;&#x4EEC;&#x4E0E;&#x9009;&#x62E9;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x4E14;&#x6211;&#x4EEC;&#x7684;&#x503C;&#x6CA1;&#x6709;&#x88AB;&#x57CB;&#x5165;&#x6DF1;&#x4E00;&#x5C42;&#x7684;<code>some</code>&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x800C;&#x662F;&#x7ACB;&#x5373;&#x53EF;&#x7528;&#x3002;&#x4F8B;&#x5982;<code>member</code>&#xFF0C;&#x5176;Typed Racket&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">(All (a) (a (Listof a) -&gt; (U False (Listof a))))
</code></pre>
<p>&#x5982;&#x679C;&#x5143;&#x7D20;&#x672A;&#x627E;&#x5230;&#xFF0C;<code>member</code>&#x8FD4;&#x56DE;<code>false</code>&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x4ECE;&#x8BE5;&#x5143;&#x7D20;&#x5F00;&#x59CB;&#x7684;&#x94FE;&#x8868;&#xFF08;&#x5373;&#xFF0C;&#x94FE;&#x8868;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x662F;&#x671F;&#x671B;&#x7684;&#x5143;&#x7D20;&#xFF09;&#x3002;</p>
<pre><code class="lang-Racket">&gt; (member 2 (list 1 2 3))
&apos;(2 3)
</code></pre>
<p>&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x4F7F;&#x7528;<code>Maybeof</code>&#x5B9E;&#x73B0;&#xFF0C;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#xFF1A;</p>
<pre><code class="lang-Racket">(define: (t) (in-list? [e : t] [l : (Listof t)]) : (Maybeof (Listof t))
  (let ([v [member e l]])
    (if v
        v
        (none))))
</code></pre>
<p>&#x5982;&#x679C;&#x5143;&#x7D20;&#x672A;&#x627E;&#x5230;&#xFF0C;&#x5B83;&#x5C06;&#x8FD4;&#x56DE;&#x503C;<code>(none)</code>&#xFF1B;&#x5982;&#x679C;&#x627E;&#x5230;&#x4E86;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x8FD4;&#x56DE;&#x94FE;&#x8868;&#xFF1A;</p>
<pre><code class="lang-Racket">&gt; (in-list? 2 (list 1 2 3))
&apos;(2 3)
</code></pre>
<p>&#x8FD9;&#x6837;&#x5C31;&#x65E0;&#x9700;&#x4ECE;<code>some</code>&#x5BB9;&#x5668;&#x4E2D;&#x53D6;&#x51FA;&#x94FE;&#x8868;&#x3002;</p>
<h4 id="15333-&#x8FA8;&#x8BC6;&#x65E0;&#x6807;&#x7B7E;&#x8054;&#x5408;">15.3.3.3 &#x8FA8;&#x8BC6;&#x65E0;&#x6807;&#x7B7E;&#x8054;&#x5408;</h4>
<p>&#x5C06;&#x503C;&#x653E;&#x5165;&#x8054;&#x5408;&#x662F;&#x4E00;&#x7801;&#x4E8B;&#xFF1B;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x5982;&#x4F55;&#x4EE5;&#x7C7B;&#x578B;&#x826F;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x5C06;&#x503C;&#x4ECE;&#x5176;&#x4E2D;&#x53D6;&#x51FA;&#x6765;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7C7B;ML&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7A0B;&#x5F0F;&#x5316;&#x7684;&#x7B26;&#x53F7;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x8A00;&#x4E2D;<code>type-case</code>&#xFF0C;ML&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x2014;&#x2014;&#x6765;&#x6807;&#x8BC6;&#x548C;&#x53D6;&#x51FA;&#x5404;&#x90E8;&#x5206;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-Racket">(define (safe-to-transport? [a : Animal]) : boolean
  (type-case Animal a
             [armadillo (a?) a?]
             [boa (l) (not (big-one? l))]))
</code></pre>
<p>&#x5728;&#x6574;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;<code>a</code>&#x7684;&#x7C7B;&#x578B;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x6807;&#x8BC6;&#x7B26;<code>a?</code>&#x548C;<code>l</code>&#x5206;&#x522B;&#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x5E03;&#x5C14;&#x7C7B;&#x578B;&#x548C;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x4E0A;&#xFF0C;<code>big-one?</code>&#x63A5;&#x6536;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>armadillo</code>&#x548C;<code>boa</code>&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;<code>big-one?</code>&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x7C7B;&#x578B;&#x4E0D;&#x53EF;&#x4EE5;&#x662F;<code>boa</code>&#xFF0C;&#x56E0;&#x4E3A;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x53CD;&#x4E4B;&#xFF0C;&#x4F7F;&#x7528;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x4EEC;&#x786E;&#x5B9E;&#x6709;<code>boa</code>&#x7C7B;&#x578B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9075;&#x5B88;&#x5BF9;&#x503C;&#x8FDB;&#x884C;&#x8C13;&#x8BCD;&#x64CD;&#x4F5C;&#x5C06;<strong>&#x7F29;&#x5C0F;&#x5176;&#x7C7B;&#x578B;</strong>&#x7684;&#x539F;&#x5219;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;<code>cond</code>&#x7684;&#x5B50;&#x53E5;</p>
<pre><code class="lang-Racket">[(boa? a) (not (big-one? a))]
</code></pre>
<p>&#x4E2D;&#xFF0C;&#x5C3D;&#x7BA1;<code>a</code>&#x7684;&#x521D;&#x59CB;&#x7C7B;&#x578B;&#x4E3A;<code>Animal</code>&#xFF0C;&#x5728;&#x901A;&#x8FC7;<code>boa?</code>&#x6D4B;&#x8BD5;&#x540E;&#xFF0C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4F1A;&#x5C06;&#x5176;&#x7C7B;&#x578B;&#x7F29;&#x5C0F;&#x5230;<code>boa</code>&#x7684;&#x5206;&#x652F;&#xFF0C;&#x8FD9;&#x6837;<code>big-one?</code>&#x8C03;&#x7528;&#x5F97;&#x4EE5;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x5176;&#x5728;&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x7C7B;&#x578B;<strong>&#x4E0D;&#x662F;</strong> <code>boa</code>&#x2014;&#x2014;&#x8FD9;&#x91CC;&#xFF0C;&#x53EA;&#x5269;&#x4E0B;<code>armadillo</code>&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x3002;&#x8FD9;&#x7ED9;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x63D0;&#x51FA;&#x4E86;&#x66F4;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x80FD;&#x6D4B;&#x8BD5;&#x5E76;&#x8BC6;&#x522B;&#x7279;&#x5B9A;&#x6A21;&#x5F0F;&#xFF08;&#x79F0;&#x4E3A;<strong>&#x6761;&#x4EF6;&#x5206;&#x5272;</strong>(if-splitting)&#xFF09;&#xFF1B;&#x7F3A;&#x4E86;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x5C31;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x7F16;&#x7A0B;&#xFF1B;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53EA;&#x8BC6;&#x522B;&#x7C7B;ML&#x7CFB;&#x7EDF;&#x4E2D;&#x80FD;&#x8BC6;&#x522B;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3001;<code>type-case</code>&#x3002;</p>
<h4 id="15334-&#x6539;&#x9020;&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;">15.3.3.4 &#x6539;&#x9020;&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;</h4>
<p>&#x6BEB;&#x4E0D;&#x5947;&#x602A;&#xFF0C;Typed Racket&#x4F7F;&#x7528;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x3002;&#x5F53;&#x5C06;&#x73B0;&#x6709;&#x8BED;&#x8A00;&#x6539;&#x9020;&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x5C24;&#x5176;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x6709;&#x8BED;&#x8A00;&#xFF08;&#x5982;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x4E2D;&#xFF09;&#x7684;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x7528;&#x7C7B;ML&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x5219;&#x6765;&#x5B9A;&#x4E49;&#x3002;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x6539;&#x9020;&#x7684;&#x901A;&#x7528;&#x7684;&#x539F;&#x5219;&#x4E4B;&#x4E00;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x9759;&#x6001;&#x6355;&#x83B7;&#x52A8;&#x6001;&#x5F02;&#x5E38;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x68C0;&#x67E5;&#x5668;&#x6700;&#x7EC8;&#x4F1A;&#x8BA9;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5B83;&#x62D2;&#x7EDD;&#x592A;&#x591A;&#x53EF;&#x4EE5;&#x65E0;&#x9519;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x91C7;&#x7528;&#x5B83;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x9700;&#x8981;&#x4EE5;&#x66F4;&#x4E3A;&#x6FC0;&#x8FDB;&#x7684;&#x65B9;&#x5F0F;&#x63A5;&#x53D7;&#x8BE5;&#x8BED;&#x8A00;&#x4E2D;&#x88AB;&#x8BA4;&#x4E3A;&#x5408;&#x7406;&#x7684;&#x4E60;&#x60EF;&#x7528;&#x6CD5;&#x3002;</p>
<blockquote>
<p>&#x9664;&#x975E;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x79F0;&#x4E3A;<strong>&#x8F6F;&#x7C7B;&#x578B;</strong>&#xFF08;soft typing&#xFF09;&#x7684;&#x6709;&#x8DA3;&#x60F3;&#x6CD5;&#xFF1A;&#x4E0D;&#x62D2;&#x7EDD;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x662F;&#x63D0;&#x4F9B;&#x4FE1;&#x606F;&#x544A;&#x77E5;&#x7A0B;&#x5E8F;&#x4E2D;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x4E4B;&#x5904;&#x3002;</p>
</blockquote>
<p>&#x8003;&#x8651;&#x4E0B;&#x9762;&#x7684;JavaScript&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> slice = <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">arr, start, stop</span>) </span>{
  <span class="hljs-keyword">var</span> result = [];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt;= stop - start; i++) {
      result[i] = arr[start + i];
  }
  <span class="hljs-keyword">return</span> result;
}
</code></pre>
<p>&#x5B83;&#x8BFB;&#x5165;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x548C;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;&#x8FD4;&#x56DE;&#x8FD9;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#x4E4B;&#x95F4;&#x7684;&#x5B50;&#x6570;&#x7EC4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>slice([5, 7, 11, 13], 0, 2)</code>&#x6C42;&#x5F97;<code>[5, 7, 11]</code>&#x3002;</p>
<p>&#x5728;JavaScript&#x4E2D;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x7684;&#x7701;&#x7565;&#x4EFB;&#x610F;&#x6216;&#x8005;&#x6240;&#x6709;&#x5C3E;&#x90E8;&#x53C2;&#x6570;&#x3002;&#x6BCF;&#x4E2A;&#x88AB;&#x7701;&#x7565;&#x7684;&#x53C2;&#x6570;&#x90FD;&#x88AB;&#x8D4B;&#x4E88;&#x7279;&#x5B9A;&#x503C;<code>undefined</code>&#xFF0C;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x60C5;&#x5F62;&#x5B8C;&#x5168;&#x7531;&#x51FD;&#x6570;&#x51B3;&#x5B9A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>slice</code>&#x7684;&#x5178;&#x578B;&#x5B9E;&#x73B0;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x7701;&#x7565;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF1B;&#x4E0B;&#x9762;&#x7684;&#x5B9A;&#x4E49;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> slice = <span class="hljs-function"><span class="hljs-keyword">function</span> (<span class="hljs-params">arr, start, stop</span>) </span>{
  <span class="hljs-keyword">if</span> (<span class="hljs-keyword">typeof</span> stop == <span class="hljs-string">&quot;undefined&quot;</span>)
    stop = arr.length - <span class="hljs-number">1</span>;
  <span class="hljs-keyword">var</span> result = [];
  <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt;= stop - start; i++) {
    result[i] = arr[start + i];
  }
  <span class="hljs-keyword">return</span> result;
}
</code></pre>
<p>&#x5728;&#x672A;&#x7ED9;&#x5B9A;&#x7B2C;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x65F6;&#x81EA;&#x52A8;&#x8FD4;&#x56DE;&#x5230;&#x6570;&#x7EC4;&#x7ED3;&#x5C3E;&#x7684;&#x5B50;&#x6570;&#x7EC4;&#xFF1A;&#x56E0;&#x6B64;<code>slice([5, 7, 11, 13], 2)</code>&#x8FD4;&#x56DE;<code>[11, 13]</code>&#x3002;</p>
<p>&#x5728;Typed JavaScript&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E3A;&#x7ED9;&#x5B9A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x7C7B;&#x578B;<code>U Undefined</code>&#x6765;&#x663E;&#x5F0F;&#x5730;&#x6307;&#x660E;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x66F4;&#x5C11;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x6B64;&#x51FD;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-js">&#x2200; t : (<span class="hljs-built_in">Array</span>[t] * Int * (Int U Undefined) -&gt; <span class="hljs-built_in">Array</span>[t])
</code></pre>
<blockquote>
<p>&#x7531;Arjun Guha&#x7B49;&#x4EBA;&#x5728;&#x5E03;&#x6717;&#xFF08;&#x5927;&#x5B66;&#xFF09;&#x521B;&#x5EFA;&#x3002;&#x53C2;&#x89C1;<a href="http://www.jswebtools.org/" target="_blank">&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7AD9;</a>&#x3002;</p>
</blockquote>
<p>&#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8868;&#x8FBE;&#x5F0F;<code>stop - start</code>&#x5B58;&#x5728;&#x53D1;&#x751F;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;<code>stop</code>&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x6570;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x7701;&#x7565;&#x8BE5;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x5BF9;<code>stop</code>&#x7684;&#x8D4B;&#x503C;&#x6B63;&#x597D;&#x5C06;&#x5176;&#x8BBE;&#x4E3A;&#x6570;&#x7C7B;&#x578B;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x63A7;&#x5236;&#x8DEF;&#x5F84;&#x4E0A;&#xFF0C;&#x51CF;&#x6CD5;&#x53D1;&#x751F;&#x524D;<code>stop</code>&#x90FD;&#x5C06;&#x662F;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x51FD;&#x6570;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x8981;&#x6C42;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x80FD;&#x591F;&#x5BF9;&#x63A7;&#x5236;&#x6D41;&#xFF08;&#x6761;&#x4EF6;&#xFF09;&#x548C;&#x72B6;&#x6001;&#xFF08;&#x8D4B;&#x503C;&#xFF09;&#x8FDB;&#x884C;&#x63A8;&#x65AD;&#x6765;&#x786E;&#x4FDD;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x6B63;&#x786E;&#xFF1B;&#x800C;Typed JavaScript&#x53EF;&#x4EE5;&#x505A;&#x5230;&#xFF0C;&#x4E5F;&#x56E0;&#x6B64;&#x80FD;&#x5141;&#x8BB8;&#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<h4 id="15334-&#x8BBE;&#x8BA1;&#x9009;&#x62E9;">15.3.3.4 &#x8BBE;&#x8BA1;&#x9009;&#x62E9;</h4>
<p>&#x62E5;&#x6709;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x6709;</p>
<ul>
<li>&#x72EC;&#x7ACB;&#x7684;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#xFF08;&#x901A;&#x5E38;&#x7528;&#x7C7B;&#x8868;&#x793A;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5E26;&#x6709;&#x53D8;&#x4F53;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;</li>
<li>&#x7528;&#x4E8E;&#x8868;&#x793A;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x7279;&#x6B8A;&#xFF08;ad hoc&#xFF09;&#x7ED3;&#x6784;&#x4F53;&#x96C6;&#x5408;&#x3002;</li>
<li><a href="https://en.wikipedia.org/wiki/Sentinel_value" target="_blank">&#x54E8;&#x5175;&#x503C;&#xFF08;sentinel value&#xFF09;</a>&#x8868;&#x793A;&#x5931;&#x8D25;&#x3002;</li>
</ul>
<p>&#x5C06;&#x8FD9;&#x79CD;&#x98CE;&#x683C;&#x7684;&#x7A0B;&#x5E8F;&#x8F6C;&#x6362;&#x6210;&#x6EE1;&#x8DB3;&#x7C7B;ML&#x7C7B;&#x578B;&#x98CE;&#x683C;&#x7684;&#x975E;&#x5E38;&#x8D39;&#x4E8B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BB8;&#x591A;&#x6539;&#x9020;&#x8FC7;&#x6765;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x5F15;&#x5165;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x6765;&#x51CF;&#x8F7B;&#x7C7B;&#x578B;&#x5316;&#x8FC7;&#x7A0B;&#x7684;&#x8D1F;&#x62C5;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x5C5E;&#x6027;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x4E2D;&#x7ACB;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x5B83;&#x4E24;&#x4E2A;&#x9700;&#x8981;&#x66F4;&#x591A;&#x8BA8;&#x8BBA;&#x3002;&#x6211;&#x4EEC;&#x4EE5;&#x53CD;&#x5E8F;&#x4F9D;&#x6B21;&#x89E3;&#x51B3;&#x5B83;&#x4EEC;&#x3002;</p>
<ul>
<li><p>&#x9996;&#x5148;&#x5904;&#x7406;&#x54E8;&#x5175;&#x503C;&#x3002;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x54E8;&#x5175;&#x5E94;&#x8BE5;&#x88AB;&#x66FF;&#x6362;&#x4E3A;&#x5F02;&#x5E38;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5F88;&#x591A;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x7684;&#x4EE3;&#x4EF7;&#x5DE8;&#x5927;&#x3002;&#x56E0;&#x6B64;&#x5F00;&#x53D1;&#x8005;&#x503E;&#x5411;&#x4E8E;&#x533A;&#x5206;&#x771F;&#x6B63;&#x7684;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x2014;&#x2014;&#x4E0D;&#x5E94;&#x8BE5;&#x53D1;&#x751F;&#x2014;&#x2014;&#x548C;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x9884;&#x671F;&#x60C5;&#x51B5;&#x3002;&#x68C0;&#x67E5;&#x5143;&#x7D20;&#x662F;&#x5426;&#x5C5E;&#x4E8E;&#x94FE;&#x8868;&#x53D1;&#x73B0;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x60C5;&#x51B5;&#x663E;&#x7136;&#x5C5E;&#x4E8E;&#x540E;&#x8005;&#xFF08;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5143;&#x7D20;&#x662F;&#x5426;&#x5B58;&#x5728;&#xFF0C;&#x8FD9;&#x4E2A;&#x8C13;&#x8BCD;&#x5224;&#x65AD;&#x5C31;&#x65E0;&#x9700;&#x8FDB;&#x884C;&#xFF09;&#x3002;&#x5728;&#x540E;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x54E8;&#x5175;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x5728;C&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x672A;&#x80FD;&#x68C0;&#x6D4B;&#x5F02;&#x5E38;&#x7684;&#x54E8;&#x5175;&#x503C;&#x662F;&#x9519;&#x8BEF;&#x2014;&#x2014;&#x751A;&#x81F3;&#x5B89;&#x5168;&#x7F3A;&#x9677;&#x2014;&#x2014;&#x7684;&#x5E38;&#x89C1;&#x539F;&#x56E0;&#x3002;&#x8FD9;&#x70B9;&#x5F88;&#x5BB9;&#x6613;&#x89E3;&#x51B3;&#x3002;&#x5728;C&#x4E2D;&#xFF0C;&#x54E8;&#x5175;&#x503C;&#x548C;&#x666E;&#x901A;&#x8FD4;&#x56DE;&#x503C;<strong>&#x7C7B;&#x578B;&#x76F8;&#x540C;</strong>&#xFF08;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x7B49;&#x540C;&#x4E8E;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x8FD0;&#x884C;&#x65F6;&#x4E5F;&#x6CA1;&#x6709;&#x68C0;&#x67E5;&#x3002;&#x56E0;&#x6B64;&#x54E8;&#x5175;&#x53EF;&#x4EE5;&#x88AB;&#x5F53;&#x4F5C;&#x5408;&#x6CD5;&#x7684;&#x503C;&#x4F7F;&#x7528;&#xFF0C;&#x4E14;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x54E8;&#x5175;&#x503C;<code>0</code>&#x53EF;&#x4EE5;&#x88AB;&#x5F53;&#x4F5C;&#x5206;&#x914D;&#x6570;&#x636E;&#x7684;&#x5730;&#x5740;&#x6765;&#x4F7F;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x3002;&#x4E0E;&#x4E4B;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x54E8;&#x5175;&#x662F;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x65B0;&#x7C7B;&#x578B;&#xFF0C;&#x65E0;&#x6CD5;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x3002;&#x89C2;&#x5BDF;&#x5230;&#x524D;&#x8BED;&#x8A00;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x7C7B;&#x578B;&#x4E3A;<code>none</code>&#xFF0C;&#x53EF;&#x4EE5;&#x63A8;&#x7406;&#x51FA;&#x8FD9;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x5148;&#x5FFD;&#x7565;&#x8FD9;&#x91CC;&#x8D2C;&#x4E49;&#x7684;&#x201C;&#x7279;&#x6B8A;&#x201D;&#x4E00;&#x8BCD;&#xFF0C;&#x5BF9;&#x4E00;&#x7EC4;&#x7ED3;&#x6784;&#x4F53;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7EC4;&#x662F;&#x5426;&#x662F;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF1F;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5C31;&#x7B97;&#x5728;&#x9075;&#x5FAA;&#x7C7B;ML&#x89C4;&#x8303;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5F53;&#x7A0B;&#x5E8F;&#x5458;&#x5E0C;&#x671B;&#x523B;&#x753B;&#x4E00;&#x4E2A;&#x5927;&#x5B87;&#x5B99;&#x7684;&#x5B50;&#x5B87;&#x5B99;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x5206;&#x7EC4;&#x7684;&#x60C5;&#x5F62;&#x3002;&#x4F8B;&#x5982;&#xFF0C;ML&#x7A0B;&#x5E8F;&#x5458;&#x4F1A;&#x4F7F;&#x7528;&#x4E0B;&#x9762;&#x7684;&#x7C7B;&#x578B;</p>
<blockquote>
<pre><code class="lang-Racket">(define-type SExp
  [numSexp (n : number)]
  [strSexp (s : string)]
  [listSexp (l : (listof SExp))])
</code></pre>
</blockquote>
<p>&#x8868;&#x793A;s-expression&#x3002;&#x5982;&#x679C;&#x6709;&#x51FD;&#x6570;&#x5E0C;&#x671B;&#x64CD;&#x4F5C;&#x8FD9;&#x4E9B;&#x9879;&#x7684;&#x67D0;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x6BD4;&#x5982;&#x6570;&#x548C;&#x6570;&#x7684;&#x94FE;&#x8868;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x503C;&#x5728;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x8F6C;&#x6362;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8003;&#x8651;CPS&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4E0D;&#x5F97;&#x4E0D;&#x4E3A;&#x5176;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x65E0;&#x6CD5;&#x5BF9;&#x5176;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x5DF2;&#x6709;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x6BD4;&#x5982;&#x89E3;&#x91CA;&#x5668;&#x3002;</p>
</li>
</ul>
<p>&#x6362;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x4F3C;&#x4E4E;&#x662F;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x89C1;&#x5230;&#x7684;ML&#x98CE;&#x683C;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x5408;&#x7406;&#x53D8;&#x79CD;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x4E2D;&#x4ECD;&#x6709;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x5176;&#x540E;&#x679C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5141;&#x8BB8;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x65B0;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x5417;&#xFF1F;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#xFF08;&#x548C;&#x547D;&#x540D;&#xFF09;&#x8054;&#x5408;&#x5417;&#xFF1F;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5141;&#x8BB8;&#x8868;&#x8FBE;&#x5F0F;</p>
<pre><code class="lang-Racket">(if (phase-of-the-moon)
    10
    true)
</code></pre>
<p>&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5417;&#xFF08;&#x5C06;&#x521B;&#x5EFA;&#x7C7B;&#x578B;<code>(U Number Boolean)</code>&#xFF09;&#xFF0C;&#x8FD8;&#x662F;&#x7531;&#x4E8E;&#x5176;&#x5F15;&#x5165;&#x4E86;&#x4E4B;&#x524D;&#x672A;&#x547D;&#x540D;&#x5E76;&#x663E;&#x5F0F;&#x6807;&#x8BC6;&#x7684;&#x7C7B;&#x578B;&#x800C;&#x5C06;&#x5176;&#x5224;&#x5B9A;&#x4E3A;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF1F;Typed Racket&#x63D0;&#x4F9B;&#x7684;&#x662F;&#x524D;&#x8005;&#xFF1A;&#x5B83;&#x5C06;&#x521B;&#x5EFA;&#x771F;&#x6B63;&#x7684;&#x4E34;&#x65F6;&#x8054;&#x5408;&#x3002;&#x5BF9;&#x4E8E;&#x7ED9;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x5F15;&#x5165;&#x7C7B;&#x578B;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#x53EF;&#x80FD;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x5199;&#x65B0;&#x4EE3;&#x7801;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x662F;&#x4E2A;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x8FD8;&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#xFF0C;&#x56E0;&#x4E3A;&#x5E76;&#x975E;&#x7A0B;&#x5E8F;&#x5458;&#x671F;&#x671B;&#x5185;&#x7684;&#x8054;&#x5408;&#x4F1A;&#x51FA;&#x73B0;&#xFF0C;&#x800C;&#x4E14;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x3002;&#x8FD9;&#x7ED9;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x672A;&#x88AB;&#x63A2;&#x7D22;&#x7684;&#x89D2;&#x843D;&#x3002;</p>
<h3 id="1534-&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E0E;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;">15.3.4 &#x540D;&#x4E49;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E0E;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;</h3>
<p>&#x6211;&#x4EEC;&#x6700;&#x521D;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7C7B;&#x578B;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x4EEC;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x7C7B;&#x578B;&#x7684;&#x547D;&#x540D;&#x673A;&#x5236;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x6E05;&#x695A;&#x6709;&#x4F55;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x8003;&#x8651;Typed Racket&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5199;</p>
<pre><code class="lang-Racket">(define-type NB1 (U Number Boolean))
(define-type NB2 (U Number Boolean))
</code></pre>
<p>&#x7136;&#x540E;&#x5199;</p>
<pre><code class="lang-Racket">(define: v : NB1 5)
</code></pre>
<p>&#x5047;&#x8BBE;&#x8FD8;&#x5B9A;&#x4E49;&#x4E86;&#x51FD;&#x6570;</p>
<pre><code class="lang-Racket">(define: (f [x : NB2]) : NB2 x)
</code></pre>
<p>&#x7136;&#x540E;&#x7528;<code>v</code>&#x8C03;&#x7528;<code>f</code>&#xFF0C;&#x5373;<code>(f v)</code>&#xFF1A;&#x8BE5;&#x8C03;&#x7528;&#x5E94;&#x8BE5;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5417;&#xFF1F;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x5B8C;&#x5168;&#x5408;&#x7406;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x4E00;&#x79CD;&#x662F;&#x8BF4;<code>v</code>&#x88AB;&#x58F0;&#x660E;&#x4E3A;&#x7C7B;&#x578B;<code>NB1</code>&#xFF0C;&#x4E0E;<code>NB2</code><strong>&#x540D;&#x79F0;</strong>&#x4E0D;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x5E94;&#x8BE5;&#x88AB;&#x5F53;&#x4F5C;&#x4E0D;&#x540C;<strong>&#x7C7B;&#x578B;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x8C03;&#x7528;&#x5E94;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x540D;&#x4E49;&#x7684;</strong>&#xFF08;<a href="https://en.wikipedia.org/wiki/Nominal_type_system" target="_blank">nominal</a>&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x7C7B;&#x578B;&#x7684;&#x540D;&#x5B57;&#x5BF9;&#x4E8E;&#x786E;&#x5B9A;&#x7C7B;&#x578B;&#x662F;&#x5426;&#x76F8;&#x7B49;&#x6781;&#x4E3A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x662F;&#x8BF4;&#x56E0;&#x4E3A;<code>NB1</code>&#x548C;<code>NB2</code><strong>&#x7ED3;&#x6784;</strong>&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x53D1;&#x8005;&#x65E0;&#x6CD5;&#x5199;&#x51FA;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x4E0A;&#x8868;&#x73B0;&#x7684;&#x4E0D;&#x540C;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x5E94;&#x8BE5;&#x88AB;&#x89C6;&#x4E3A;&#x76F8;&#x540C;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7ED3;&#x6784;&#x7684;</strong>&#xFF08;<a href="https://en.wikipedia.org/wiki/Structural_type_system" target="_blank">structural</a>&#xFF09;&#xFF0C;&#x5C06;&#x5141;&#x8BB8;&#x4E0A;&#x9762;&#x7684;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x3002;&#xFF08;Typed Racket&#x9075;&#x5FAA;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#x7684;&#x89C4;&#x8303;&#xFF0C;&#x7406;&#x7531;&#x540C;&#x6837;&#x662F;&#x51CF;&#x5C11;&#x5BFC;&#x5165;&#x73B0;&#x6709;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x4EE3;&#x7801;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x8FD9;&#x4E9B;Racket&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x662F;&#x4EE5;&#x7ED3;&#x6784;&#x89E3;&#x91CA;&#x4E3A;&#x6A21;&#x578B;&#x7F16;&#x5199;&#x7684;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;Typed Racket&#x4E2D;<code>(f v)</code>&#x4E0D;&#x4EC5;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x800C;&#x4E14;&#x6253;&#x5370;&#x51FA;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x4E3A;<code>NB1</code>&#xFF0C;&#x65E0;&#x89C6;<code>f</code>&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x6CE8;&#x89E3;&#xFF01;&#xFF09;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x7279;&#x522B;&#x5C0F;&#x5FC3;&#xFF0C;&#x4F60;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x88AB;&#x8BA4;&#x4E3A;&#x76F8;&#x540C;&#x548C;&#x5B9E;&#x9645;&#x76F8;&#x540C;&#x4E4B;&#x95F4;&#x662F;&#x6709;&#x533A;&#x522B;&#x7684;&#x3002;&#x8FD9;&#x91CC;&#x4E0D;&#x4F1A;&#x6D89;&#x53CA;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x8BF7;&#x8003;&#x8651;&#x7F16;&#x8BD1;&#x5668;&#x4F5C;&#x8005;&#x9009;&#x62E9;&#x503C;&#x7684;&#x8868;&#x793A;&#x65F6;&#x5176;&#x5F71;&#x54CD;&#x662F;&#x5565;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x5141;&#x8BB8;&#x8FD0;&#x884C;&#x65F6;&#x83B7;&#x53D6;&#x503C;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x3002;</p>
</blockquote>
<p>&#x540D;&#x4E49;&#x548C;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x4E2D;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4E89;&#x8BAE;&#xFF0C;<a href="chap15.html#1538-&#x5BF9;&#x8C61;&#x7C7B;&#x578B;">&#x540E;&#x9762;</a>&#x5C06;&#x7B80;&#x8981;&#x56DE;&#x987E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x91CD;&#x70B9;&#x662F;&#x8981;&#x8BF4;&#x660E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x672C;&#x8D28;&#x4E0A;&#x5E76;&#x4E0D;&#x5173;&#x4E4E;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#x3002;&#x4EFB;&#x4F55;&#x5141;&#x8BB8;&#x547D;&#x540D;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;&#x2014;&#x2014;&#x51FA;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#x7CBE;&#x795E;&#x5065;&#x5EB7;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6240;&#x6709;&#x7684;&#x8BED;&#x8A00;&#x4E86;&#x2014;&#x2014;&#x90FD;&#x8981;&#x5E94;&#x4ED8;&#x6B64;&#x95EE;&#x9898;&#xFF1A;&#x547D;&#x540D;&#x53EA;&#x662F;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x8FD8;&#x662F;&#x8BF4;&#x6240;&#x9009;&#x7684;&#x540D;&#x5B57;&#x662F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF1F;&#x9009;&#x62E9;&#x524D;&#x8005;&#x5BFC;&#x81F4;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#xFF0C;&#x9009;&#x62E9;&#x540E;&#x8005;&#x5BFC;&#x81F4;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x3002;</p>
<h3 id="1535-&#x4EA4;&#x53C9;&#x7C7B;&#x578B;">15.3.5 &#x4EA4;&#x53C9;&#x7C7B;&#x578B;</h3>
<p>&#x6211;&#x4EEC;&#x521A;&#x63A2;&#x7D22;&#x4E86;&#x8054;&#x5408;&#x7C7B;&#x578B;&#xFF0C;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x5C31;&#x4F1A;&#x60F3;&#x5230;&#x6709;&#x6CA1;&#x6709;<strong>&#x4EA4;&#x53C9;</strong>&#xFF08;intersection&#xFF09;&#x7C7B;&#x578B;&#x5462;&#x3002;&#x786E;&#x5B9E;&#x6709;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x6307;&#xFF08;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#xFF09;&#x503C;&#x5C5E;&#x4E8E;&#x8FD9;&#x4E2A;&#x8054;&#x5408;&#x4E2D;&#x67D0;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x4EA4;&#x53C9;&#x7C7B;&#x578B;&#x663E;&#x7136;&#x610F;&#x5473;&#x7740;&#x8BE5;&#x503C;&#x5C5E;&#x4E8E;&#x4EA4;&#x53C9;&#x4E2D;&#x7684;<strong>&#x6240;&#x6709;</strong>&#x7C7B;&#x578B;&#xFF1A;&#x5408;&#x53D6;&#xFF0C;&#x6216;&#x201C;&#x4E14;&#x201D;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5947;&#x602A;&#xFF1A;&#x503C;&#x600E;&#x4E48;&#x53EF;&#x80FD;&#x5C5E;&#x4E8E;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x5462;&#xFF1F;</p>
<p>&#x7528;&#x5177;&#x4F53;&#x4F8B;&#x5B50;&#x56DE;&#x7B54;&#xFF0C;&#x8003;&#x8651;<strong>&#x91CD;&#x8F7D;&#x51FD;&#x6570;</strong>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;<code>+</code>&#x5373;&#x53EF;&#x64CD;&#x4F5C;&#x6570;&#xFF0C;&#x4E5F;&#x80FD;&#x64CD;&#x4F5C;&#x5B57;&#x7B26;&#x4E32;&#xFF1B;&#x4F20;&#x5165;&#x4E24;&#x4E2A;&#x6570;&#x5B83;&#x8FD4;&#x56DE;&#x6570;&#xFF0C;&#x4F20;&#x5165;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5B83;&#x8FD4;&#x56DE;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;<code>+</code>&#x7684;&#x7C7B;&#x578B;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E0D;&#x662F;<code>(number number -&gt; number)</code>&#xFF0C;&#x56E0;&#x4E3A;&#x90A3;&#x6837;&#x5B83;&#x5C06;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#xFF1B;&#x540C;&#x6837;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;<code>(string string -&gt; string)</code>&#x3002;&#x751A;&#x81F3;&#x5B83;&#x4E5F;&#x4E0D;&#x662F;</p>
<pre><code class="lang-Racket">(U (number number -&gt; number)
   (string string -&gt; string))
</code></pre>
<p>&#x56E0;&#x4E3A;<code>+</code>&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x4E4B;&#x4E00;&#xFF1A;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#xFF08;&#x540C;&#x65F6;&#xFF09;&#x662F;&#x8FD9;&#x4E24;&#x8005;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5176;&#x7C7B;&#x578B;&#x662F;</p>
<pre><code class="lang-Racket">((number U string) (number U string) -&gt; (number U string))
</code></pre>
<p>&#x8FD9;&#x8BF4;&#x660E;&#x5B83;&#x7684;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#x90FD;&#x53EA;&#x80FD;&#x662F;&#x8FD9;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x4E4B;&#x4E00;&#xFF0C;&#x800C;&#x4E0D;&#x540C;&#x65F6;&#x4E3A;&#x4E24;&#x8005;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x5BFC;&#x81F4;&#x7CBE;&#x5EA6;&#x635F;&#x5931;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x4EE5;&#x4F55;&#x79CD;&#x65B9;&#x5F0F;&#x635F;&#x5931;&#x7CBE;&#x5EA6;&#xFF1F;</p>
</blockquote>
<p>&#x89C2;&#x5BDF;&#x5230;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;<strong>&#x6240;&#x6709;</strong>&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x5747;&#x4E3A;<code>(number U string)</code>&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8FD4;&#x56DE;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x533A;&#x5206;&#x6570;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x4EEC;&#x5C06;&#x5F97;&#x5230;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x7ED9;&#x5B9A;&#x4E24;&#x4E2A;&#x6570;&#x53C2;&#x6570;&#x5C06;&#x8FD4;&#x56DE;&#x6570;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x4FE1;&#x606F;&#x5728;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E22;&#x5931;&#x4E86;&#x3002;</p>
<p>&#x66F4;&#x5DE7;&#x5999;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x5141;&#x8BB8;&#x72EC;&#x7ACB;&#x7684;&#x9009;&#x62E9;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6839;&#x636E;&#x8BE5;&#x7C7B;&#x578B;&#xFF0C;<code>(+ 3 &quot;x&quot;)</code>&#x4E5F;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF08;&#x4E14;&#x5176;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#x4E3A;<code>(number U string)</code>&#xFF09;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x63CF;&#x8FF0;&#x7684;&#x52A0;&#x6CD5;&#x64CD;&#x4F5C;&#x5F53;&#x7136;&#x6CA1;&#x6709;&#x5BF9;&#x8FD9;&#x7EC4;&#x53C2;&#x6570;&#x5B9A;&#x4E49;&#x8FC7;&#xFF01;</p>
<p>&#x56E0;&#x6B64;&#x63CF;&#x8FF0;&#x8FD9;&#x79CD;&#x52A0;&#x6CD5;&#x7684;&#x66F4;&#x4E3A;&#x5408;&#x9002;&#x7684;&#x7C7B;&#x578B;&#x662F;</p>
<pre><code class="lang-Racket">(^ (number number -&gt; number)
   (string string -&gt; string))
</code></pre>
<p>&#x8FD9;&#x91CC;&#x7684;<code>&#x2227;</code>&#x8BA9;&#x4EBA;&#x8054;&#x60F3;&#x5230;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x5408;&#x53D6;&#x64CD;&#x4F5C;&#x7B26;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x51FD;&#x6570;&#x7528;&#x4E24;&#x4E2A;&#x6570;&#x6216;&#x8005;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x8C03;&#x7528;&#xFF0C;&#x5176;&#x5B83;&#x7684;&#x5219;&#x4E0D;&#x5141;&#x8BB8;&#x3002;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x6570;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x6570;&#x7C7B;&#x578B;&#xFF1B;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#xFF1B;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x6CA1;&#x6709;&#x5176;&#x5B83;&#x5408;&#x6CD5;&#x8C03;&#x7528;&#x4E86;&#x3002;&#x8FD9;&#x521A;&#x597D;&#x5BF9;&#x5E94;&#x4E8E;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x7684;&#x91CD;&#x8F7D;&#x884C;&#x4E3A;&#xFF08;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x7279;&#x8BBE;&#x591A;&#x6001;</strong>(ad hoc polymorphism)&#xFF09;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x6709;&#x9650;&#x6570;&#x91CF;&#x91CD;&#x8F7D;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<h3 id="1536-&#x9012;&#x5F52;&#x7C7B;&#x578B;">15.3.6 &#x9012;&#x5F52;&#x7C7B;&#x578B;</h3>
<p>&#x5B66;&#x8FC7;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x4E4B;&#x540E;&#xFF0C;&#x503C;&#x5F97;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x6211;&#x4EEC;&#x539F;&#x6765;&#x9047;&#x5230;&#x8FC7;&#x7684;&#x9012;&#x5F52;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x63A5;&#x53D7;&#x53D8;&#x4F53;&#x4F5C;&#x4E3A;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x5199;&#x4F5C;&#x5B83;&#x4EEC;&#x7684;&#x8054;&#x5408;&#x5417;&#xFF1F;&#x4F8B;&#x5982;&#x5C31;<code>BTnum</code>&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x5426;&#x5C06;&#x5B83;&#x63CF;&#x8FF0;&#x6210;&#x7B49;&#x4EF7;&#x4E8E;</p>
<pre><code class="lang-Racket">((BTmt) U (BTnd number BTnum BTnum))
</code></pre>
<p>&#x7684;&#x7C7B;&#x578B;&#x5417;&#xFF0C;&#x5176;&#x4E2D;<code>BTmt</code>&#x662F;&#x96F6;&#x53C2;&#x6570;&#x7684;&#x6784;&#x9020;&#x5668;&#xFF0C;&#x800C;<code>BTnd</code>&#x662F;&#x4E09;&#x53C2;&#x6570;&#x7684;&#xFF1F;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x6309;&#x4E0A;&#x9762;&#x6240;&#x5199;&#x7684;&#x7C7B;&#x578B;&#xFF0C;<code>BTnum</code>&#x8981;&#x4E48;&#x662F;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x5185;&#x5EFA;&#x7684;&#xFF08;&#x8FD9;&#x4E0D;&#x80FD;&#x4EE4;&#x4EBA;&#x6EE1;&#x610F;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x672A;&#x7ED1;&#x5B9A;&#x7684;&#x3002;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x8981;&#x7684;&#x662F;</p>
<pre><code class="lang-Racket">BTnum = ((BTmt) U (BTnd number BTnum BTnum))
</code></pre>
<p>&#x95EE;&#x9898;&#x662F;&#x8FD9;&#x4E2A;&#x65B9;&#x7A0B;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x89E3;&#x6CD5;&#xFF08;&#x8FD8;&#x8BB0;&#x5F97;<code>&#x3C9;</code>&#x5417;&#xFF1F;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;<a href="chap9.html#91-&#x9012;&#x5F52;&#x4E0E;&#x5FAA;&#x73AF;&#x6570;&#x636E;">&#x503C;&#x7684;&#x9012;&#x5F52;</a>&#x65F6;&#x5C31;&#x719F;&#x6089;&#x8FC7;&#x3002;&#x90A3;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x660E;&#x4E86;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x6784;&#x9020;&#x5668;&#xFF08;&#x5E76;&#x5C55;&#x793A;&#x4E86;&#x5176;&#x5B9E;&#x73B0;&#xFF09;&#x6765;&#x89C4;&#x907F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x540C;&#x6837;&#x9700;&#x8981;&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x5668;&#x3002;&#x6309;&#x60EF;&#x4F8B;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;<code>&#x3BC;</code>&#xFF08;&#x5E0C;&#x814A;&#x5B57;&#x6BCD;&#x201C;&#x7F2A;&#x201D;&#xFF09;&#x3002;&#x6709;&#x4E86;&#x5B83;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x4E0A;&#x9762;&#x7684;&#x7C7B;&#x578B;&#x5199;&#x505A;</p>
<pre><code class="lang-Racket">&#x3BC; BTnum : ((BTmt) U (BTnd number BTnum BTnum))
</code></pre>
<p><code>&#x3BC;</code>&#x662F;&#x7ED1;&#x5B9A;&#x6784;&#x9020;&#xFF1B;&#x5B83;&#x5C06;<code>BTnum</code>&#x7ED1;&#x5B9A;&#x5230;&#x540E;&#x9762;&#x5199;&#x7684;&#x6574;&#x4E2A;&#x7C7B;&#x578B;&#x4E0A;&#xFF0C;&#x5305;&#x62EC;&#x5BF9;<code>BTnum</code>&#x81EA;&#x8EAB;&#x7684;&#x9012;&#x5F52;&#x7ED1;&#x5B9A;&#x3002;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6574;&#x4E2A;&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x7684;&#x79F0;&#x4E3A;<code>BTnum</code>&#x7684;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-Racket">BTnum = &#x3BC; BTnum : ((BTmt) U (BTnd number BTnum BTnum))
</code></pre>
<p>&#x5C3D;&#x7BA1;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x5FAA;&#x73AF;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x53F3;&#x4FA7;&#x7684;<code>BTnum</code>&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x7B49;&#x5F0F;&#x5DE6;&#x4FA7;&#x7684;&#x90A3;&#x4E2A;&#xFF1A;&#x5373;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x91CD;&#x5199;&#x4E3A;</p>
<pre><code class="lang-Racket">BTnum = &#x3BC; T : ((BTmt) U (BTnd number T T))
</code></pre>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;<code>BTnum</code>&#x7684;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8BED;&#x6CD5;&#x7CD6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7A0B;&#x5E8F;&#x7684;&#x5404;&#x4E2A;&#x5730;&#x65B9;&#x66FF;&#x6362;&#x4F7F;&#x7528;&#xFF0C;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x65E0;&#x9650;&#x56DE;&#x5F52;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8BED;&#x4E49;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x5BF9;<code>&#x3BC;</code>&#x7ED1;&#x5B9A;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x610F;&#x4E49;&#x6709;&#x4E24;&#x79CD;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF1A;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;<strong>&#x540C;&#x6784;&#x9012;&#x5F52;</strong>&#xFF08;isorecursive&#xFF09;&#x6216;<strong>&#x7B49;&#x4EF7;&#x9012;&#x5F52;</strong>&#xFF08;equirecursive&#xFF09;&#x3002;&#x7136;&#x800C;&#x5176;&#x4E2D;&#x533A;&#x522B;&#x5F88;&#x5FAE;&#x5999;&#xFF0C;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x7AE0;&#x8303;&#x56F4;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x53EA;&#x9700;&#x7406;&#x89E3;&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x88AB;&#x89C6;&#x4E3A;&#x7B49;&#x540C;&#x4E8E;&#x5B83;&#x7684;&#x5C55;&#x5F00;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x6570;&#x7684;&#x94FE;&#x8868;&#x7C7B;&#x578B;&#x4E3A;</p>
<pre><code class="lang-Racket">NumL = &#x3BC; T : ((MtL) U (ConsL number T))
</code></pre>
<p>&#x4E8E;&#x662F;&#x6709;</p>
<pre><code class="lang-text">  &#x3BC; T : ((MtL) U (ConsL number T))
= (MtL) U (ConsL number (&#x3BC; T : ((MtL) U (ConsL number T))))
= (MtL) U (ConsL number (MtL))
        U (ConsL number (ConsL number (&#x3BC; T : ((MtL) U (ConsL number T)))))
</code></pre>
<p>&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF08;&#x540C;&#x6784;&#x548C;&#x7B49;&#x4EF7;&#x9012;&#x5F52;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x6B63;&#x662F;&#x5728;&#x76F8;&#x7B49;&#x6027;&#x7684;&#x6982;&#x5FF5;&#x4E0A;&#xFF1A;&#x662F;&#x5B9A;&#x4E49;&#x4E0A;&#x7684;&#x76F8;&#x7B49;&#x6027;&#x8FD8;&#x662F;&#x540C;&#x6784;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#xFF09;&#x3002;&#x6BCF;&#x4E00;&#x6B65;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x53C2;&#x6570;<code>T</code>&#x66FF;&#x6362;&#x6210;&#x6574;&#x4E2A;&#x7C7B;&#x578B;&#x3002;&#x548C;&#x503C;&#x7684;&#x9012;&#x5F52;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x7684;&#x610F;&#x601D;&#x662F;&#x9700;&#x8981;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x201C;&#x83B7;&#x5F97;&#x53E6;&#x4E00;&#x4E2A;&#x201D;<code>ConsL</code>&#x6784;&#x9020;&#x3002;&#x6362;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x94FE;&#x8868;&#x7684;<strong>&#x7C7B;&#x578B;</strong>&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x96F6;&#x6216;&#x4EFB;&#x610F;&#x591A;&#x5143;&#x7D20;&#x7684;&#x8054;&#x5408;&#xFF1B;&#x8FD9;&#x7B49;&#x4EF7;&#x4E8E;&#x5305;&#x542B;&#x96F6;&#x4E2A;&#x3001;&#x4E00;&#x4E2A;&#x6216;&#x4EFB;&#x610F;&#x4E2A;&#x5143;&#x7D20;&#x7684;<strong>&#x7C7B;&#x578B;</strong>&#xFF1B;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x4EFB;&#x4F55;&#x6570;&#x7684;&#x94FE;&#x8868;&#x90FD;&#xFF08;&#x6070;&#x597D;&#xFF09;&#x7B26;&#x5408;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x3002;</p>
<blockquote>
<p>Pierce&#x7684;&#x4E66;&#x4E2D;&#x5BF9;&#x6B64;&#x89E3;&#x91CA;&#x7684;&#x975E;&#x5E38;&#x597D;&#x3002;</p>
</blockquote>
<p>&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5373;&#x4F7F;&#x57FA;&#x4E8E;&#x5BF9;&#x4E8E;<code>&#x3BC;</code>&#x7684;&#x8FD9;&#x79CD;&#x975E;&#x6B63;&#x5F0F;&#x7406;&#x89E3;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x7ED9;<code>&#x3C9;</code>&#x8FDB;&#x800C;<code>&#x3A9;</code>&#x63D0;&#x4F9B;&#x7C7B;&#x578B;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x63CF;&#x8FF0;<code>&#x3C9;</code>&#x548C;<code>&#x3A9;</code>&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
</blockquote>
<h3 id="1537-&#x5B50;&#x7C7B;&#x578B;">15.3.7 &#x5B50;&#x7C7B;&#x578B;</h3>
<p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x4E8C;&#x53C9;&#x6811;&#x5B9A;&#x4E49;&#xFF1B;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x503C;&#x4E3A;&#x6570;&#x3002;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7528;Typed Racket&#x5199;&#xFF1A;</p>
<pre><code class="lang-Racket">#lang typed/racket

(define-struct: mt ())
(define-struct: nd ([v : Number] [l : BT] [r : BT]))
(define-type BT (U mt nd))
</code></pre>
<p>&#x8003;&#x8651;&#x4E8C;&#x53C9;&#x6811;&#x5177;&#x4F53;&#x7684;&#x503C;&#xFF1A;</p>
<pre><code class="lang-Racket">&gt; (mt)
- : mt
#&lt;mt&gt;
&gt; (nd 5 (mt) (mt))
- : nd
#&lt;nd&gt;
</code></pre>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6BCF;&#x4E2A;&#x7ED3;&#x6784;&#x4F53;&#x6784;&#x9020;&#x5668;&#x6784;&#x9020;&#x51FA;&#x81EA;&#x5DF1;&#x5BF9;&#x5E94;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;<code>BT</code>&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;&#x4F46;&#x662F;&#x8003;&#x8651;<code>(nd 5 (mt) (mt))</code>&#xFF1A;<code>nd</code>&#x7684;&#x5B9A;&#x4E49;&#x8868;&#x660E;&#x5176;&#x5B50;&#x6811;&#x5FC5;&#x987B;&#x4E3A;<code>BT</code>&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F20;&#x7ED9;&#x5B83;<code>mt</code>&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x4F7F;&#x7528;<code>mt</code>&#x548C;<code>nd</code>&#x6765;&#x5B9A;&#x4E49;<code>BT</code>&#x5E76;&#x4E0D;&#x662F;&#x5DE7;&#x5408;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x786E;&#x5B9E;&#x8868;&#x660E;&#x5728;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x65F6;&#xFF0C;&#x4E0D;&#x80FD;&#x53EA;&#x68C0;&#x67E5;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x76F8;&#x7B49;&#x6027;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x6240;&#x505A;&#x7684;&#x4E0D;&#x591F;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x68C0;&#x67E5;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x201C;&#x9002;&#x7528;&#x4E8E;&#x201D;&#x53E6;&#x4E00;&#x79CD;&#x3002;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5B50;&#x7C7B;&#x578B;&#x5316;</strong>&#xFF08;subtyping&#xFF09;&#x3002;</p>
<p>&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x672C;&#x8D28;&#x662F;&#x5B9A;&#x4E49;&#x4E00;&#x79CD;&#x5173;&#x7CFB;&#xFF0C;&#x901A;&#x5E38;&#x7528;<code>&lt;:</code>&#x8868;&#x793A;&#xFF0C;&#x5C06;&#x4E00;&#x5BF9;&#x7C7B;&#x578B;&#x5173;&#x8054;&#x8D77;&#x6765;&#x3002;&#x5728;&#x671F;&#x5F85;&#x7C7B;&#x578B;<code>T</code>&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x679C;&#x653E;&#x5165;&#x7C7B;&#x578B;<code>S</code>&#x7684;&#x503C;&#x4E5F;&#x6210;&#x7ACB;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x79F0;<code>S &lt;: T</code>&#xFF1A;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x5C06;<strong>&#x53EF;&#x66FF;&#x4EE3;&#x6027;</strong>&#x7684;&#x6982;&#x5FF5;&#xFF08;&#x5373;&#xFF0C;&#x4EFB;&#x4F55;&#x671F;&#x671B;&#x7C7B;&#x578B;<code>T</code>&#x7684;&#x503C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x66FF;&#x6362;&#x6210;&#x7C7B;&#x578B;&#x4E3A;<code>S</code>&#x7684;&#x503C;&#xFF09;&#x5F62;&#x5F0F;&#x5316;&#x3002;&#x5F53;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#x6210;&#x7ACB;&#x65F6;&#xFF0C;<code>S</code>&#x88AB;&#x79F0;&#x4F5C;<strong>&#x5B50;&#x7C7B;&#x578B;</strong>&#xFF08;subtype&#xFF09;&#xFF0C;<code>T</code>&#x88AB;&#x79F0;&#x4F5C;<strong>&#x8D85;&#x7C7B;&#x578B;</strong>&#xFF08;supertype&#xFF09;&#x3002;&#x4F7F;&#x7528;&#x5B50;&#x96C6;&#x53BB;&#x89E3;&#x91CA;&#x8FD9;&#x70B9;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#xFF08;&#x901A;&#x5E38;&#x4E5F;&#x662F;&#x51C6;&#x786E;&#x7684;&#xFF09;&#xFF1A;&#x5982;&#x679C;<code>S</code>&#x7684;&#x503C;&#x662F;<code>T</code>&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x90A3;&#x4E48;&#x671F;&#x671B;&#x63A5;&#x53D7;<code>T</code>&#x503C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6536;&#x5230;<code>S</code>&#x503C;&#x65F6;&#x4E0D;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x5BF9;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x6709;&#x7740;&#x6DF1;&#x8FDC;&#x5F71;&#x54CD;&#x3002;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5BA1;&#x89C6;&#x6BCF;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x7406;&#x89E3;&#x5B83;&#x548C;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x5BF9;&#x4E8E;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x660E;&#x663E;&#xFF1A;&#x6570;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x7B49;&#x4E0D;&#x76F8;&#x4EA4;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5F7C;&#x6B64;&#x65E0;&#x5173;&#x3002;&#xFF08;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#xFF0C;&#x4F7F;&#x7528;&#x67D0;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x8868;&#x793A;&#x5176;&#x5B83;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;&#x67D0;&#x4E9B;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x6570;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x7279;&#x6B8A;&#x5199;&#x6CD5;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD8;&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5E03;&#x5C14;&#x503C;&#x5C31;&#x662F;&#x6570;&#x2014;&#x2014;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x4E5F;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5B50;&#x7C7B;&#x578B;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5E76;&#x4E0D;&#x5E38;&#x89C1;&#x3002;&#xFF09;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x548C;&#x6BCF;&#x4E2A;&#x590D;&#x5408;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x751A;&#x81F3;&#x6211;&#x4EEC;&#x5173;&#x4E8E;&#x7C7B;&#x578B;&#x7684;&#x8868;&#x8FF0;&#x4E5F;&#x9700;&#x8981;&#x6539;&#x53D8;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x6709;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A;<code>T</code>&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x4F1A;&#x8BF4;&#x5B83;&#x4EA7;&#x751F;&#x7C7B;&#x578B;&#x4E3A;<code>T</code>&#x7684;&#x503C;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C0F;&#x5FC3;&#x7684;&#x8BF4;&#xFF0C;&#x5B83;&#x4EA7;&#x51FA;<strong>&#x6700;&#x591A;&#x4E3A;</strong><code>T</code>&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x80FD;&#x53EA;&#x4EA7;&#x51FA;<code>T</code>&#x7684;&#x67D0;&#x4E2A;&#x5B50;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BF9;&#x7C7B;&#x578B;&#x7684;&#x5F15;&#x7528;&#x90FD;&#x9690;&#x542B;&#x5730;&#x6D89;&#x53CA;&#x53EF;&#x80FD;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#x5F15;&#x7528;&#x3002;&#x4E3A;&#x907F;&#x514D;&#x70E6;&#x607C;&#x6211;&#x4F1A;&#x63A7;&#x5236;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4F46;&#x8981;&#x5C0F;&#x5FC3;&#xFF0C;&#x5FFD;&#x7565;&#x8FD9;&#x79CD;&#x9690;&#x542B;&#x7684;&#x89E3;&#x91CA;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x63A8;&#x7406;&#x9519;&#x8BEF;&#x3002;</p>
<h4 id="15371-&#x8054;&#x5408;">15.3.7.1 &#x8054;&#x5408;</h4>
<p>&#x6211;&#x4EEC;&#x6765;&#x8BA8;&#x8BBA;&#x8054;&#x5408;&#x548C;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x8054;&#x5408;&#x662F;&#x6574;&#x4E2A;&#x8054;&#x5408;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x6240;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x663E;&#x7136;&#x6BCF;&#x4E2A;<code>mt</code>&#x503C;&#x90FD;&#x662F;<code>BT</code>&#x503C;&#xFF1B;&#x8FD9;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;<code>nd</code>&#x3002;&#x56E0;&#x800C;&#xFF0C;</p>
<pre><code class="lang-text">mt &lt;: BT
nd &lt;: BT
</code></pre>
<p>&#x4E8E;&#x662F;&#xFF0C;<code>(mt)</code>&#x4E5F;&#x662F;<code>BT</code>&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x8868;&#x8FBE;&#x5F0F;<code>(nd 5 (mt) (mt))</code>&#x7C7B;&#x578B;&#x6B63;&#x786E;&#xFF0C;&#x5C31;&#x662F;<code>nd</code>&#x2014;&#x2014;&#x56E0;&#x6B64;&#x4E5F;&#x662F;<code>BT</code>&#x7C7B;&#x578B;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;</p>
<pre><code class="lang-text">S &lt;: (S U T)
T &lt;: (S U T)
</code></pre>
<p>&#xFF08;&#x6211;&#x4EEC;&#x5199;&#x4E86;&#x4E24;&#x4E2A;&#x770B;&#x4E0A;&#x53BB;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x660E;&#x786E;&#x8BF4;&#x660E;&#x5B50;&#x7C7B;&#x578B;&#x5904;&#x5728;&#x8054;&#x5408;&#x4E2D;&#x7684;&#x54EA;&#x201C;&#x4E00;&#x8FB9;&#x201D;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF09;&#x3002;&#x5B83;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;<code>S</code>&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;<code>S U T</code>&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;<code>S U T</code>&#x7C7B;&#x578B;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x5305;&#x542B;<code>S</code>&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;</p>
<h4 id="15372-&#x4EA4;&#x53C9;">15.3.7.2 &#x4EA4;&#x53C9;</h4>
<p>&#x65E2;&#x7136;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x7B80;&#x8981;&#x7684;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x4EA4;&#x53C9;&#x3002;&#x6B63;&#x5982;&#x4F60;&#x53EF;&#x80FD;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4EA4;&#x53C9;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x5BF9;&#x5076;&#x7684;&#xFF1A;</p>
<pre><code class="lang-text">(S &#x2227; T) &lt;: S
(S &#x2227; T) &lt;: T
</code></pre>
<p>&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x8FD9;&#x70B9;&#xFF0C;&#x4F7F;&#x7528;&#x5B50;&#x96C6;&#x7684;&#x89E3;&#x91CA;&#xFF1A;&#x5982;&#x679C;&#x503C;&#x5373;&#x662F;<code>S</code>&#x4E5F;&#x662F;<code>T</code>&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x4E24;&#x8005;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x3002;</p>
<p><strong>&#x601D;&#x8003;&#x9898;</strong></p>
<blockquote>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4E0B;&#x9762;&#x4E24;&#x6761;&#x5047;&#x8BBE;<strong>&#x4E0D;</strong>&#x6210;&#x7ACB;&#xFF1F;</p>
<ol>
<li><code>(S U T) &lt;: S</code></li>
<li><code>T &lt;: (S &#x2227; T)</code></li>
</ol>
</blockquote>
<p>&#x7B2C;&#x4E00;&#x6761;&#x4E0D;&#x6210;&#x7ACB;&#x662F;&#x56E0;&#x4E3A;&#x7C7B;&#x578B;<code>T</code>&#x7684;&#x503C;&#x662F;<code>(S U T)</code>&#x4E2D;&#x5B8C;&#x5168;&#x5408;&#x6CD5;&#x7684;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6570;&#x662F;&#x7C7B;&#x578B;<code>(string U number)</code>&#x7684;&#x4E00;&#x5458;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6570;&#x4E0D;&#x53EF;&#x4EE5;&#x5728;&#x9700;&#x8981;&#x7C7B;&#x578B;&#x4E3A;<code>string</code>&#x7684;&#x65F6;&#x5019;&#x88AB;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x7B2C;&#x4E8C;&#x6761;&#xFF0C;&#x7C7B;&#x578B;<code>T</code>&#x7684;&#x503C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x4E0D;&#x662F;&#x7C7B;&#x578B;<code>S</code>&#x7684;&#x503C;&#x3002;&#x4EFB;&#x4F55;&#x5E0C;&#x671B;&#x7C7B;&#x578B;<code>(S &#x2227; T)</code>&#x6D88;&#x8D39;&#x8005;&#x5E0C;&#x671B;&#x5176;&#x80FD;&#x591F;&#x65E2;&#x4F5C;&#x4E3A;<code>T</code>&#x4E5F;&#x4F5C;&#x4E3A;<code>S</code>&#xFF0C;&#x800C;&#x540E;&#x4E00;&#x70B9;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x3002;&#x4F8B;&#x5982;&#x5BF9;&#x524D;&#x9762;&#x91CD;&#x8F7D;&#x7684;<code>+</code>&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;<code>T</code>&#x4E3A;<code>(number number -&gt; number)</code>&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x51FD;&#x6570;&#x65E0;&#x6CD5;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<h4 id="15373-&#x51FD;&#x6570;">15.3.7.3 &#x51FD;&#x6570;</h4>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x8BA8;&#x8BBA;&#x8FC7;&#x4E00;&#x79CD;&#x590D;&#x5408;&#x7C7B;&#x578B;&#xFF1A;&#x51FD;&#x6570;&#x3002;&#x3010;&#x6CE8;&#x91CA;&#x3011;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x51B3;&#x5B9A;&#x5B50;&#x7C7B;&#x578B;&#x5173;&#x7CFB;&#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A;&#x51FD;&#x6570;&#x65F6;&#x7684;&#x89C4;&#x5219;&#x3002;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x51FD;&#x6570;&#x548C;&#x5176;&#x5B83;&#x7C7B;&#x578B;&#x4E0D;&#x76F8;&#x4EA4;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8003;&#x8651;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x4F5C;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x5B50;&#x7C7B;&#x578B;&#x7684;&#x60C5;&#x51B5;&#xFF1A;&#x4E5F;&#x65E2;&#xFF0C;&#x4F55;&#x65F6;&#x5F0F;&#x5B50;</p>
<pre><code class="lang-text">(S1 -&gt; T1) &lt;: (S2 -&gt; T2)
</code></pre>
<p>&#x6210;&#x7ACB;&#xFF1F;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x7C7B;&#x578B;<code>(S1 -&gt; T1)</code>&#x4E3A;<code>f1</code>&#xFF0C;<code>(S2 -&gt; T2)</code>&#x4E3A;<code>f2</code>&#x3002;&#x95EE;&#x9898;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x671F;&#x671B;&#x7C7B;&#x578B;&#x4E3A;<code>f2</code>&#xFF0C;&#x4F55;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7ED9;&#x5176;&#x4F20;&#x9012;<code>f1</code>&#x7C7B;&#x578B;&#x7684;&#x51FD;&#x6570;&#x662F;&#x5B89;&#x5168;&#x7684;&#xFF1F;&#x4F7F;&#x7528;&#x5B50;&#x96C6;&#x5408;&#x89E3;&#x91CA;&#x6765;&#x8003;&#x8651;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x3002;</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x8BA8;&#x8BBA;&#x8FC7;&#x53C2;&#x6570;&#x5316;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x5BF9;&#x5B83;&#x4EEC;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x63A2;&#x7D22;&#x4F5C;&#x4E3A;&#x7EC3;&#x4E60;&#x7559;&#x7ED9;&#x8BFB;&#x8005;&#x3002;</p>
</blockquote>
<p>&#x8003;&#x8651;<code>f2</code>&#x7C7B;&#x578B;&#x7684;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x4E3A;<code>T2</code>&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6240;&#x5728;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4F1A;&#x5BF9;<code>T2</code>&#x7C7B;&#x578B;&#x7684;&#x503C;&#x6EE1;&#x610F;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x5982;&#x679C;<code>T1</code>&#x548C;<code>T2</code>&#x76F8;&#x540C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x91CC;<code>f2</code>&#x7684;&#x4F7F;&#x7528;&#x4E5F;&#x80FD;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF1B;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x5982;&#x679C;<code>T1</code>&#x662F;<code>T2</code>&#x503C;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x552F;&#x4E00;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x679C;<code>T1</code>&#x7684;&#x503C;&#x6BD4;<code>T2</code>&#x591A;&#xFF0C;&#x8BE5;&#x4E0A;&#x4E0B;&#x6587;&#x5C06;&#x53EF;&#x80FD;&#x906D;&#x9047;&#x975E;&#x671F;&#x671B;&#x7684;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x672A;&#x5B9A;&#x4E49;&#x884C;&#x4E3A;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;<code>T1 &lt;: T2</code>&#x3002;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x5305;&#x542B;&#x7684;&#x201C;&#x65B9;&#x5411;&#x201D;&#x4E0E;&#x6574;&#x4E2A;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x65B9;&#x5411;&#x76F8;&#x540C;&#xFF1B;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x534F;&#x53D8;</strong>&#xFF08;covariance&#xFF0C;&#x4E24;&#x8005;&#x5728;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5411;&#x4E0A;&#x53D8;&#x5316;&#xFF09;&#x3002;&#x8FD9;&#x4E5F;&#x8BB8;&#x6B63;&#x662F;&#x4F60;&#x6240;&#x671F;&#x671B;&#x7684;&#x3002;</p>
<p>&#x51FA;&#x4E8E;&#x540C;&#x6837;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8BA4;&#x4E3A;&#x53C2;&#x6570;&#x4F4D;&#x7F6E;&#x4E5F;&#x51FA;&#x73B0;&#x534F;&#x53D8;&#xFF1A;&#x5373;<code>S1 &lt;: S2</code>&#x3002;&#x8FD9;&#x4E5F;&#x7B26;&#x5408;&#x9884;&#x671F;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x9519;&#x7684;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4E3A;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x8C03;&#x7528;<code>f2</code>&#x7C7B;&#x578B;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x7C7B;&#x578B;&#x4E3A;<code>S2</code>&#x7684;&#x503C;&#x4F5C;&#x53C2;&#x6570;&#x3002;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x5C06;&#x51FD;&#x6570;&#x66FF;&#x6362;&#x4E3A;&#x7C7B;&#x578B;<code>f1</code>&#x7684;&#x3002;&#x5982;&#x679C;<code>S1 &lt;: S2</code>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x65B0;&#x51FD;&#x6570;&#x4EC5;&#x80FD;&#x63A5;&#x53D7;<code>S1</code>&#x7C7B;&#x578B;&#x7684;&#x503C;&#x2014;&#x2014;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E25;&#x683C;&#x5B50;&#x96C6;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x503C;&#x2014;&#x2014;&#x5728;<code>S2</code>&#x4E2D;&#x4F46;&#x4E0D;&#x5728;<code>S1</code>&#x4E2D;&#x7684;&#x503C;&#x2014;&#x2014;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4F1A;&#x63D0;&#x4F9B;&#x5B83;&#x4EEC;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x6362;&#x5165;&#x7684;&#x51FD;&#x6570;&#x5728;&#x5B83;&#x4EEC;&#x4E4B;&#x4E0A;&#x5E76;&#x65E0;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4E3A;&#x907F;&#x514D;&#x6B64;&#xFF0C;&#x9700;&#x8981;&#x5047;&#x5B9A;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x5411;&#xFF1A;&#x5373;&#x66FF;&#x4EE3;&#x51FD;&#x6570;&#x5E94;&#x8BE5;&#x81F3;&#x5C11;&#x80FD;&#x63A5;&#x6536;&#x539F;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x63A5;&#x6536;&#x7684;&#x90A3;&#x4E9B;&#x503C;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;<code>S2 &lt;: S1</code>&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x8BE5;&#x4F4D;&#x7F6E;&#x662F;<strong>&#x9006;&#x53D8;</strong>&#xFF08;contravariant&#xFF09;&#x7684;&#xFF1A;&#x5B83;&#x548C;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x65B9;&#x5411;&#x76F8;&#x53CD;&#x3002;</p>
<p>&#x7EFC;&#x5408;&#x8FD9;&#x4E24;&#x4E2A;&#x53D1;&#x73B0;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x51FD;&#x6570;&#xFF08;&#x5BF9;&#x4E8E;&#x65B9;&#x6CD5;&#x4E5F;&#x4E00;&#x6837;&#xFF09;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x89C4;&#x5219;&#xFF1A;</p>
<pre><code class="lang-Racket">(S2 &lt;: S1) and (T1 &lt;: T2) =&gt; (S1 -&gt; T1) &lt;: (S2 -&gt; T2)
</code></pre>
<h4 id="15374-&#x5B9E;&#x73B0;&#x5B50;&#x7C7B;&#x578B;">15.3.7.4 &#x5B9E;&#x73B0;&#x5B50;&#x7C7B;&#x578B;</h4>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x5047;&#x5B9A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4FEE;&#x6539;&#x4E86;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x9075;&#x5FAA;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x8981;&#x6C42;&#x3002;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x672C;&#x8D28;&#x89C4;&#x5219;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8868;&#x8FBE;&#x5F0F;<code>e</code>&#xFF0C;&#x5176;&#x7C7B;&#x578B;&#x4E3A;<code>S</code>&#xFF0C;&#x4E14;<code>S &lt;: T</code>&#xFF0C;&#x90A3;&#x4E48;<code>e</code>&#x4E5F;&#x5177;&#x6709;&#x7C7B;&#x578B;<code>T</code>&#x3002;&#x867D;&#x7136;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x76F4;&#x89C2;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x539F;&#x56E0;&#x6709;&#x4E8C;&#xFF1A;</p>
<ul>
<li>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x578B;&#x89C4;&#x5219;&#x90FD;&#x662F;&#x8BED;&#x6CD5;&#x9A71;&#x52A8;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x9012;&#x5F52;&#x4E0B;&#x964D;&#x7684;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x3002;&#x4F46;&#x73B0;&#x5728;&#x6709;&#x53EF;&#x4E00;&#x6761;&#x9002;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x5E94;&#x7528;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x4E86;&#x3002;</li>
<li>&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x7EA7;&#x522B;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x4F55;&#x65F6;&#x201C;&#x505C;&#x6B62;&#x201D;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x4E0D;&#x518D;&#x662F;&#x4E2A;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x539F;&#x6765;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x4F1A;&#x6C42;&#x51FA;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x73B0;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x53EF;&#x80FD;&#x7684;&#x7C7B;&#x578B;&#xFF1B;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FD4;&#x56DE;&#x4E86;&#x201C;&#x9519;&#x8BEF;&#x201D;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7C7B;&#x578B;&#x9519;&#x8BEF;&#xFF08;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x662F;&#x4E0A;&#x4E0B;&#x6587;&#x671F;&#x671B;&#x7684;&#x7C7B;&#x578B;&#xFF09;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x5176;&#x5B83;&#x7684;&#x7C7B;&#x578B;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x4E0A;&#x4E0B;&#x6587;&#x9700;&#x6C42;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x6307;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x7684;&#x5173;&#x4E8E;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x63CF;&#x8FF0;&#x6839;&#x672C;&#x4E0A;&#x6765;&#x8BF4;&#x662F;<strong>&#x58F0;&#x660E;&#x6027;&#x7684;</strong>&#xFF1A;&#x6211;&#x4EEC;&#x63CF;&#x8FF0;&#x4E86;&#x5B83;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x5C06;&#x8FD9;&#x79CD;&#x8BF4;&#x660E;&#x8F6C;&#x6362;&#x6210;&#x7B97;&#x6CD5;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x6210;<strong>&#x5B50;&#x7C7B;&#x578B;&#x7B97;&#x6CD5;</strong>&#x2014;&#x2014;&#x5B9E;&#x73B0;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x7684;&#x5B9E;&#x9645;&#x7B97;&#x6CD5;&#xFF08;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x4EC5;&#x8BA9;&#x6240;&#x6709;&#x58F0;&#x660E;&#x673A;&#x5236;&#x4E0B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6709;&#x6548;&#x7684;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x7C7B;&#x578B;&#x68C0;&#x6D4B;&#xFF0C;&#x4E5F;&#x5373;&#xFF0C;&#x65E2;&#x53EF;&#x9760;&#x53C8;&#x5B8C;&#x5907;&#xFF09;&#x2014;&#x2014;&#x6216;&#x591A;&#x6216;&#x5C11;&#x662F;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="1538-&#x5BF9;&#x8C61;&#x7C7B;&#x578B;">15.3.8 &#x5BF9;&#x8C61;&#x7C7B;&#x578B;</h3>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;<a href="chap15.html#1534-&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E0E;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;">&#x524D;&#x9762;</a>&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x901A;&#x5E38;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x9635;&#x8425;&#xFF1A;&#x540D;&#x4E49;&#x7684;&#x548C;&#x7ED3;&#x6784;&#x7684;&#x3002;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x901A;&#x8FC7;Java&#x90FD;&#x719F;&#x6089;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x591A;&#x8BA8;&#x8BBA;&#x3002;&#x5BF9;&#x8C61;&#x7684;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#x662F;&#x8BF4;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7531;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x5B57;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x7C7B;&#x578B;&#x7EC4;&#x6210;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x2014;&#x2014;<code>add1</code>&#x548C;<code>sub1</code>&#x2014;&#x2014;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x7C7B;&#x578B;&#x5C06;&#x662F;&#xFF1A;</p>
<pre><code class="lang-Racket">{add1 : (number -&gt; number), sub1 : (number -&gt; number)}
</code></pre>
<p>&#xFF08;&#x4E3A;&#x65B9;&#x4FBF;&#x5F15;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A;<code>addsub</code>&#x3002;&#xFF09;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x505A;&#x6CD5;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x9884;&#x8BA1;&#xFF1A;&#x5BF9;&#x4E8E;&#x5B57;&#x6BB5;&#x7684;&#x8BBF;&#x95EE;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x786E;&#x4FDD;&#x5B57;&#x6BB5;&#x5B58;&#x5728;&#xFF0C;&#x5E76;&#x5C06;&#x89E3;&#x5F15;&#x7528;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x6C42;&#x4E3A;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x58F0;&#x660E;&#x7C7B;&#x578B;&#xFF1B;&#x5BF9;&#x4E8E;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x5BF9;&#x5E94;&#x6210;&#x5458;&#x5B58;&#x5728;&#xFF0C;&#x8FD8;&#x8981;&#x786E;&#x4FDD;&#x5176;&#x7C7B;&#x578B;&#x662F;&#x51FD;&#x6570;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x5F88;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x4F1A;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x539F;&#x56E0;&#x800C;&#x53D8;&#x590D;&#x6742;&#xFF1A;</p>
<blockquote>
<p>&#x5F88;&#x591A;&#x4E66;&#x90FD;&#x4E13;&#x6CE8;&#x4E8E;&#x6B64;&#x95EE;&#x9898;&#x3002;&#x5C3D;&#x7BA1;&#x6709;&#x70B9;&#x8FC7;&#x65F6;&#xFF0C;&#x4F46;&#x662F;Abadi&#x548C;Carelli&#x7684;&#x300A;A Theory of Objects&#xFF08;&#x5BF9;&#x8C61;&#x7406;&#x8BBA;&#xFF09;&#x300B;&#x4ECD;&#x7136;&#x5F88;&#x91CD;&#x8981;&#x3002;Bruce&#x7684;&#x300A;Foundationos of Object-Oriented Languages: Types and Semantics&#xFF08;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x57FA;&#x7840;&#xFF1A;&#x7C7B;&#x578B;&#x548C;&#x8BED;&#x4E49;&#xFF09;&#x300B;&#x66F4;&#x4E3A;&#x73B0;&#x4EE3;&#xFF0C;&#x9610;&#x8FF0;&#x4E5F;&#x66F4;&#x6E29;&#x548C;&#x3002;Pierce&#x7684;&#x4E66;&#x5219;&#x6F02;&#x4EAE;&#x7684;&#x8986;&#x76D6;&#x4E86;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x7406;&#x8BBA;&#x3002;</p>
</blockquote>
<ul>
<li>&#x81EA;&#x5F15;&#x7528;&#x3002;<code>self</code>&#x7684;&#x7C7B;&#x578B;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x5FC5;&#x987B;&#x548C;&#x6574;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x4ECE;&#x201C;&#x5916;&#x90E8;&#x201D;&#x65BD;&#x52A0;&#x5230;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<code>self</code>&#x5728;&#x201C;&#x5185;&#x90E8;&#x201D;&#x65BD;&#x52A0;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x8C61;&#x662F;&#x9012;&#x5F52;&#x7C7B;&#x578B;&#x3002;</li>
<li>&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF1A;&#x79C1;&#x6709;&#xFF08;private&#xFF09;&#x3001;&#x516C;&#x5171;&#xFF08;public&#xFF09;&#x548C;&#x5176;&#x5B83;&#x9650;&#x5236;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x5BF9;&#x8C61;&#x201C;&#x5916;&#x90E8;&#x201D;&#x548C;&#x201C;&#x5185;&#x90E8;&#x201D;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x3002;</li>
<li>&#x7EE7;&#x627F;&#xFF1A;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x4E3A;&#x7236;&#x5BF9;&#x8C61;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x8003;&#x8651;&#x7EE7;&#x627F;&#x8DEF;&#x5F84;&#x4E0A;&#x54EA;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x89C1;&#xFF0C;&#x8FD9;&#x548C;&#x201C;&#x5916;&#x90E8;&#x201D;&#x53EF;&#x89C1;&#x7684;&#x4E1C;&#x897F;&#x53C8;&#x6709;&#x533A;&#x522B;&#x3002;</li>
<li>&#x591A;&#x91CD;&#x7EE7;&#x627F;&#x548C;&#x5B50;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;</li>
<li>&#x50CF;Java&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7C7B;&#x548C;&#x63A5;&#x53E3;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5B58;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x6210;&#x672C;&#x3002;</li>
<li>&#x8D4B;&#x503C;&#x3002;</li>
<li>&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;</li>
<li>&#x6A2A;&#x751F;&#x679D;&#x8282;&#x3002;</li>
</ul>
<p>&#x7B49;&#x7B49;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x4F1A;&#x56E0;&#x4E3A;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x800C;&#x7B80;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x7ED9;&#x5B9A;&#x7C7B;&#x578B;&#x540D;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5176;&#x884C;&#x4E3A;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF08;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x5B9E;&#x9645;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5B57;&#x5178;&#xFF0C;&#x4ECE;&#x4E2D;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x5173;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x63CF;&#x8FF0;&#xFF09;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x8D5E;&#x6210;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x8BBA;&#x636E;&#x3002;</p>
<blockquote>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;Java&#x7684;&#x65B9;&#x6CD5;&#x4E0D;&#x662F;&#x6784;&#x5EFA;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x3002;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF0C;Java&#x7684;&#x7C7B;&#x7CFB;&#x7EDF;&#x4E0D;&#x5FC5;&#x8981;&#x5730;&#x9650;&#x5236;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#xFF1B;&#x76F8;&#x5E94;&#x5730;&#xFF0C;Java&#x7684;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x4E0D;&#x5FC5;&#x8981;&#x5730;&#x5C06;&#x7C7B;&#x578B;&#xFF08;&#x63A5;&#x53E3;&#x63CF;&#x8FF0;&#xFF09;&#x548C;&#x5B9E;&#x73B0;&#x6DF7;&#x4E3A;&#x4E00;&#x8C08;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6BD4;Java&#x505A;&#x7684;&#x597D;&#x5F97;&#x591A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Scala&#x5728;&#x8FD9;&#x4E2A;&#x65B9;&#x9762;&#x5C31;&#x505A;&#x51FA;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x6539;&#x53D8;&#x3002;</p>
</blockquote>
<p>&#x5BF9;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x5145;&#x5206;&#x8BBA;&#x8FF0;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x7BC7;&#x5E45;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x8BA8;&#x8BBA;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#xFF0C;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x8FEB;&#x4F7F;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x5668;&#x5417;&#xFF1F;&#x6709;&#x4E86;&#x5BF9;&#x8C61;&#x7684;&#x7ED3;&#x6784;&#x7C7B;&#x578B;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5FC5;&#x987B;&#x591A;&#x8003;&#x8651;&#x4E00;&#x79CD;&#xFF1A;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x6784;&#x9020;&#x5668;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4E86;&#x89E3;&#x5B83;&#x4E0E;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x5148;&#x6765;&#x786E;&#x4FDD;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x5230;&#x5E95;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;&#x8003;&#x8651;&#x4E0A;&#x9762;&#x7684;<code>addsub</code>&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x4E2D;&#x5217;&#x51FA;&#x4E86;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x4EC0;&#x4E48;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x662F;&#x5B83;&#xFF1F;&#x663E;&#x7136;&#xFF0C;&#x6070;&#x597D;&#x62E5;&#x6709;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x3001;&#x4E14;&#x65B9;&#x6CD5;&#x7684;&#x7C7B;&#x578B;&#x7B26;&#x5408;&#x7684;&#x5BF9;&#x8C61;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x3002;&#x540C;&#x6837;&#x660E;&#x663E;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x53EA;&#x5305;&#x542B;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x800C;&#x4E0D;&#x542B;&#x53E6;&#x4E00;&#x4E2A;&#xFF0C;&#x4E0D;&#x7BA1;&#x5B83;&#x8FD8;&#x5305;&#x542B;&#x6709;&#x5176;&#x5B83;&#x4EC0;&#x4E48;&#xFF0C;&#x90FD;&#x4E0D;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x3002;&#x4F46;&#x5176;&#x4E2D;&#x77ED;&#x8BED;&#x201C;&#x4E0D;&#x7BA1;&#x5B83;&#x8FD8;&#x5305;&#x542B;&#x5176;&#x5B83;&#x4EC0;&#x4E48;&#x201D;&#x662F;&#x6700;&#x5148;&#x8981;&#x8003;&#x8651;&#x7684;&#x3002;&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x8868;&#x793A;&#x7684;&#x662F;&#x7B97;&#x672F;&#x5305;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x8FD8;&#x5305;&#x542B;<code>+</code>&#x548C;<code>*</code>&#x5462;&#xFF08;&#x6240;&#x6709;&#x65B9;&#x6CD5;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x90FD;&#x6B63;&#x786E;&#xFF09;&#xFF1F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5BF9;&#x8C61;&#x5F53;&#x7136;&#x80FD;&#x63D0;&#x4F9B;&#x4E0A;&#x9762;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x7B97;&#x672F;&#x5305;&#x786E;&#x5B9E;&#x5177;&#x6709;&#x7C7B;&#x578B;<code>addsub</code>&#x3002;&#x4E0D;&#x8FC7;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x7C7B;&#x578B;<code>addsub</code>&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5176;&#x5B83;&#x65B9;&#x6CD5;&#x4E0D;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5199;&#x4E0B;&#x8FD9;&#x4E2A;&#x5305;&#x7684;&#x5B8C;&#x6574;&#x7C7B;&#x578B;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;<code>as+*</code>&#xFF1A;</p>
<pre><code class="lang-text">{add1  : (number -&gt; number),
 sub1  : (number -&gt; number),
 +     : (number number -&gt; number),
 *     : (number number -&gt; number)}
</code></pre>
<p>&#x524D;&#x9762;&#x8BBA;&#x8BC1;&#x7684;&#x662F;&#xFF0C;&#x7C7B;&#x578B;<code>as+*</code>&#x7684;&#x5BF9;&#x8C61;&#x4E5F;&#x5141;&#x8BB8;&#x88AB;&#x58F0;&#x660E;&#x4E3A;&#x7C7B;&#x578B;<code>addsub</code>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x53EF;&#x4EE5;&#x653E;&#x5165;&#x4EFB;&#x4F55;&#x671F;&#x671B;<code>addsub</code>&#x7C7B;&#x578B;&#x503C;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x521A;&#x624D;&#x7684;&#x610F;&#x601D;&#x5176;&#x5B9E;&#x662F;<code>as+* &lt;: addsub</code>&#xFF1A;</p>
<pre><code class="lang-text">{add1  : (number -&gt; number),           {add1 : (number -&gt; number),
 sub1  : (number -&gt; number),        &lt;:  sub1 : (number -&gt; number)}
 +     : (number number -&gt; number),
 *     : (number number -&gt; number)}
</code></pre>
<p>&#x8FD9;&#x53EF;&#x80FD;&#x4E4D;&#x4E00;&#x770B;&#x4EE4;&#x4EBA;&#x56F0;&#x60D1;&#xFF1A;&#x6211;&#x4EEC;&#x8BF4;&#x8FC7;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x9075;&#x4ECE;&#x96C6;&#x5408;&#x5305;&#x542B;&#x5173;&#x7CFB;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x5C0F;&#x7684;&#x96C6;&#x5408;&#x5728;&#x5DE6;&#x4FA7;&#x800C;&#x5927;&#x7684;&#x96C6;&#x5408;&#x5728;&#x53F3;&#x4FA7;&#x3002;&#x53EF;&#x8FD9;&#x91CC;&#xFF0C;&#x597D;&#x50CF;&#x201C;&#x5927;&#x7684;&#x7C7B;&#x578B;&#x201D;&#xFF08;&#x81F3;&#x5C11;&#x5728;&#x5B57;&#x7B26;&#x6570;&#x91CF;&#x7684;&#x610F;&#x4E49;&#x4E0A;&#x662F;&#xFF09;&#x5728;&#x5DE6;&#x4FA7;&#x800C;&#x201C;&#x5C0F;&#x7684;&#x7C7B;&#x578B;&#x201D;&#x5728;&#x53F3;&#x4FA7;&#x3002;</p>
<p>&#x8981;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x8FD9;&#x6837;&#x7684;&#x76F4;&#x89C9;&#xFF1A;&#x201C;&#x8D8A;&#x5927;&#x201D;&#x7684;&#x7C7B;&#x578B;&#x5305;&#x542B;&#x7684;&#x503C;&#x8D8A;&#x5C11;&#x3002;&#x5DE6;&#x4FA7;&#x7684;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x542B;&#x6709;&#x56DB;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E14;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x53F3;&#x4FA7;&#x7684;&#x90A3;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x5BF9;&#x8C61;&#x6709;&#x53F3;&#x4FA7;&#x7684;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5305;&#x542B;&#x5DE6;&#x4FA7;&#x90A3;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x6211;&#x5C06;&#x7C7B;&#x578B;&#x770B;&#x4F5C;&#x5BF9;&#x53EF;&#x63A5;&#x53D7;&#x503C;&#x5F62;&#x72B6;&#x7684;&#x7EA6;&#x675F;&#x7684;&#x8BDD;&#xFF0C;&#x201C;&#x66F4;&#x5927;&#x201D;&#x7684;&#x7C7B;&#x578B;&#x7ED9;&#x5B9A;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x7EA6;&#x675F;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x5C11;&#x7684;&#x503C;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;<strong>&#x7C7B;&#x578B;</strong>&#x7684;&#x5927;&#x5C0F;&#x5173;&#x7CFB;&#x53EF;&#x80FD;&#x770B;&#x4E0A;&#x53BB;&#x4E0D;&#x5BF9;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x6240;&#x5305;&#x542B;&#x7684;&#x503C;&#x7684;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x5173;&#x7CFB;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<p>&#x66F4;&#x4E00;&#x822C;&#x5730;&#xFF0C;&#x8FD9;&#x8868;&#x660E;&#x4ECE;&#x5BF9;&#x8C61;&#x4E2D;&#x5220;&#x9664;&#x5B57;&#x6BB5;&#x5C31;&#x80FD;&#x83B7;&#x5F97;&#x8D85;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5BBD;&#x5EA6;&#x5B50;&#x7C7B;&#x578B;&#x5316;</strong>&#xFF08;width subtyping&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x5B50;&#x7C7B;&#x578B;&#x201C;&#x66F4;&#x5BBD;&#x201D;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x5BF9;&#x8C61;&#x201C;&#x5BBD;&#x5EA6;&#x201D;&#x6765;&#x79FB;&#x52A8;&#x5230;&#x66F4;&#x4E0A;&#x5C42;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5373;&#x4F7F;&#x5728;Java&#x7684;&#x540D;&#x4E49;&#x7C7B;&#x578B;&#x4E16;&#x754C;&#x4E2D;&#x4E5F;&#x80FD;&#x770B;&#x5230;&#x8FD9;&#x70B9;&#xFF1A;&#x5F53;&#x6CBF;&#x7740;&#x7EE7;&#x627F;&#x94FE;&#x4E0A;&#x6EAF;&#x65F6;&#xFF0C;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x5B57;&#x6BB5;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x76F4;&#x5230;<code>Object</code>&#x2014;&#x2014;&#x6240;&#x6709;&#x7C7B;&#x7684;&#x8D85;&#x7C7B;&#x578B;&#x2014;&#x2014;&#x5305;&#x542B;&#x5F97;&#x6700;&#x5C11;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;Java&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x7C7B;&#x7C7B;&#x578B;<code>C</code>&#xFF0C;<code>C &lt;: Object</code>&#x3002;</p>
<blockquote>
<p>&#x6709;&#x65F6;&#xFF0C;<strong>&#x7F29;&#x5C0F;</strong>&#xFF08;narrowing&#xFF09;&#x548C;<strong>&#x62D3;&#x5BBD;</strong>&#xFF08;widening&#xFF09;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x4F1A;&#x8BA9;&#x4EBA;&#x7591;&#x60D1;&#xFF0C;&#x5B83;&#x770B;&#x4E0A;&#x53BB;&#x597D;&#x50CF;&#x7528;&#x53CD;&#x4E86;&#x4E00;&#x6837;&#x3002;&#x62D3;&#x5BBD;&#x662F;&#x6307;&#x4ECE;&#x5B50;&#x7C7B;&#x578B;&#x8F6C;&#x5230;&#x8D85;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x201C;&#x8F83;&#x7A84;&#x201D;&#xFF08;&#x8F83;&#x5C0F;&#xFF09;&#x7684;&#x96C6;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x201C;&#x8F83;&#x5BBD;&#x201D;&#xFF08;&#x8F83;&#x5927;&#xFF09;&#x7684;&#x96C6;&#x5408;&#x3002;&#x8FD9;&#x4E9B;&#x672F;&#x8BED;&#x662F;&#x72EC;&#x7ACB;&#x6F14;&#x5316;&#x800C;&#x6765;&#x7684;&#xFF0C;&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x5E76;&#x4E0D;&#x4E00;&#x81F4;&#x3002;</p>
</blockquote>
<p>&#x6B63;&#x5982;&#x4F60;&#x53EF;&#x80FD;&#x9884;&#x8BA1;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x91CD;&#x8981;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x5F62;&#x5F0F;&#xFF0C;&#x662F;&#x5173;&#x4E8E;&#x7ED9;&#x5B9A;&#x6210;&#x5458;<strong>&#x5185;&#x90E8;</strong>&#x7684;&#x3002;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x6210;&#x5458;&#x90FD;&#x53EF;&#x4EE5;&#x5F52;&#x5165;&#x76F8;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x8D85;&#x7C7B;&#x578B;&#x3002;&#x51FA;&#x4E8E;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6DF1;&#x5EA6;&#x5B50;&#x7C7B;&#x578B;&#x5316;</strong>&#xFF08;depth subtyping&#xFF09;&#x3002;</p>
<p><strong>&#x7EC3;&#x4E60;&#x9898;</strong></p>
<blockquote>
<p>&#x6784;&#x9020;&#x4E24;&#x4E2A;&#x6DF1;&#x5EA6;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x7ED9;&#x5B9A;&#x5B57;&#x6BB5;&#x4E3A;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x4F7F;&#x7528;&#x5BBD;&#x5EA6;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x53BB;&#x53D6;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7ED9;&#x5B9A;&#x5B57;&#x6BB5;&#x4E3A;&#x51FD;&#x6570;&#x7C7B;&#x578B;&#x3002;</p>
</blockquote>
<p>Java&#x4E2D;&#x9650;&#x5236;&#x4E86;&#x6DF1;&#x5EA6;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#xFF0C;&#x5B83;&#x503E;&#x5411;&#x4E8E;&#x7C7B;&#x578B;&#x5728;&#x5BF9;&#x8C61;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5BF9;&#x4F20;&#x7EDF;&#x7684;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x6765;&#x8BF4;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>&#x5BBD;&#x5EA6;&#x548C;&#x6DF1;&#x5EA6;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x7ED3;&#x5408;&#x5305;&#x542B;&#x4E86;&#x5BF9;&#x8C61;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x60C5;&#x5F62;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4EC5;&#x5B9E;&#x73B0;&#x8FD9;&#x4E24;&#x79CD;&#x5B50;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x4F1A;&#x62DB;&#x81F4;&#x7A0B;&#x5E8F;&#x5458;&#x607C;&#x706B;&#x3002;&#x5176;&#x5B83;&#x65B9;&#x4FBF;&#x7684;&#xFF08;&#x800C;&#x4E14;&#x6570;&#x5B66;&#x4E0A;&#x5FC5;&#x987B;&#x7684;&#xFF09;&#x89C4;&#x5219;&#x8FD8;&#x5305;&#x62EC;&#xFF1A;&#x6539;&#x53D8;&#x540D;&#x79F0;&#x6392;&#x5217;&#x987A;&#x5E8F;&#x7684;&#x80FD;&#x529B;&#x3001;&#x53CD;&#x8EAB;&#x6027;&#xFF08;&#x6BCF;&#x4E2A;&#x7C7B;&#x578B;&#x662F;&#x5176;&#x81EA;&#x5DF1;&#x7684;&#x5B50;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x5C06;&#x5B50;&#x7C7B;&#x578B;&#x5173;&#x7CFB;&#x89E3;&#x91CA;&#x4E3A;<code>&#x2286;</code>&#x66F4;&#x65B9;&#x4FBF;&#xFF09;&#x548C;&#x4F20;&#x9012;&#x6027;&#x3002;&#x50CF;Typed JavaScript&#x8FD9;&#x6837;&#x7684;&#x8BED;&#x8A00;&#x4F7F;&#x7528;&#x4E86;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#x63D0;&#x4F9B;&#x6700;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chap14.html" class="navigation navigation-prev " aria-label="Previous page: 14. 控制指令">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chap16.html" class="navigation navigation-next " aria-label="Next page: 16. 动态地检查程序中的不变量：契约">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"15. 静态地检查程序中的不变量：类型","level":"1.16","depth":1,"next":{"title":"16. 动态地检查程序中的不变量：契约","level":"1.17","depth":1,"path":"chap16.md","ref":"chap16.md","articles":[]},"previous":{"title":"14. 控制指令","level":"1.15","depth":1,"path":"chap14.md","ref":"chap14.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"ga":{"configuration":"auto","token":"UA-76420995-1"},"katex":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"lotuc; MrMathematica","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Programming Languages: Application and Interpretation","gitbook":"*"},"file":{"path":"chap15.md","mtime":"2018-09-28T07:36:04.700Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-28T07:36:08.800Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

